{"introduction": "Dans le domaine de la création et du design, l'expertise en techniques de production est essentielle pour transformer des idées innovantes en produits visuels concrets. Ce chapitre explore les différentes méthodes et processus impliqués dans la conception graphique, en mettant l'accent sur l'importance de la cohérence visuelle, de l'expérience utilisateur, et des normes de production. À travers une série de concepts clés, nous examinerons comment ces éléments interagissent pour créer des projets graphiques réussis.", "synthesis": "Les techniques de production constituent le fondement sur lequel reposent tous les projets graphiques. Elles englobent les méthodes utilisées pour réaliser des créations tout en respectant les normes prépresse et les spécificités des fichiers de fabrication adaptés à divers supports. La création elle-même est un processus dynamique qui nécessite créativité et innovation pour développer des idées originales répondant aux besoins du marché.\n\nUn aspect crucial du design moderne est le design system, qui standardise les éléments graphiques et assure une expérience utilisateur homogène à travers différents produits. En parallèle, l'expérience utilisateur (UX) et l'expérience client sont au cœur du développement produit, visant à optimiser la satisfaction par une interface conviviale et esthétique. La direction artistique (D.A) joue également un rôle clé dans ce processus en définissant l'identité visuelle d'une marque grâce à des choix stratégiques concernant couleurs et typographies.\n\nLa conception web se concentre sur la création d'interfaces numériques alliant esthétique et fonctionnalité. Cela inclut non seulement le design UI mais aussi la prise en compte des tendances modernes comme le mode sombre ou la commande vocale. La communication visuelle est également essentielle ; elle utilise divers supports graphiques pour transmettre efficacement un message tout en renforçant l'identité de marque.\n\nEn matière technique, comprendre les modèles colorimétriques CMJN/RVB est indispensable pour garantir une reproduction fidèle des couleurs selon le support choisi. Le processus complet allant de la création graphique à la chaîne graphique finale assure que chaque étape respecte les standards nécessaires pour produire un résultat optimal.\n\nLa cohérence visuelle renforce non seulement la reconnaissance d'une marque mais améliore également son image sur le marché. Des outils comme le wireframing permettent d'organiser efficacement les éléments fonctionnels d'une interface avant sa finalisation, tandis que la lisibilité garantit une communication claire avec l'utilisateur final.\n\nEnfin, des pratiques telles que la veille graphique aident les designers à rester informés sur les tendances actuelles tout en maintenant une image cohérente pour leurs projets. Les gabarits facilitent également cette uniformité dans le packaging ou lors de mises en page multiples. En somme, chaque concept abordé ici contribue à forger un expert capable d'allier créativité technique et sensibilité esthétique dans ses productions.", "concepts": [{"concept": {"id": "6f331ec9-8301-4698-be14-1c6426cb04e9", "label": "Techniques de Production", "definition": "Méthodes utilisées pour réaliser des projets graphiques, incluant les normes prépresse et les fichiers de fabrication adaptés aux différents supports.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les techniques de production sont essentielles pour un expert en création et design, car elles englobent les méthodes nécessaires à la réalisation de projets graphiques."}, {"concept": {"id": "8995d1ba-6deb-4865-91a8-8aafbfe06f2e", "label": "Création", "definition": "Processus de conception et de développement d'idées originales ou de produits, souvent lié à l'art, au design graphique et digital, ainsi qu'à l'innovation technique dans divers domaines. Ce processus implique créativité et innovation pour créer des visuels impactants et répondre aux besoins des clients.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696, 13699, 13701], "aliases": ["7a5659cd-6b9e-40b7-956a-63df5c07c263", "50ae0ae3-b8c0-48f3-ba21-f9d2645571ab", "37281b9b-304c-466d-a4dd-b22491ef6b35"], "wikientity": null, "wordnetentity": {"label": "Création", "definition": "the act of forming or establishing something", "name": "constitution.n.04", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "La création est au cœur du rôle d'un expert en design, impliquant le développement d'idées originales et l'innovation dans le processus créatif."}, {"concept": {"id": "e556234c-14c3-4a91-b9f3-09ab5c4eeb46", "label": "Fichiers de production", "definition": "Documents finaux préparés selon des normes spécifiques pour la fabrication ou la publication, incluant tous les éléments nécessaires à assurer la qualité et la précision dans le processus créatif et d'impression.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13696, 13684], "aliases": ["4f26ab66-3d3c-4a59-8197-3a9afd81eaec"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les fichiers de production sont essentiels pour garantir que tous les éléments nécessaires à la fabrication soient conformes aux normes requises dans le processus créatif."}, {"concept": {"id": "1ef72a7e-5e74-4275-8671-d3b08e7e6482", "label": "Design System", "definition": "Un design system est une bibliothèque standardisée d'éléments graphiques, de composants réutilisables et de règles de branding unifiées, qui assurent la cohérence visuelle et fonctionnelle dans le développement de produits, sites ou applications. Il vise à standardiser le développement et à garantir une expérience utilisateur homogène à travers plusieurs produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13700], "aliases": ["9dbaffae-3852-4454-b66b-2adfc8c61863", "959c321e-cd66-4ef2-beec-74a58976030e"], "wikientity": {"label": "Système de design", "definition": "Un système de design, un système de conception ou un design system est un ensemble de composants réutilisables et de normes claires qui peuvent être assemblés pour créer un nombre illimité d'applications. Les systèmes de design aident à la conception de produits numériques et au développement de produits tels que des applications mobiles ou des sites Web. Ils peuvent contenir, sans toutefois s'y limiter, des bibliothèques de modèles/composants, des dictionnaires de conception, des guides de style (police, couleur, espacement, placement), des composants codés, des langages de marque et de la documentation.", "page_id": "16328891", "wikidata_id": "Q81875083", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le Design System est essentiel pour un expert en techniques de production, car il assure la cohérence et l'efficacité dans le développement de produits, ce qui est central à la création et au design."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "L'expérience utilisateur et client est centrale dans le design moderne; comprendre comment optimiser cette expérience est fondamental pour un expert en techniques de production."}, {"concept": {"id": "23743aea-fb84-4a89-8efc-5e4f8892f905", "label": "D.A (Direction Artistique)", "definition": "La Direction Artistique (D.A) est un processus créatif fondamental en publicité et design graphique, qui englobe la supervision et la gestion des aspects visuels d'un projet. Elle définit l'identité visuelle d'une marque ou d'un produit à travers des choix esthétiques stratégiques tels que les couleurs, typographies et mises en page. La D.A assure l'harmonie entre les éléments graphiques tout en garantissant que l'esthétique reflète les valeurs et le message de la marque, permettant ainsi une cohérence du message à travers tous les supports visuels.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13674, 13698, 13692, 13695, 13701], "aliases": ["7378cfd3-8d0f-416c-8e03-b566125f08d8", "43999cca-e063-435d-ad1b-c1a74d709de6", "cc04d9d2-e105-4736-8515-a8a76e82ecfa", "5a1701db-d1a2-4378-99fb-7a866d55a7ea", "eaf9a881-b403-4034-ac70-983dc4c321ce"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "La direction artistique joue un rôle clé dans la gestion des aspects visuels d'un projet; c'est fondamental pour assurer une identité visuelle cohérente dans toute création."}, {"concept": {"id": "681bd960-0547-4e06-81c7-c87e899af05b", "label": "Conception et design web", "definition": "La conception et le design web désignent le processus de création d'interfaces numériques qui allient esthétique et fonctionnalité pour optimiser l'expérience utilisateur. Cela inclut la conception de l'interface utilisateur, l'intégration des éléments du site de manière accessible et fonctionnelle, ainsi que la prise en compte des palettes de couleurs et des tendances modernes telles que la commande vocale et le mode sombre. L'objectif est de rendre les sites non seulement attrayants mais aussi faciles à naviguer, répondant ainsi aux besoins contemporains des utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13692], "aliases": ["408a71e5-2328-4efc-b763-2f6ddd50204c", "b73e3b1f-6972-406b-82f8-69acf4925e52", "e970bfbc-ec61-4fbe-a66a-e65a0ad0ba8c", "4384a27b-4e99-442c-bbc8-dfa1980e56fe", "dec0a245-63b1-4b4c-bce7-12be12f6d362"], "wikientity": {"label": "Conception de site web", "definition": "La conception  et la création site web ou web design est la conception de l'interface web : l’architecture interactionnelle, l’organisation des pages, l’arborescence et la navigation dans un site web. La conception d'un design web tient compte des contraintes spécifiques du support Internet, notamment en matière d’ergonomie, d’utilisabilité et d’accessibilité.\nLe web design réclame donc des compétences en programmation, en ergonomie et en interactivité, ainsi qu'une bonne connaissance des contraintes techniques liées à ce domaine.", "page_id": "807249", "wikidata_id": "Q190637", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La conception et le design web sont au cœur des compétences d'un expert en techniques de production, englobant tous les aspects nécessaires pour créer des interfaces numériques efficaces."}, {"concept": {"id": "dadb4cae-ecdd-4562-ad1c-c4f863b80368", "label": "Design digital", "definition": "Discipline qui englobe la création d'éléments visuels et de contenus numériques, incluant l'interface utilisateur (UI) et l'expérience utilisateur (UX), intégrant esthétique et fonctionnalité tout en influençant l'expérience utilisateur et le marketing moderne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696, 13699, 13701], "aliases": ["37366e80-dc38-4858-88b6-e28fcdd1db5d", "b664875f-3175-4572-8451-a28607cf63e8", "a1e23201-bb06-4457-b988-61590e500cb9"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le design digital est au cœur des techniques de production modernes, englobant des aspects cruciaux comme l'UI et l'UX qui sont fondamentaux pour un expert en création et design."}, {"concept": {"id": "a21faec3-d32a-4c71-91f4-aefc4c598939", "label": "Communication Visuelle", "definition": "La communication visuelle englobe l'utilisation cohérente de supports graphiques, tels que affiches, brochures et contenus numériques, pour transmettre des messages ou informations. Elle joue un rôle clé dans le marketing et l'identité de marque en influençant les perceptions des consommateurs à travers des éléments graphiques, couleurs et images. De plus, elle inclut la communication avec le client, un processus d'interaction essentiel pour établir une compréhension mutuelle entre professionnels et clients, garantissant ainsi la réussite d'un projet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699, 13701, 13673, 13609, 13679], "aliases": ["58125d4c-6ec1-489e-8c15-d25a94ccd651", "d0c830b7-7fde-41e6-849e-586c41002ee4", "8eeff97f-c508-4632-b615-654dec3f3e0c", "66a2ee09-4d4e-43ea-8cda-49b7872845d3"], "wikientity": {"label": "Communication visuelle", "definition": "La communication visuelle est une spécialité liée aux domaines de l'image, du design graphique, de l'audiovisuel et de la publicité.", "page_id": "7704996", "wikidata_id": "Q1899679", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La communication visuelle est centrale au domaine du design et des techniques de production, car elle affecte comment les messages sont transmis visuellement."}, {"concept": {"id": "15defe79-222b-4e72-ba93-cd496eeecbcc", "label": "CMJN/RVB", "definition": "Modèles colorimétriques utilisés respectivement pour l'impression (CMJN) et les écrans numériques (RVB), essentiels dans le design graphique et pour une reproduction fidèle des couleurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13698, 13680], "aliases": ["1db08c6d-ce04-4131-837a-d3813977de14"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les modèles CMJN/RVB sont fondamentaux pour tout designer travaillant sur des projets d'impression ou numériques, rendant ce concept central à la référence."}, {"concept": {"id": "1ed868d2-ce2e-459c-b87d-9c4088c62584", "label": "Chaîne graphique", "definition": "Processus complet allant de la création graphique à l'impression finale, impliquant plusieurs étapes comme conception et finition.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684], "aliases": [], "wikientity": {"label": "Chaîne graphique", "definition": "La chaine graphique est une expression, communément employée dans l'industrie graphique, pour désigner l'ensemble des professions qui interviennent de la conception à la finalisation d'un produit graphique qui sera produit à de multiples exemplaires par un procédé d'impression.\nCette appellation peut s'appliquer pour différents types de réalisations incluant généralement du texte et de l'image :\n\nCatalogues\nJournaux (presse quotidienne et gratuits)\nLivres d'éditeur\nMagazines (presse)\nPackaging, emballage de produits consommables : alimentaires, industriels, pharmaceutiques\nPLV : publicité sur le lieu de vente\nProspectus et encarts publicitaires\nTextile, papiers peints, PLV, décoration, papier-cadeau, etc.\nVente par correspondance (VPC)\nLes quatre maillons principaux de cette chaîne sont :\n\nLa création : développement du concept, mise en forme du projet (maquette), étude de la réalisation, choix des moyens.", "page_id": "1955771", "wikidata_id": "Q2961827", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La chaîne graphique couvre tout le processus de création jusqu'à l'impression, ce qui est fondamental pour un expert en techniques de production."}, {"concept": {"id": "f4e300f8-90ef-46ab-b74c-5d3a191244d3", "label": "Cohérence Visuelle", "definition": "La cohérence visuelle, ou cohérence graphique, se réfère à l'harmonie et à l'uniformité dans l'utilisation des éléments graphiques d'un produit ou d'une marque, incluant les couleurs, polices et mise en page. Cela assure une communication claire et attrayante dans le design graphique, renforce la reconnaissance de marque et améliore son image sur le marché.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13677, 13689], "aliases": ["3766aed4-6ea7-46eb-a36f-a0c8602e6ec3", "a49d7b36-95f3-42da-a0f3-354161f77ef3"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La cohérence visuelle est cruciale pour un expert en design afin d'assurer une communication efficace à travers les éléments graphiques produits."}, {"concept": {"id": "e9ad622e-d716-4ae9-92f9-ed85e8f3f1d5", "label": "Performance visuelle", "definition": "Capacité d'un design à être reconnaissable et mémorable, essentielle pour une identité visuelle efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La performance visuelle est essentielle pour garantir que les créations soient mémorables et efficaces, ce qui est crucial pour un expert en design et production."}, {"concept": {"id": "715d034c-24e5-4a0a-bf07-62f75ddec8a1", "label": "Production Print", "definition": "La production print désigne le processus de création et de finalisation des supports imprimés dans un projet, garantissant à la fois la qualité et la conformité avant l'impression. Cela inclut une variété de créations graphiques destinées à être imprimées, telles que des brochures, affiches et autres supports physiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13692], "aliases": ["b8af13c8-c164-4ec2-8f72-5e1fd8114715"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La production print est directement liée aux techniques de création et à la finalisation des supports imprimés, ce qui est très pertinent pour un expert en production."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le wireframing est une étape cruciale dans le processus de conception qui aide à visualiser l'interface avant sa réalisation finale, ce qui est très pertinent pour un expert en techniques de production."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La lisibilité est essentielle dans le design graphique, car elle influence directement la communication et l'engagement du public avec les créations visuelles."}, {"concept": {"id": "c125da14-d01f-43b2-a17e-e140031235d3", "label": "Identité Visuelle", "definition": "L'identité visuelle est l'ensemble des éléments graphiques, tels que le logo, les couleurs, la typographie et d'autres aspects visuels qui définissent et créent une image cohérente pour une marque ou un produit. Ces éléments visuels sont essentiels à l'identité de la marque, influençant son attrait esthétique et fonctionnel ainsi que sa reconnaissance par le public. Ils véhiculent les valeurs et l'activité de la marque à travers divers supports, contribuant ainsi à son image de marque globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13701, 13609, 13676, 13677, 13679, 13691, 13692, 13695], "aliases": ["6ed436f3-0444-4e49-8879-b222fdeac738", "6a0670cd-1dd2-4a61-93d8-e410f43ce503", "972f12c7-d7ea-43ec-b1c7-b445a3aab1df", "4e371124-894a-47c9-9640-29f8f38c7c6a", "76403c3e-6fe2-48a6-9441-ab306138df86", "0fdbfad3-557b-4b3b-a214-130350b568e8", "4488844b-4a4e-4edc-87c5-3eaec8bcb69b", "6a839e65-f2b2-4c9a-b6fb-14efbce4c820", "4d1f7d4c-9929-44ad-b198-91706dabb018", "b816dc26-a79e-40b6-bac1-d823158e6a13"], "wikientity": {"label": "Identité visuelle", "definition": "L'identité visuelle ou identité graphique est un ensemble d'éléments visuels cohérents qui permettent d'identifier une même entité au travers des différents médias de communication qu'elle émet. Elle exprime grâce à un style graphique propre à l'entreprise, les valeurs, l'activité et les ambitions de celle-ci et se traduit par des signes, des couleurs, des formes, des textes ainsi que des mises en forme. L'identité graphique se décline sur tout support : documents, tracts, enseigne matérielle, mais aussi sites web ou produits promotionnels.", "page_id": "1779853", "wikidata_id": "Q10299808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'identité visuelle joue un rôle clé dans le design et la création, influençant comment une marque est perçue visuellement par le public."}, {"concept": {"id": "86afe75f-ed88-4c2b-91c1-5b47f3b475a7", "label": "Indesign", "definition": "Logiciel de publication assistée par ordinateur développé par Adobe, utilisé pour créer des mises en page professionnelles et des documents imprimés et numériques avec une grande précision typographique, essentiel dans le domaine de la conception graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13683, 13699, 13687], "aliases": ["24d22b03-ec7f-4348-a668-462579dddad4", "9b2abbbc-0b27-4e92-a119-9551d7cb1a0e"], "wikientity": {"label": "Adobe InDesign", "definition": "Adobe InDesign est un logiciel de PAO produit par Adobe Systems. Initialement conçu pour créer des œuvres telles que des affiches, dépliants, brochures, magazines, journaux ou livres, il permet également de publier plusieurs types de contenus adaptés aux tablettes, lorsque utilisé avec Adobe DPS. Les principaux utilisateurs de ce logiciel sont les graphistes et les artistes professionnels qui créent et font la mise en page de périodiques, d'affiches et d'autres produits destinés à l'impression. Par ailleurs, il prend en charge l'exportation des formats des livres numériques EPUB et SWF, ainsi que d'autres formats numériques, tels que des magazines et divers produits adaptés à la consultation sur tablette tactile.", "page_id": "290860", "wikidata_id": "Q218924", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Indesign est un outil fondamental pour la mise en page professionnelle dans le domaine du design graphique, essentiel pour un expert en techniques de production."}, {"concept": {"id": "e4ae9c09-4ec8-4a59-9314-2e4c0c931e9b", "label": "Mise en page", "definition": "La mise en page (ou MEP) désigne le processus d'arrangement visuel des éléments graphiques et textuels sur une page, qu'elle soit imprimée ou numérique. Elle est essentielle pour l'expérience utilisateur sur un site web et dans d'autres supports visuels, car elle influence la lisibilité, l'esthétique, l'impact visuel et la clarté du message transmis ainsi que l'interaction avec le contenu. La MEP assure également une présentation cohérente et esthétique des documents.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13684, 13687, 13689], "aliases": ["2820af73-3b5d-4571-87ad-2c8b3b35023a", "d1811778-06d3-4715-acd2-6d6f55007f2b", "529c12dc-31c1-4106-b66d-787089356057", "1de5e449-7a2f-4249-a3c9-00fca42a6ccb"], "wikientity": {"label": "Mise en page", "definition": "La mise en page, ou mise en pages, est l'opération de disposition graphique d'un contenu informationnel dans un espace donné (feuille de papier, planche de bande dessinée, pages web, etc.).\nElle succède au travail de collecte et de composition du contenu (composition de texte « au kilomètre », collection des composants) et précède souvent le travail d'impression. Elle peut le précéder dans la mesure où elle est prédéfinie (dimensions des colonnes, styles du texte, placement des illustrations, etc.).", "page_id": "400658", "wikidata_id": "Q868954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La mise en page est essentielle dans le processus de création et design, influençant directement l'expérience utilisateur et la communication visuelle."}, {"concept": {"id": "34ff830b-c58c-4071-9527-82b9ed305fd2", "label": "Veille graphique", "definition": "La veille graphique est un processus de recherche et d'analyse des tendances visuelles et de design concurrentielles, ainsi qu'une pratique consistant à surveiller l'évolution visuelle d'une marque. Elle permet aux designers de rester informés et inspirés tout en maintenant une image cohérente, en adaptant les stratégies visuelles pour répondre aux attentes du marché et en identifiant des opportunités.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13701], "aliases": ["eecc48e0-db96-43fa-960f-dab3be2d674a", "28f8f3ed-2be4-41fe-af67-9c9bdb7616fe"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La veille graphique est essentielle pour un expert en techniques de production, car elle permet de rester à jour sur les tendances et d'adapter les designs en conséquence."}, {"concept": {"id": "9af3ae87-94f9-4cd7-8eb7-a8808838ccf2", "label": "Dossier d'Assemblage", "definition": "Collection organisée de fichiers sources et graphiques nécessaires à la production finale d'un projet, garantissant une présentation cohérente.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Dossier d'assemblage' assure que tous les éléments nécessaires à la production finale sont organisés, ce qui est vital pour un expert en techniques de production."}, {"concept": {"id": "011ab4c3-92f5-40a5-a6d5-5431e7ace7b6", "label": "Gabarits", "definition": "Modèles préconçus et graphiques utilisés pour créer des designs cohérents et efficaces dans le packaging ainsi que pour uniformiser la mise en page d'un document, facilitant l'identification et la répétition des éléments visuels sur plusieurs pages.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13692, 13687], "aliases": ["ef9a55eb-8d2f-4016-94d4-35c15a6e1160"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les gabarits sont importants pour assurer la cohérence et l'efficacité des designs, ce qui est crucial dans le domaine de la production graphique."}, {"concept": {"id": "296f12ab-03eb-495e-a89c-a642b60fb59f", "label": "Stylescape", "definition": "Un stylescape est un outil de conception visuelle élaboré qui représente l'identité d'une marque en regroupant typographie, couleurs, images et éléments graphiques. Il définit une direction esthétique et communique l'essence d'un projet ou d'une marque en illustrant une vision créative. Enrichissant la présentation des propositions, il transmet également l'identité ainsi que l'expérience globale souhaitées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679, 13691, 13701], "aliases": ["00177c06-47fd-4e59-aaf0-40bae219397f", "9b293c40-def0-4671-adf0-4548e76ec630", "3be7bd57-bfea-4bcb-8f2c-3043b5337341", "1adbfe40-1617-4b38-97bc-4d3517ae959b", "b1f8fe5b-f9f7-4dbb-8b77-60dfa36ab7c0"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un stylescape aide à définir l'identité visuelle d'une marque et communique des idées créatives, ce qui est pertinent pour un expert en création et design."}, {"concept": {"id": "d49ca571-1985-46c8-a1ee-1a21d7b40165", "label": "Finalisation", "definition": "Étape finale dans le processus de création où les détails sont peaufinés avant la livraison ou la mise en œuvre du produit final.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696], "aliases": ["3216d7fb-388c-4939-9510-87d2bb0f74db"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La finalisation est une étape cruciale dans le processus de création, permettant d'assurer que tous les détails sont soignés avant la livraison du produit final, ce qui est pertinent pour un expert en production."}, {"concept": {"id": "4ea86225-9e30-4861-95f0-0ae6616673ad", "label": "Bonnes pratiques UI", "definition": "Des recommandations pour optimiser l'utilisation des couleurs et autres éléments graphiques afin d'améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les bonnes pratiques UI sont essentielles pour optimiser l'expérience utilisateur, ce qui est directement lié aux compétences d'un expert en techniques de production."}, {"concept": {"id": "03321d7f-4bf6-4cea-a288-0db13fbe9a0f", "label": "Design concurrentiel", "definition": "Analyse du design utilisé par les concurrents afin d'informer et d'améliorer ses propres stratégies visuelles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le design concurrentiel est pertinent car il aide à informer et améliorer les stratégies de production visuelle, ce qui est essentiel pour un expert en création et design."}, {"concept": {"id": "65df11c1-b174-47e4-99dd-c0b910ecd165", "label": "Visuel", "definition": "Éléments graphiques ou images, tels que photos, illustrations ou infographies, qui représentent une idée ou un concept. Ils sont cruciaux pour la communication d'une marque ou d'un événement et servent à faciliter la compréhension et l'engagement du public en transmettant des idées ou émotions dans un projet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13698, 13691, 13697], "aliases": ["21e78266-d281-489a-9e46-c83396337523", "54f58e4b-d44d-4bd2-a60b-2758bed8492d"], "wikientity": null, "wordnetentity": {"label": "Visuel", "definition": "relating to or using sight", "name": "ocular.a.03", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Les éléments visuels sont cruciaux pour la communication dans tout projet de design, rendant ce concept très pertinent pour un expert en techniques de production."}, {"concept": {"id": "1622b043-0bc0-4650-8d08-21766878aae6", "label": "Projet", "definition": "Ensemble d'activités coordonnées visant à atteindre un objectif spécifique dans un délai défini, souvent utilisé dans le contexte professionnel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13696], "aliases": [], "wikientity": {"label": "Gestion de projet", "definition": "La gestion de projet, est l'ensemble des activités visant à organiser le bon déroulement d’un projet et à en atteindre les objectifs en temps et en heures selon les objectifs visés. Elle consiste à appliquer les méthodes, techniques, et outils de gestion spécifiques aux différentes étapes du projet, de l'évaluation de l'opportunité jusqu'à l'achèvement du projet.\nCette activité porte également le nom de conduite de projet, pilotage de projet, ingénierie de projet, ou encore management de projet.", "page_id": "27967", "wikidata_id": "Q179012", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Projet", "definition": "a series of steps to be carried out or goals to be accomplished", "name": "plan.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Le concept de projet est fondamental pour un expert en techniques de production, car il englobe la planification et l'exécution d'activités créatives."}, {"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les éléments graphiques sont fondamentaux pour toute création visuelle et leur utilisation efficace est cruciale dans les techniques de production."}, {"concept": {"id": "94ceb899-3421-42f7-a5b0-f97af5b3441a", "label": "UI KIT", "definition": "Un ensemble d'éléments graphiques standardisés pour assurer la cohérence visuelle d'un site web, facilitant l'évolution de l'identité visuelle existante.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un UI KIT est crucial pour assurer la cohérence visuelle dans le design, ce qui est fondamental pour un expert en création et design."}, {"concept": {"id": "e3db3cdb-5474-48f7-833c-0bdae33ed61a", "label": "Dossier d'Exécution", "definition": "Document technique détaillant les spécifications et les éléments nécessaires à la réalisation d'un projet, crucial pour assurer sa bonne mise en œuvre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": {"label": "Dossier des ouvrages exécutés", "definition": "Le dossier des ouvrages exécutés, ou DOE, est un document contractuel de la construction immobilière en France.", "page_id": "3606988", "wikidata_id": "Q3037354", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le dossier d'exécution est essentiel pour garantir que les spécifications du projet soient respectées, ce qui est crucial dans le domaine du design."}, {"concept": {"id": "0ef5f1c2-24c9-4318-b6c7-96d7d23396d4", "label": "Hiérarchisation des informations", "definition": "La hiérarchisation des informations est un processus stratégique d'organisation et de structuration des éléments visuels et des données sur une affiche, visant à optimiser la clarté, l'impact visuel et la compréhension pour le public.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": ["24340f97-ef74-4ff2-b4c0-46ec91fe3c1b"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Hiérarchisation des informations' est cruciale pour optimiser l'impact visuel et la compréhension, ce qui est très pertinent pour un expert en création et design."}, {"concept": {"id": "bd686e64-9f78-4a91-b448-bfb012e3f338", "label": "RVB", "definition": "Le modèle RVB (Rouge, Vert, Bleu) est un système de couleur numérique utilisé principalement pour les écrans et la conception graphique. Il repose sur l'addition des couleurs primaires rouge, vert et bleu pour créer une large gamme de couleurs. Ce modèle est largement utilisé dans les dispositifs numériques tels que les moniteurs et les téléviseurs, mais nécessite souvent une conversion pour être adapté à l'impression, où d'autres modèles colorimétriques comme CMJN sont préférés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13691], "aliases": ["57031841-9c44-45ef-9daa-bec903c2cebc", "71af99d6-2a52-42f3-acf0-0af7f6ecfd79"], "wikientity": {"label": "Rouge-vert-bleu", "definition": "Rouge-vert-bleu (RVB, ou RGB pour l'anglais red-green-blue) désigne un système de traitement optique, d'affichage électronique ou d'un codage de signal vidéo analogique, ou un codage informatique des couleurs. \nPour restituer la perception humaine colorée d'une image, différentes méthodes existent, en peinture, en imprimerie, en projection photographique, vidéo ou en affichage électronique et notamment, grâce au principe de la trichromie.\nCe principe est notamment exploité par un téléviseur, un écran vidéo ou d'ordinateur, lequel reproduit la couleur par synthèse additive, à partir des trois couleurs primaires : rouge, vert et bleu.", "page_id": "31353", "wikidata_id": "Q166194", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le modèle RVB est directement lié à la conception graphique et à la création visuelle, ce qui en fait un concept très pertinent pour un expert en techniques de production dans le domaine du design."}, {"concept": {"id": "ae467590-b74a-463a-8b8f-0d480a17c50a", "label": "Gestion de projet", "definition": "La gestion de projet est une discipline qui consiste à appliquer des connaissances, compétences et techniques pour planifier, exécuter et superviser des projets afin d'atteindre des objectifs spécifiques dans un cadre temporel défini. Elle implique l'organisation et la planification des ressources tout en respectant les contraintes budgétaires, et elle est particulièrement cruciale dans divers domaines, y compris le domaine créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13698, 13682, 13701], "aliases": ["232cece6-e141-4a95-9074-9c0f3fa70420", "4e6d523f-1898-42bd-8663-8d1982f44771", "14b98af1-6aaa-43a4-b8a5-8b6c40a54ef9"], "wikientity": {"label": "Gestion de projet", "definition": "La gestion de projet, est l'ensemble des activités visant à organiser le bon déroulement d’un projet et à en atteindre les objectifs en temps et en heures selon les objectifs visés. Elle consiste à appliquer les méthodes, techniques, et outils de gestion spécifiques aux différentes étapes du projet, de l'évaluation de l'opportunité jusqu'à l'achèvement du projet.\nCette activité porte également le nom de conduite de projet, pilotage de projet, ingénierie de projet, ou encore management de projet.", "page_id": "27967", "wikidata_id": "Q179012", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La gestion de projet est pertinente car elle permet d'organiser et de superviser les projets créatifs, bien qu'elle ne soit pas exclusivement liée aux techniques de production."}, {"concept": {"id": "a483e3d5-3d71-4891-9b1b-82594ebc0416", "label": "Performance écologique", "definition": "Dimension du design qui se concentre sur la minimisation de l'impact environnemental lors de la production et de l'utilisation des éléments graphiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La performance écologique devient de plus en plus importante dans le design moderne; bien qu'elle ne soit pas toujours centrale, elle reste pertinente pour les pratiques durables en production."}, {"concept": {"id": "fa82d3ad-4d6f-4e99-b33c-766d11cf2b7e", "label": "Skeuomorphisme", "definition": "Approche de design imitant les objets physiques réels pour faciliter l'interaction utilisateur par la familiarité visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": {"label": "Skeuomorphisme", "definition": "Le skeuomorphisme (en anglais skeuomorphism) ou skeuomorphe est un terme formé à partir du grec skeuos (l'équipement militaire, mais aussi le costume, l'ornement, la décoration) et définissant un élément de design dont la forme n'est pas directement liée à la fonction, mais qui reproduit de manière ornementale un élément qui était nécessaire dans l'objet d'origine. \nPlus précisément, il peut être défini comme « un élément de design ou une structure qui ne sert aucun but dans l'objet formé à partir du nouveau matériau, mais qui était essentiel dans l'objet fait à partir du matériau original ».\nLe terme n'est pas présent dans les dictionnaires de français (c'est un néologisme), mais il est notamment utilisé comme traduction du terme anglais pour désigner des éléments d'interface informatique reproduisant des objets physiques (par exemple des textures : cuir, papier, bois) dans le but de donner des repères facilement accessibles à l'utilisateur.", "page_id": "6452567", "wikidata_id": "Q607446", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le skeuomorphisme peut être une technique utile dans certaines créations graphiques, mais il n'est pas fondamentalement lié aux principes généraux du design moderne."}, {"concept": {"id": "1484d9ca-97e7-4cf4-8225-34669582bc2f", "label": "Neumorphisme", "definition": "Style de design qui utilise des ombres douces pour créer un effet de relief sur les éléments d'interface, donnant une apparence tactile.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": {"label": "Neumorphisme", "definition": "Le néomorphisme ou neumorphisme est un style de design d'interface graphique caractérisé par son souhait de donner un effet de relief. Ce style apparaît après le skeuomorphisme et le flat design dont il tente de faire la synthèse.", "page_id": "13648854", "wikidata_id": "Q102244095", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Neumorphisme' est une tendance actuelle dans le design d'interfaces qui pourrait intéresser un expert en techniques de production cherchant à rester à jour avec les styles modernes."}, {"concept": {"id": "ee30828b-7fba-4b6e-90a1-a6d3db62341e", "label": "Adaptation au format", "definition": "Ajustement des éléments graphiques pour assurer leur efficacité sur différents supports et formats.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'adaptation au format est importante pour garantir l'efficacité des éléments graphiques dans divers contextes, ce qui est crucial pour un expert en design."}, {"concept": {"id": "744dcb82-ca7e-480c-9ecc-b25dbb06ed5e", "label": "Rendu Noté", "definition": "Évaluation formelle d'un travail ou projet soumis, souvent accompagnée de commentaires sur sa qualité et son adéquation aux attentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le rendu noté est pertinent car il fait référence à l'évaluation des projets, ce qui est essentiel dans le cadre de la production et du design."}, {"concept": {"id": "4752ada0-b3bc-480a-b0d2-15bee717abf1", "label": "Améliorations de produit", "definition": "Modifications apportées à un produit existant pour mieux répondre aux besoins des clients ou se démarquer sur le marché.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les améliorations de produit sont cruciales pour répondre aux besoins des clients dans le cadre du design et de la production, rendant ce concept pertinent."}, {"concept": {"id": "b6158acc-bbe7-4543-abb4-78e2ee567274", "label": "Éco-logo", "definition": "Logo conçu pour consommer moins d'encre, caractérisé par un style épuré afin de réduire son impact écologique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'éco-logo reflète une tendance actuelle vers l'écologie dans le design, ce qui peut être pertinent pour un expert en création et design."}, {"concept": {"id": "b85e7360-65fa-46c8-ac7b-296a51bff297", "label": "Débords ou fonds perdus", "definition": "Extension des éléments graphiques au-delà des bords du document pour prévenir la coupe imprécise lors de l'impression.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Débords ou fonds perdus' sont importants pour éviter des erreurs lors de l'impression, ce qui a une pertinence modérée dans le cadre des techniques de production."}], "exercises": [{"exercise": {"id": "7a9bfae2718c4ec894908d42d69a0337", "question": "Quel est l'objectif principal d'un design system ?", "answers": ["Créer un système standardisé englobant tous les éléments graphiques et visuels"], "distractors": ["Faciliter uniquement la communication entre développeurs sans autres éléments.", "Améliorer la sécurité des données en développement produit.", "Se concentrer sur le développement du backend d'un produit.", "Optimiser exclusivement la performance technique des produits numériques.", "Gérer les bugs et correctifs de manière centralisée.", "Automatiser entièrement le processus de développement logiciel.", "Organiser tous les tests de performance pour un projet donné.", "Encourager l’utilisation des frameworks open-source dans le produit.", "Développer des environnements virtuels pour les phases de tests."], "feedback": "L'objectif principal d'un design system est de regrouper tous les éléments visuels et graphiques, ainsi que les règles, le branding et le ton dans un système standardisé pour faciliter le processus de développement et assurer cohérence et efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé abordé dans la référence, à savoir le design system. La question cible spécifiquement l'objectif principal de ce système, qui est essentiel pour un expert en techniques de production et en design. La réponse correcte met en avant l'importance de la standardisation des éléments graphiques, ce qui est fondamental dans le processus de création et de production graphique. Les distracteurs sont bien choisis car ils ne se rapportent pas au concept du design system, renforçant ainsi la pertinence de l'exercice. Cependant, une légère amélioration pourrait être apportée en ajoutant une question supplémentaire sur d'autres aspects des techniques de production pour couvrir un éventail plus large des compétences requises."}, {"exercise": {"id": "4c03f6a0173c41d68cc1d8eb88688d21", "question": "Qu'englobe généralement un design system dans le processus de création d'un produit ?", "answers": ["Les éléments graphiques, visuels, règles, ton, branding, etc"], "distractors": ["Les fonctionnalités techniques, algorithmes et optimisation de performances.", "Les vecteurs de sécurité et protocoles cryptographiques pour le produit.", "Le suivi exclusif des tests utilisateurs et retours clients.", "La gestion complète des bases de données et serveurs.", "Les diagrammes UML et documentation interne sur l’architecture produit.", "La conception des interfaces hardware et leurs connectiques.", "Les outils de déploiement cloud et gestion continue du produit.", "La rédaction de contrats juridiques et gestion de licences.", "L'analyse des statistiques de vente et tendances du marché."], "feedback": "Un design system englobe généralement tous les éléments liés à l'apparence et l'identité d'un produit, tels que les graphiques, les règles de style, le ton et le branding. Cela permet une création plus cohérente et efficace du produit, en assurant une identité visuelle unifiée et identifiable par les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice teste directement la compréhension d'un concept clé abordé dans la référence, à savoir le design system et son rôle dans le processus de création d'un produit. La question demande spécifiquement ce que comprend un design system, ce qui est en adéquation avec les informations fournies sur l'importance des éléments graphiques et visuels pour assurer une expérience utilisateur homogène. Les distracteurs sont bien choisis car ils ne concernent pas directement le design system, renforçant ainsi la pertinence de l'exercice. Cependant, une légère amélioration pourrait être apportée en demandant également comment ces éléments contribuent à l'expérience utilisateur ou à l'identité de marque, ce qui aurait pu justifier un score parfait."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension du concept de design system, qui est un aspect clé mentionné dans la référence. La question cible spécifiquement l'objectif de standardisation des éléments graphiques, ce qui est fondamental pour assurer une expérience utilisateur homogène. L'explication fournie renforce cette compréhension en précisant le rôle d'un design system dans la cohérence visuelle et l'expérience utilisateur. Bien que l'exercice soit très pertinent, il pourrait être légèrement amélioré en incluant des éléments supplémentaires sur les implications pratiques ou les bénéfices d'un design system au-delà de la simple standardisation."}, {"exercise": {"id": "f3dc4db503a64d7696628bc1bc7eeb26", "question": "Quels éléments sont inclus dans un design system ?", "answers": ["Les règles visuelles, graphiques, de branding et de ton"], "distractors": ["Uniquement des animations interactives de prototype", "Exclusivement des directives de sécurité informatique", "Des instructions relatives à l'expérience utilisateur", "Le suivi des communications internes à l'entreprise", "La gestion des équipes et des plannings", "Plans détaillés pour la stratégie publicitaire", "Une charte définissant les différents KPI", "Le modèle économique de l'entreprise", "La liste des formats de fichier utilisés"], "feedback": "Un design system regroupe tous les éléments nécessaires pour guider la création des produits et services d'une entreprise, tels que les règles visuelles, graphiques, de branding et de ton. Cela permet de maintenir une cohésion et une identité forte pour la marque.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé abordé dans la référence, à savoir le design system. En demandant quels éléments sont inclus dans un design system, l'exercice teste la connaissance des règles visuelles et graphiques qui sont essentielles pour maintenir une cohésion de marque, comme mentionné dans la synthèse. La réponse correcte est bien alignée avec les informations fournies sur l'importance du design system dans le processus de création graphique. Cependant, il aurait pu être encore plus pertinent en incluant des questions sur d'autres aspects techniques ou créatifs liés aux techniques de production, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "8f28a9f88d34427b97ac8306108b18b3", "statement": "Le but principal d'un design system est de standardiser les éléments liés au développement d'un produit pour garantir la cohérence.", "veracity": true, "feedback": "Le but d'un design system est effectivement de regrouper graphiques, règles, branding, ton, etc. en un seul système, assurant ainsi une cohérence dans le contact avec les différents acteurs participant au développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé abordé dans la référence, à savoir le design system et son rôle dans la standardisation des éléments graphiques pour garantir une expérience utilisateur cohérente. L'affirmation est correcte et l'explication fournie renforce cette compréhension en détaillant les composants d'un design system. Cependant, il aurait été bénéfique d'inclure des éléments supplémentaires sur l'importance de l'expérience utilisateur ou de la direction artistique pour obtenir un score parfait."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension du concept de wireframe, qui est un élément clé des techniques de production et du design web mentionnés dans la référence. La question cible spécifiquement l'objectif principal du wireframe, ce qui est pertinent pour tester la maîtrise des apprenants sur les méthodes de création et d'organisation des éléments graphiques avant le design final. L'explication fournie renforce cette pertinence en soulignant l'importance de cette étape dans le processus de conception. Cependant, une légère amélioration pourrait être apportée en intégrant davantage d'aspects liés à l'expérience utilisateur ou à la direction artistique, mais cela n'enlève pas à la qualité globale de l'exercice."}, {"exercise": {"id": "cfb5a24978ac4fb2bf3fa2db59ed0ebe", "question": "Quelle est l'utilité des wireframes dans le processus de création web?", "answers": ["Ils servent de base à la conception des maquettes web"], "distractors": ["Ils déterminent exclusivement les couleurs du site.", "Ils fournissent uniquement le texte du contenu.", "Ils remplacent les graphiques finaux sur le site.", "Ils sont créés en dernier après la conception graphique.", "Ils indiquent exactement où placer les images.", "Ils proposent les logos nécessaires pour le site web.", "Ils permettent d'ajuster uniquement la navigation visuelle.", "Ils représentent essentiellement l'esthétique finale du site.", "Ils s'occupent de la gestion du back-end du projet."], "feedback": "Les wireframes servent de base pour la conception des maquettes web en organisant les éléments et la navigation du site. Ils ne déterminent pas exclusivement l'esthétique finale du site, mais sont plutôt un guide pour respecter les fonctionnalités souhaitées par le client et le budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension de l'utilité des wireframes dans le processus de création web, un concept clé mentionné dans la référence. Les wireframes sont essentiels pour organiser les éléments fonctionnels d'une interface avant sa finalisation, ce qui est en ligne avec l'idée que chaque étape du processus de conception doit respecter les standards nécessaires. La question permet à l'apprenant de démontrer sa maîtrise des techniques de production et du design web, tout en distinguant les rôles spécifiques des wireframes par rapport à d'autres éléments graphiques. Cependant, une légère amélioration pourrait être apportée en intégrant davantage d'éléments sur la relation entre wireframes et expérience utilisateur (UX), ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "b17e37191d8e4ee096cbcba422cbd719", "question": "Quelle est la méthode qui découpe le design d'une interface en composants ?", "answers": ["L'atomic design"], "distractors": ["Le responsive design", "Le flat design", "Le skeuomorphisme", "Le material design", "Le wireframing", "Le design génératif", "Le minimalisme", "La méthode OOCSS", "Le visual design"], "feedback": "L'atomic design est une méthode de découpe du design d'une interface en plusieurs composants, permettant ainsi une meilleure organisation et une plus grande flexibilité dans la création de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la connaissance d'une méthode spécifique de design d'interface, l'atomic design, qui est pertinente dans le contexte des techniques de production et du design moderne. Bien que la question ne couvre pas tous les aspects mentionnés dans la synthèse, elle touche à un concept clé lié à l'organisation et à la création d'interfaces numériques. Cependant, une note de 8 est attribuée car l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur l'expérience utilisateur ou les normes prépresse pour une évaluation plus complète des compétences liées au sujet."}, {"exercise": {"id": "6e6772c68ba74d0f875c0cfbec11ddb3", "query": "Un design system regroupe tous les éléments graphiques ainsi que ceux liés aux règles <blank> dans un seul système standardisé.", "answers": ["de branding"], "distractors": [["de développement", "de codage", "de fonctionnalité", "de performance", "de navigation", "d'architecture"]], "feedback": "Le branding fait référence à l'identité visuelle et aux éléments qui définissent l'image d'une marque, donc il est directement lié aux aspects graphiques et de ton d'un produit. Un design system inclut cet aspect, afin de garder une cohérence visuelle et narrative dans tout le produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un concept clé lié au design system, qui est mentionné dans la référence. En demandant à l'apprenant de compléter une phrase sur les éléments graphiques et les règles de branding, il évalue leur capacité à relier le design system à l'identité visuelle d'une marque. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des aspects supplémentaires du design system ou en élargissant le contexte pour couvrir davantage de techniques de production mentionnées dans la synthèse."}, {"exercise": {"id": "1f6d780724244c4592b37c19e0fddc00", "query": "Un design system permet de rassembler tous les éléments graphiques, visuels, ainsi que ceux liés aux règles, de branding et <blank> dans un système unique et standardisé.", "answers": ["de ton"], "distractors": [["de développement", "de code", "d'infrastructure", "de structure", "d'interface", "de performance"]], "feedback": "La bonne réponse est 'ton' car, dans un design system, il s'agit d'un des aspects de la communication qui doit être cohérent avec les autres éléments visuels et graphiques pour garantir une expérience uniforme. Les autres propositions ne sont pas des éléments généralement liés à l'apparence ou à la communication dans le contexte d'un design system.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension d'un concept clé du design system, qui est essentiel dans le cadre des techniques de production et de création graphique. En demandant à l'apprenant de compléter une phrase sur les éléments d'un design system, il teste sa connaissance des aspects visuels et graphiques liés à la cohérence de la communication. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments techniques ou pratiques liés aux normes prépresse ou à l'expérience utilisateur pour couvrir plus largement les compétences mentionnées dans la référence."}, {"exercise": {"id": "c403d64ca6434b3dafa2d9505f75f7a4", "statement": "L'atomic design est une méthode qui consiste à diviser le design d'une interface en éléments individuels.", "veracity": true, "feedback": "L'atomic design vise à découper une interface en composants distincts, ce qui permet d'aborder le design de manière modulaire et réutilisable. Cette approche facilite la gestion et l'évolution des interfaces complexes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du design moderne, à savoir l'atomic design, qui est en lien avec les techniques de production et le design system mentionnés dans la référence. En effet, l'atomic design permet de structurer les éléments graphiques de manière modulaire, ce qui est essentiel pour respecter les normes prépresse et assurer une expérience utilisateur homogène. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects des techniques de production ou du processus créatif évoqués dans la synthèse. Il se concentre principalement sur un aspect spécifique du design sans aborder d'autres éléments cruciaux comme la direction artistique ou la communication visuelle. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "e11c2ad84ac74e07a8f72c3b516e8280", "statement": "Un design system ne concerne que les éléments graphiques d'un produit.", "veracity": false, "feedback": "Un design system englobe non seulement les éléments graphiques, mais aussi des aspects comme les règles, le branding et le ton, afin de créer un système standardisé réunissant tous les points de contact entre les acteurs du développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du chapitre, à savoir le design system, qui est mentionné dans la synthèse comme un aspect crucial du design moderne. L'affirmation testée permet de vérifier si l'apprenant comprend que le design system ne se limite pas aux éléments graphiques, mais inclut également des règles et des aspects de branding. Cependant, l'exercice pourrait être amélioré en demandant à l'apprenant d'expliquer plus en détail comment ces éléments interagissent au sein d'un design system, ce qui renforcerait encore davantage son évaluation."}, {"exercise": {"id": "388525c44d4749319aec5fc378adefa3", "statement": "Un design system se limite uniquement aux éléments graphiques et visuels d'un produit.", "veracity": false, "feedback": "Un design system ne se limite pas uniquement aux éléments graphiques et visuels. Il inclut également des règles, des éléments de branding, le ton, et d'autres points de contact relatifs au produit, afin de créer un système cohérent et standardisé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du design moderne, à savoir le design system, qui est mentionné dans la synthèse. L'affirmation proposée teste la connaissance de l'étendue et des fonctions d'un design system, ce qui est pertinent pour un expert en techniques de production. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en incluant des éléments supplémentaires liés aux autres concepts abordés dans la synthèse, comme l'expérience utilisateur ou les normes prépresse. Cela aurait permis une évaluation plus complète des compétences liées à la création et au design."}, {"exercise": {"id": "533c6a43d0bd4ceabcaebad8d3a979dc", "statement": "Le design system est appliqué sur plusieurs produits.", "veracity": true, "feedback": "Le design system est effectivement conçu pour être utilisé sur plusieurs produits, car il propose une bibliothèque de composants réutilisables pour garantir la cohérence entre ces différents produits.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du chapitre, à savoir le design system et son application sur plusieurs produits. La question de véracité permet de tester si l'apprenant a bien saisi l'importance de la standardisation des éléments graphiques pour assurer une expérience utilisateur homogène. Cependant, l'exercice pourrait être amélioré en incluant des questions supplémentaires qui explorent d'autres aspects des techniques de production ou du processus créatif, afin d'évaluer plus largement la maîtrise des compétences couvertes dans la référence."}, {"exercise": {"id": "e846ef0159d94e02a46b826e22c81e6b", "question": "Pour améliorer la compréhension d'une interface, que faut-il respecter principalement ?", "answers": ["La hiérarchie visuelle et l'ordre de lecture de l'utilisateur"], "distractors": ["Les polices de caractères artistiques et les animations interactives.", "Les couleurs de fond claires avec des éléments graphiques complexes.", "L'intégration de plusieurs menus déroulants imbriqués.", "L'affichage direct de plusieurs options techniques avancées.", "La quantité maximale d'informations sur une seule ligne.", "L'utilisation d'icônes réduites pour chaque section.", "Le positionnement aléatoire des boutons d'action.", "L'ajout de contenu vidéo en arrière-plan.", "La mise en place d'un menu global en bas de page."], "feedback": "Pour améliorer la compréhension d'une interface, il est important de respecter la hiérarchie entre les éléments visuels et de suivre l'ordre de lecture de l'utilisateur. Cela permet une meilleure compréhension de l'action à effectuer et facilite ainsi son utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à l'expérience utilisateur (UX), qui est mentionné dans la référence. La question porte sur l'importance de la hiérarchie visuelle et de l'ordre de lecture, des éléments essentiels pour créer une interface conviviale et esthétique. Bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant davantage d'aspects techniques ou créatifs liés aux normes prépresse ou à la direction artistique, afin de couvrir plus largement les compétences d'un expert en techniques de production."}, {"exercise": {"id": "f73b609c41224a5eb611f366c35d9a2a", "question": "Quel critère doit être respecté pour rendre une application intuitive ?", "answers": ["Son fonctionnement doit être familier aux utilisateurs"], "distractors": ["Elle doit offrir de nombreuses options uniques d'interface", "Elle doit suivre les dernières tendances du marché", "Elle doit être visuellement impressionnante", "Sa conception doit ignorer les habitudes des utilisateurs", "Elle doit inclure toutes les fonctionnalités demandées par les développeurs", "Elle doit intégrer au moins deux modes de navigation", "Son design doit être avant-gardiste et innovant", "Son utilisation doit être complexe mais enrichissante", "Elle doit simuler des défis d’apprentissage pour les utilisateurs"], "feedback": "Respecter les habitudes des utilisateurs permet de rendre l'application intuitive car les utilisateurs seront familiers avec son fonctionnement et pourront l'utiliser facilement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'expérience utilisateur (UX), qui est essentiel dans le contexte des techniques de production et du design. La question porte sur un critère fondamental pour rendre une application intuitive, ce qui est directement lié à l'objectif d'optimiser la satisfaction des utilisateurs par une interface conviviale. La réponse correcte souligne l'importance de respecter les habitudes des utilisateurs, ce qui est en adéquation avec les concepts abordés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments spécifiques aux techniques de production ou au design system pour atteindre une note parfaite."}, {"exercise": {"id": "4570d883513647c595941a5d33546fc8", "question": "Pourquoi est-il risqué de réinventer une icône connue par les utilisateurs ?", "answers": ["Cela peut désorienter l'utilisateur et nuire à son expérience"], "distractors": ["Cela permet d'améliorer l'expérience utilisateur immédiatement.", "Cela rend l'interface plus créative et intuitive.", "Cela aide l'utilisateur à mieux comprendre les nouvelles fonctionnalités.", "Cela garantit une meilleure interaction avec la technologie.", "Cela simplifie l'utilisation des options avancées pour les experts.", "Cela permet de se différencier de la concurrence.", "Cela assure une compatibilité optimale avec toutes les interfaces existantes.", "Cela accroît la flexibilité de conception dans les interfaces complexes.", "Cela améliore la lisibilité générale des informations présentées à l'écran."], "feedback": "Les icônes familières sont facilement reconnaissables par les utilisateurs et leur permettent de comprendre rapidement comment utiliser une fonctionnalité sans avoir à apprendre de nouvelles représentations visuelles. Modifier une icône peut donc désorienter l'utilisateur et nuire à son expérience.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des icônes familières dans le design d'interfaces, ce qui est pertinent pour les concepts de l'expérience utilisateur (UX) et de la communication visuelle abordés dans la référence. La question soulève un point crucial sur la reconnaissance des éléments graphiques et leur impact sur l'expérience utilisateur, ce qui est en ligne avec les objectifs d'apprentissage liés aux techniques de production et au design. Cependant, bien que cela touche à des aspects importants du design, l'exercice pourrait être amélioré en intégrant davantage d'éléments relatifs aux normes prépresse ou à la direction artistique, ce qui lui aurait permis d'obtenir une note plus élevée."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes de référence en matière de design et d'expérience utilisateur, qui sont des concepts clés abordés dans la synthèse. La question cible spécifiquement un aspect crucial pour maintenir une interface conviviale, ce qui est en ligne avec les objectifs d'apprentissage liés à l'expérience utilisateur (UX) et à la cohérence visuelle. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments techniques ou créatifs liés aux méthodes de production graphique mentionnées dans la référence."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé du design moderne, à savoir l'importance de l'expérience utilisateur (UX) dans la création de designs efficaces. Cette notion est bien intégrée dans la synthèse, qui souligne que l'expérience utilisateur et l'expérience client sont au cœur du développement produit. Cependant, bien que la question soit pertinente, elle pourrait être améliorée en incluant d'autres éléments techniques ou créatifs mentionnés dans la synthèse, comme les normes prépresse ou les modèles colorimétriques. Cela aurait permis une évaluation plus complète des compétences liées aux techniques de production et au design."}, {"exercise": {"id": "2f9b8c77092542f7b1b9ff425a63a1c1", "statement": "La hiérarchie entre les éléments d'une interface aide à mieux comprendre les actions à réaliser.", "veracity": true, "feedback": "Il est exact que la hiérarchie entre les différents éléments permet une meilleure compréhension des actions à entreprendre. Cette organisation guide l'utilisateur dans son parcours, rendant l'expérience plus fluide et intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la hiérarchie dans une interface, ce qui est un aspect clé du design web et de l'expérience utilisateur (UX) mentionné dans la synthèse. La question aborde directement comment cette hiérarchie contribue à une expérience utilisateur fluide et intuitive, ce qui est en ligne avec les objectifs d'apprentissage relatifs aux techniques de production et à la conception graphique. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments spécifiques sur les normes prépresse ou les spécificités des fichiers de fabrication, mais il reste très pertinent par rapport au sujet traité."}, {"exercise": {"id": "315cfc8b0c0a4c239408287509fd82a3", "statement": "L'ajout d'animations est utilisé uniquement pour rendre un site plus esthétique, sans impact sur l'expérience utilisateur.", "veracity": false, "feedback": "Bien que l'ajout d'animations puisse contribuer à l'esthétique d’un site Web, il ne se limite pas à cela. Les animations jouent également un rôle dans l'expérience utilisateur, en influençant potentiellement les émotions et les perceptions des utilisateurs dans les zones de conflit mentionnées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des animations dans le design web, ce qui est pertinent par rapport à la référence sur les techniques de production et le design. Il souligne que les animations ne servent pas uniquement un but esthétique, mais qu'elles influencent également l'expérience utilisateur, un concept clé dans la synthèse fournie. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'aspects techniques ou en demandant une analyse plus approfondie des implications des animations sur la communication visuelle et l'identité de marque."}, {"exercise": {"id": "5c99b0872ad447488fc21208ec035890", "statement": "La constance dans l'utilisation d'icônes universelles permet d'améliorer l'intuitivité d'une interface.", "veracity": true, "feedback": "L'emploi d'icônes avec une signification établie, connue des utilisateurs, permet de maintenir une interface intuitive. Cela évite de réinventer sans raison des éléments qui ont déjà fait leurs preuves dans la compréhension utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la cohérence visuelle et de l'expérience utilisateur, qui sont des concepts clés abordés dans la référence. En se concentrant sur l'utilisation d'icônes universelles pour améliorer l'intuitivité d'une interface, il touche directement à des aspects fondamentaux du design moderne et de la communication visuelle. Cependant, bien que pertinent, cet exercice pourrait être enrichi en intégrant davantage d'éléments techniques ou en explorant plus en profondeur les normes prépresse et les spécificités des fichiers de fabrication mentionnées dans la synthèse."}, {"exercise": {"id": "f7db6816b25d40e7b88284be2d31d0ac", "statement": "Les utilisateurs préfèrent des icônes nouvelles et originales plutôt que celles établies pour mieux comprendre leur fonction.", "veracity": false, "feedback": "Au contraire, il est mentionné que les icônes ayant une signification établie sont déjà connues des utilisateurs et qu'il est risqué d'en créer de nouvelles. Le changement pourrait rendre l'interface moins intuitive et désorienter les utilisateurs, ce qui est à éviter pour ne pas les faire fuir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de l'expérience utilisateur (UX) et de la communication visuelle, qui sont des éléments clés dans le domaine du design et des techniques de production. En demandant à l'apprenant d'évaluer la véracité d'une affirmation sur les icônes, il teste leur capacité à appliquer les concepts liés à l'intuitivité et à la reconnaissance visuelle, ce qui est essentiel pour un expert en création et design. Cependant, bien que pertinent, cet exercice pourrait être amélioré en incluant des questions plus variées sur d'autres aspects mentionnés dans la synthèse, comme le design system ou les modèles colorimétriques."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des normes de clarté et de cohérence dans le design d'interfaces, ce qui est un aspect clé du chapitre sur les techniques de production et le design. Bien que l'affirmation soit pertinente et que l'explication souligne des éléments cruciaux pour une bonne expérience utilisateur, il aurait été bénéfique d'inclure des références plus explicites aux concepts tels que le design system ou la direction artistique pour obtenir une note maximale. Néanmoins, cet exercice reste très pertinent par rapport à la référence."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le design, ce qui est un aspect clé mentionné dans la référence. L'affirmation souligne que le design doit inclure l'expérience utilisateur pour être efficace, ce qui est en accord avec les concepts abordés dans la synthèse concernant l'optimisation de la satisfaction par une interface conviviale et esthétique. Cependant, bien que pertinent, l'exercice pourrait être amélioré en demandant des exemples concrets ou des applications pratiques de cette intégration pour tester plus profondément la maîtrise du sujet."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du terme 'design' dans un contexte plus large que la simple création visuelle, ce qui est pertinent par rapport à la référence sur les techniques de production et le design. Il souligne l'importance de la conception en tant que processus d'organisation et de réflexion sur l'expérience utilisateur, ce qui est un aspect clé abordé dans la synthèse. Cependant, il aurait pu être encore plus efficace s'il avait inclus des éléments supplémentaires liés aux normes prépresse ou à d'autres aspects techniques mentionnés dans la synthèse."}, {"exercise": {"id": "fcf86d429da24f679769741afa7e8165", "question": "À quoi sert principalement le zoning dans le processus de création d'une page web ?", "answers": ["À schématiser la disposition du contenu et des fonctionnalités"], "distractors": ["À détailler le design final de la page", "À définir la palette de couleurs utilisée", "À créer une carte des utilisateurs", "À programmer les différentes fonctionnalités", "À choisir les outils graphiques à utiliser", "À écrire le contenu de la page", "À optimiser le SEO de la page web", "À définir les standards de performance", "À tester la compatibilité sur différents navigateurs"], "feedback": "Le zoning sert principalement à schématiser la disposition du contenu et des fonctionnalités sur une page web, en utilisant des blocs pour représenter les différents éléments. Il intervient généralement après la création de l'arborescence, qui définit l'organisation globale du site, et permet ainsi de valider ou ajuster les grandes lignes avant de passer aux étapes suivantes de conception.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du zoning dans le processus de création d'une page web, ce qui est pertinent par rapport à la référence sur les techniques de production et le design. Le zoning est un aspect clé de la conception web, qui fait partie des méthodes utilisées pour réaliser des créations graphiques tout en respectant les normes et spécificités nécessaires. La question teste directement la capacité de l'apprenant à identifier une technique essentielle dans le cadre du design UI/UX. Cependant, bien que cela soit pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés aux autres concepts mentionnés dans la synthèse, comme l'expérience utilisateur ou les modèles colorimétriques."}, {"exercise": {"id": "d98bc70a159f4f99ada0181438d991b5", "query": "Le wireframe se concentre principalement sur <blank>, sans s'occuper de l'aspect visuel ou du graphisme.", "answers": ["l'organisation des éléments et des formes"], "distractors": [["la création des images et vidéos finales", "la mise en forme graphique", "la palette de couleurs et typographie", "la réalisation des animations interactives", "l'optimisation des performances", "le développement du code fonctionnel"]], "feedback": "La bonne réponse est 'l'organisation des éléments et des formes' car le wireframe a pour but de déterminer la disposition structurelle des blocs comme les textes, images, ou vidéos, tout en ne tenant pas compte des détails graphiques qui seront travaillés ultérieurement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframe, qui est un élément clé dans le processus de conception graphique et web mentionné dans la référence. En se concentrant sur l'organisation des éléments sans tenir compte des aspects visuels, il teste la capacité de l'apprenant à distinguer entre les différentes étapes du design. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant d'autres concepts liés aux techniques de production ou au design system pour une évaluation plus complète des compétences couvertes par la référence."}, {"exercise": {"id": "da35feb49e864dec9be4a552fb20bd03", "query": "Les wireframes servent de base aux web designers pour <blank>, tout en respectant les souhaits et contraintes validés par le client.", "answers": ["la conception des maquettes"], "distractors": [["la gestion du budget", "le développement des fonctionnalités", "la maintenance du site", "la création du contenu", "l'organisation des réunions", "l'élaboration de scripts"]], "feedback": "Les wireframes sont des schémas représentant la structure d'une page web. Ils guident les web designers dans la phase créative appelée 'conception des maquettes', qui consiste à traduire ces schémas en une interface visuelle définitive. Les autres options, comme la maintenance du site ou la gestion du budget, relèvent de processus différents qui n’interviennent pas directement dans cette phase.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension des wireframes, qui sont un élément clé dans le processus de conception web mentionné dans la référence. En demandant à l'apprenant de compléter une phrase sur l'utilisation des wireframes, l'exercice teste sa capacité à relier cet outil aux étapes de création graphique et à la conception d'interfaces numériques. Cependant, bien que pertinent, il pourrait être amélioré en intégrant davantage d'éléments liés aux normes prépresse ou à l'expérience utilisateur, qui sont également des aspects importants du chapitre. Cela justifie une note légèrement inférieure au maximum."}, {"exercise": {"id": "a9e39306cb3b4f74b096fd9dd4b2697a", "statement": "Le wireframe consiste à définir l'organisation des éléments et des formes tout en travaillant l'aspect visuel.", "veracity": false, "feedback": "Le wireframe se concentre sur l'organisation des éléments comme les images, textes ou vidéos sans travailler l'aspect visuel. Le graphisme n'intervient qu'à une étape ultérieure du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframe, qui est un élément clé des techniques de production et de conception web mentionnées dans la référence. La question teste la capacité de l'apprenant à distinguer entre l'organisation fonctionnelle d'une interface (wireframe) et les aspects visuels qui interviennent plus tard dans le processus de design. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres concepts abordés dans la synthèse, comme l'importance du design system ou des modèles colorimétriques. Cela aurait permis une évaluation plus complète des compétences liées à la création et au design."}, {"exercise": {"id": "df6d8e1ef0c24891972ea92c71fd1f92", "statement": "Le contenu utilisé dans le wireframe peut être fictif si les informations finales ne sont pas encore disponibles.", "veracity": true, "feedback": "Il est mentionné que les informations finales ne sont pas toujours connues à ce stade du projet, donc un contenu fictif peut être utilisé pour organiser le wireframe.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception web, en particulier l'utilisation de wireframes. La référence aborde effectivement l'importance des outils comme le wireframing pour organiser les éléments fonctionnels d'une interface avant sa finalisation. L'affirmation testée est pertinente car elle souligne que le contenu dans un wireframe peut être fictif, ce qui est une pratique courante dans le processus de design. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en demandant à l'apprenant d'expliquer davantage pourquoi cette pratique est acceptable ou comment elle s'intègre dans le processus global de création graphique."}, {"exercise": {"id": "a286d7d9d1844bed865e42b39a918f65", "statement": "Les wireframes valides sont immuables et ne peuvent en aucun cas être modifiés par les créatifs.", "veracity": false, "feedback": "Bien que les wireframes valides constituent la base du travail, ils ne sont pas immuables. Les web designers peuvent ajuster l'organisation des éléments et le système de navigation, tant qu'ils respectent les fonctionnalités validées par le client et restent dans les limites du budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des wireframes, qui sont un outil essentiel dans le processus de conception web mentionné dans la synthèse. La question aborde la flexibilité des wireframes, ce qui est pertinent pour les techniques de production et le design UI/UX. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant d'autres aspects du design ou en demandant une application pratique des concepts abordés dans la synthèse."}, {"exercise": {"id": "71bf5ddcb822486fa3600aadc42c02eb", "question": "Quelle est une utilisation clé d'un Stylescape dans la communication avec un client ?", "answers": ["Donner une idée claire de l'apparence du projet final"], "distractors": ["Vérifier la compatibilité des logiciels utilisés.", "Comparer différents prototypes techniques.", "Organiser des réunions internes régulières.", "Expliquer le concept stratégique derrière la campagne.", "Approuver le budget global du projet.", "Finaliser les aspects techniques du projet.", "Analyser les retours utilisateurs post-lancement.", "Optimiser les aspects fonctionnels et ergonomiques.", "Résoudre les problèmes logistiques du projet."], "feedback": "L'une des utilisation clé d'un Stylescape dans la communication avec un client est de leur donner une idée claire de l'apparence du projet final, afin qu'ils puissent se projeter et comprendre le résultat attendu. Les autres propositions ne sont pas correctes car elles ne sont pas directement liées à la communication avec le client ou ne font pas référence à l'apparence du projet final.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un outil spécifique (Stylescape) qui est pertinent dans le cadre de la communication visuelle et du design, deux concepts clés abordés dans la référence. En demandant à l'apprenant d'identifier une utilisation clé d'un Stylescape, l'exercice teste sa capacité à relier des outils pratiques aux objectifs de création et de présentation visuelle. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments directement liés aux normes prépresse ou aux spécificités techniques mentionnées dans la synthèse. Néanmoins, il reste très en lien avec les compétences attendues pour un expert en techniques de production."}, {"exercise": {"id": "7d7015341c634c6eaa4de6df8fa72e34", "question": "Quel est le rôle principal d'un Stylescape dans un projet de design ?", "answers": ["Communiquer l'émotion et l'ambiance souhaitées"], "distractors": ["Définir la palette de couleurs finale.", "Décrire les aspects techniques du projet.", "Contrôler la progression du planning.", "Valider les choix esthétiques avec l'équipe interne.", "Analyser les performances du produit fini.", "Estimer les coûts de production.", "Gérer la relation entre les parties prenantes.", "Superviser les processus créatifs en cours.", "Prévoir les ajustements graphiques post-lancement."], "feedback": "Le rôle principal d'un Stylescape est de communiquer l'émotion et l'ambiance souhaitées pour un projet de design, en donnant une vision claire à toutes les parties prenantes. Les autres propositions ne sont pas pertinentes car elles ne reflètent pas le but premier d'un Stylescape.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du design, à savoir le Stylescape, qui est pertinent dans le cadre des techniques de production et de création graphique. En demandant quel est le rôle principal d'un Stylescape, l'exercice teste la capacité de l'apprenant à relier les aspects émotionnels et esthétiques du design à la communication visuelle. Cependant, bien que cela soit en lien avec les objectifs d'apprentissage mentionnés dans la référence, il aurait pu être encore plus pertinent s'il avait inclus des éléments spécifiques sur les normes prépresse ou les spécificités des fichiers de fabrication. Néanmoins, il reste un bon indicateur de compréhension des concepts abordés."}, {"exercise": {"id": "51bb9f92637a43a88c83356b9f8ce577", "question": "Quelle est la principale fonction d'un moodboard dans un projet créatif ?", "answers": ["Rassembler des inspirations visuelles pour refléter une ambiance générale"], "distractors": ["Définir précisément l'identité visuelle d'une marque.", "Créer un plan détaillé du projet.", "Organiser les étapes de production du design.", "Déterminer le budget du projet.", "Générer des concepts uniques sans engagement.", "Orienter les équipes vers des objectifs commerciaux.", "Établir un rapport technique précis.", "Réaliser une maquette fonctionnelle du site web.", "Valider une campagne marketing globale."], "feedback": "Le moodboard est utilisé pour rassembler et présenter visuellement des inspirations, des éléments graphiques et des textures afin de refléter l'ambiance et l'esthétique générale d'un projet créatif. Il sert donc à créer une vision globale du design et à communiquer des idées visuelles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bd42cab0c42544a2b7e4b57dd58c7556", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le Stylescape et le moodboard sont deux approches différentes utilisées dans le processus créatif pour visualiser et communiquer des idées de design. Le moodboard est principalement utilisé pour rassembler et présenter une collection d'inspirations visuelles, d'éléments graphiques, de textures, de couleurs, etc. C'est une représentation visuelle de l'ambiance et de l'esthétique générale d'un projet. Le Stylescape, quant à lui, va au-delà de la simple collection d'éléments visuels en cherchant à créer une composition visuelle qui représente l'identité, l'atmosphère et l'expérience globale d'un projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "a425d9d448e14f39b2bf4a181b709422", "prev_id": "4c6943198f4f442e8c6e608955fd85f1", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du processus créatif, à savoir le moodboard, qui est essentiel dans la phase de conception graphique. Bien que le moodboard ne soit pas explicitement mentionné dans la synthèse, son rôle en tant qu'outil de rassemblement d'inspirations visuelles s'inscrit parfaitement dans le cadre des techniques de production et de création abordées. Cela dit, l'exercice aurait pu être encore plus pertinent s'il avait directement lié le moodboard aux aspects tels que l'identité visuelle ou l'expérience utilisateur, qui sont également des éléments centraux de la référence. Néanmoins, il teste efficacement une compétence importante pour un expert en techniques de production."}, {"exercise": {"id": "ce9ed20a961d4927b885265d6bbe3230", "statement": "Un Stylescape aide à définir les objectifs financiers d'un projet de design.", "veracity": false, "feedback": "Le but principal d'un Stylescape est plutôt de saisir l'émotion et l'ambiance voulues pour un projet, pas de définir des objectifs financiers. Il s'agit d'un outil visuel de communication pour clarifier l'apparence et la sensation du projet plutôt que d'aspects économiques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la création et au design, en particulier l'utilisation d'un Stylescape dans le processus de design. Bien que l'affirmation porte sur un aspect spécifique du design, elle touche à des éléments importants tels que la communication visuelle et l'identité de marque, qui sont mentionnés dans la synthèse. L'explication fournie clarifie bien le rôle du Stylescape, ce qui montre une bonne maîtrise des concepts abordés. Cependant, il aurait été encore plus pertinent si l'exercice avait inclus des éléments directement liés aux techniques de production ou aux normes prépresse évoquées dans la référence."}, {"exercise": {"id": "322b8638f3c442ea8d32036412098ef3", "question": "Quel pourcentage maximal la somme des couleurs CMJN ne doit-elle pas dépasser pour éco-responsabilité ?", "answers": ["100 %"], "distractors": ["300 %", "500 %", "400 %", "600 %", "200 %", "900 %", "1 000 %", "700 %", "800 %"], "feedback": "La bonne réponse est 100% car c'est le pourcentage maximal que la somme des quatre couleurs CMJN ne doit pas dépasser pour être éco-responsable. Tout autre pourcentage serait considéré comme trop élevé et donc moins respectueux de l'environnement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "ab2c4333a8404e26b67ae0bfb901976a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La couleur peut avoir un impact éco-responsable en fonction des choix faits par la marque. Concrètement, il faut privilégier l'utilisation des couleurs CMJN tirées de la quadrichromie. Pour une éco-couleur, la somme de ces quatre couleurs ne doit pas dépasser les 100 %. Un guide des éco-couleurs est également disponible en open-source et propose plus de 150 références éco-responsables.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "06986d2b380844d089f754c1032d026b", "next_id": "a1f3d6ca175e46638cf8a1809f3f18d9", "prev_id": "8bec189d22504431a86e99e0fdbd320e", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13689, "doc_label": "Sequence 4_Mettre en page une affiche", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect technique essentiel des techniques de production, en particulier concernant les modèles colorimétriques CMJN. La question sur le pourcentage maximal que la somme des couleurs CMJN ne doit pas dépasser est pertinente car elle touche à la fois aux normes prépresse et à l'éco-responsabilité, qui sont des éléments clés dans le processus de création graphique. Cependant, bien que cela soit un point important, l'exercice pourrait être amélioré en incluant une dimension plus large sur l'application pratique de ces connaissances dans un contexte de design ou de production. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "76a646eaf2e1491c9788c80fb8dfdb7a", "statement": "L'utilisation de couleurs CMJN pour une éco-couleur doit respecter une somme maximale de 100 % entre les quatre couleurs.", "veracity": true, "feedback": "En effet, dans le cadre d’une approche éco-responsable, il est recommandé que la somme des pourcentages des quatre couleurs CMJN ne dépasse pas 100 %, afin de réduire l'impact environnemental de l'impression.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "ab2c4333a8404e26b67ae0bfb901976a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La couleur peut avoir un impact éco-responsable en fonction des choix faits par la marque. Concrètement, il faut privilégier l'utilisation des couleurs CMJN tirées de la quadrichromie. Pour une éco-couleur, la somme de ces quatre couleurs ne doit pas dépasser les 100 %. Un guide des éco-couleurs est également disponible en open-source et propose plus de 150 références éco-responsables.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "06986d2b380844d089f754c1032d026b", "next_id": "a1f3d6ca175e46638cf8a1809f3f18d9", "prev_id": "8bec189d22504431a86e99e0fdbd320e", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13689, "doc_label": "Sequence 4_Mettre en page une affiche", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des modèles colorimétriques CMJN, qui est un concept clé mentionné dans la référence. En posant une question sur l'utilisation des couleurs CMJN et leur impact environnemental, il teste non seulement la connaissance technique mais aussi la prise en compte des enjeux contemporains liés à l'éco-responsabilité dans le design. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant d'autres aspects du design et de la production graphique pour obtenir une évaluation plus complète des compétences liées à l'expertise en techniques de production."}, {"exercise": {"id": "d4e9ab91b0d543e59d4284af6b4ebc5f", "question": "Pourquoi la taille de l'écran mobile peut poser problème lors de la conception ?", "answers": ["La taille restreinte complique la créativité et le webdesign"], "distractors": ["Les smartphones n'ont pas assez de performances pour un bon design.", "Les sites mobiles ne peuvent pas contenir de contenu multimédia.", "La navigation mobile impose toujours deux mains pour interagir.", "L'amélioration des visuels pour mobile est plus simple qu'avec un ordinateur.", "La taille d’écran mobile améliore toujours l'expérience utilisateur.", "Les écrans de téléphone n'affichent pas les images en haute qualité.", "Le responsive design supprime tout besoin de réflexion créative.", "Les couleurs doivent changer entre les versions mobile et desktop.", "Toutes les interfaces mobiles doivent être monochromes pour optimiser le design."], "feedback": "La taille de l'écran d'un terminal mobile peut poser problème pour les créateurs de sites web, car cela limite leur capacité à être créatif et à concevoir des designs complexes et esthétiques. La limitation de l'espace sur un petit écran peut également poser des problèmes pour l'optimisation de la navigation et de l'expérience utilisateur globale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect pertinent de la conception web, en se concentrant sur les défis posés par la taille des écrans mobiles. Cela est directement lié aux techniques de production et à l'expérience utilisateur, qui sont des éléments clés de la référence. Cependant, bien que la question soit pertinente, elle ne couvre pas entièrement d'autres concepts importants mentionnés dans la synthèse, tels que le design system ou les normes prépresse. De plus, l'explication fournie pourrait être plus détaillée pour mieux relier les problèmes de taille d'écran aux normes graphiques et à l'identité visuelle. Ainsi, bien qu'il soit pertinent, il manque une profondeur qui aurait pu justifier une note plus élevée."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du design moderne, ce qui est un aspect clé de la référence. En demandant aux apprenants d'identifier les conséquences d'une mauvaise adaptation du contenu aux appareils mobiles, il teste leur capacité à relier les concepts techniques et esthétiques à l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus variés sur les techniques de production ou le design system pour couvrir davantage de concepts mentionnés dans la synthèse."}, {"exercise": {"id": "a7a4e17d20c843f0bc5686d8e5efabf2", "statement": "La taille réduite de l'écran sur un terminal mobile peut poser des défis en termes de créativité et de conception web.", "veracity": true, "feedback": "Effectivement, la taille réduite de l'écran sur un appareil mobile rend la conception plus difficile en raison de contraintes créatives et en termes de webdesign, comparativement à des écrans plus grands.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect pertinent de la conception web, en soulignant les défis liés à la taille réduite des écrans mobiles. Cela fait écho aux concepts de design UI et d'expérience utilisateur mentionnés dans la synthèse. Cependant, bien que l'affirmation soit correcte et pertinente, l'exercice ne couvre pas directement d'autres éléments clés tels que les normes prépresse, les modèles colorimétriques ou le design system. Il aurait pu être amélioré en intégrant des questions sur ces autres aspects techniques ou créatifs pour une évaluation plus complète des compétences liées à la référence."}, {"exercise": {"id": "5e5e624e0c9749189df302e3a469edd0", "statement": "Une application intuitive fonctionne de manière proche des habitudes déjà acquises par les utilisateurs.", "veracity": true, "feedback": "L'énoncé est correct car il est recommandé de concevoir une application qui se rapproche du mode de fonctionnement auquel les utilisateurs sont déjà habitués, pour éviter des difficultés inutiles dans l'utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'expérience utilisateur (UX), qui est un aspect clé mentionné dans la référence. En effet, concevoir une application intuitive en tenant compte des habitudes des utilisateurs est essentiel pour optimiser leur satisfaction. Cependant, l'exercice ne couvre pas d'autres concepts importants tels que les techniques de production, le design system ou la direction artistique, ce qui limite sa portée. Il reste pertinent mais pourrait être amélioré en intégrant davantage d'éléments liés à la création et au design."}, {"exercise": {"id": "21e7e2693b444fba8f147080ae5c1e65", "question": "Que permet d'établir l'ajout d'une baseline à une marque ?", "answers": ["Une identité visuelle homogène pour toutes les parties prenantes"], "distractors": ["Un plan marketing spécifique pour les clients réguliers", "Une stratégie de référencement optimisée sur les moteurs de recherche", "Une différenciation uniquement auprès des fournisseurs locaux", "Un nouveau segment de marché pour les produits innovants", "Des innovations produit adaptées aux besoins spécifiques des consommateurs", "Une politique tarifaire compétitive en fonction des régions", "Un engagement fort envers la durabilité et l'écologie", "Une meilleure portée publicitaire pour les marchés internationaux", "Une segmentation accrue au sein du marché local"], "feedback": "L'ajout d'une baseline à une marque permet de renforcer son identité visuelle et de la rendre plus cohérente pour toutes les parties prenantes. Cela peut également aider à différencier la marque des autres sur le marché.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a14a2eeb39634a12bf5d599f9a24c789", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Afin d'asseoir son positionnement et de renforcer son nom de marque, il peut être complété par une baseline, aussi appelé slogan ou punchline. Sa mise en place garantie une identité visuelle homogène que pourront s'approprier les collaborateurs, les clients et toutes les parties prenantes (fournisseurs, partenaires, ... ).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "0202c10711334a238a7d1c828b2522cc", "next_id": "669f1e772dbe48bebb0245be17e5450f", "prev_id": "40a5031d6bf14574bb98fdc0bf308e61", "associated_block_ids": [], "first_page": 12, "last_page": 18, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance d'une baseline dans le cadre de l'identité visuelle d'une marque, ce qui est pertinent par rapport à la référence sur les techniques de production et le design. Bien que cela touche à un aspect clé du design moderne, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés aux techniques de production ou aux normes prépresse mentionnées dans la synthèse. Néanmoins, il teste une compétence importante liée à la création graphique et à la cohérence visuelle, justifiant ainsi une note relativement élevée."}, {"exercise": {"id": "9ffa467f37084a368ad722d16d9aebc8", "query": "Le zoning permet de définir l'organisation générale des pages après la création de <blank>.", "answers": ["l'arborescence"], "distractors": [["les wireframes", "la charte graphique", "le prototype", "les maquettes", "l'interface", "le contenu"]], "feedback": "La bonne réponse est 'l'arborescence', car le zoning intervient généralement après que l'arborescence a été créée. L'arborescence correspond à la structure hiérarchique du site, tandis que le zoning s'intéresse à la répartition des blocs de contenu sur les pages. Les autres réponses sont incorrectes car elles concernent des étapes ou éléments distincts dans le processus de conception web (wireframes, maquettes, etc.).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à l'organisation des pages dans le cadre de la conception web, ce qui est pertinent par rapport à la référence sur les techniques de production et le design. Le zoning et l'arborescence sont effectivement des éléments importants dans le processus de création graphique et d'interface utilisateur. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant davantage d'aspects liés aux normes prépresse ou à l'expérience utilisateur, qui sont également mentionnés dans la synthèse. Cela limite légèrement sa portée par rapport à l'ensemble des compétences couvertes dans la référence."}, {"exercise": {"id": "52606c0f2a784a0f8bab387798a3f493", "query": "Le Stylescape permet de communiquer efficacement avec les clients en leur donnant une idée claire de <blank> du projet final.", "answers": ["l'apparence et de la sensation"], "distractors": [["la rentabilité et de l'ergonomie", "le public cible et des délais", "les étapes de production et de l'esthétique", "les contraintes techniques et de l'interface", "la palette de couleurs et des typographies", "les technologies utilisées et des coûts"]], "feedback": "Le Stylescape communique aux clients une vision globale du projet, notamment en ce qui concerne 'l'apparence et la sensation', car cela reflète l'émotion et l'ambiance que le projet de design doit transmettre. Les autres options ne mentionnent pas directement cet aspect visuel et émotionnel clé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à la communication visuelle dans le design, en se concentrant sur l'importance de l'apparence et de la sensation dans un projet. Cela est pertinent par rapport à la référence qui aborde les techniques de production et le design, notamment en ce qui concerne l'identité visuelle et l'expérience utilisateur. Cependant, il pourrait être amélioré en intégrant des éléments plus directement liés aux normes prépresse ou aux spécificités techniques mentionnées dans la synthèse."}, {"exercise": {"id": "2349bacb97bc4da3949e7b6d5400581d", "question": "En quoi le Stylescape diffère-t-il du moodboard ?", "answers": ["Il crée une composition visuelle représentant l'identité et l'expérience globale"], "distractors": ["Il se base uniquement sur des éléments graphiques fixes.", "Il ne présente que les textures utilisées dans le design.", "Il se concentre principalement sur les couleurs et les formes abstraites.", "Il organise les informations marketing d'une entreprise.", "Il est utilisé exclusivement pour définir le logo d'une marque.", "Il compile uniquement des polices de caractères et des icônes.", "Il regroupe divers médias audiovisuels pour créer un storyboard.", "Il permet d'élaborer une stratégie publicitaire complète.", "Il est utilisé pour tester une stratégie de prototypage produit."], "feedback": "Le Stylescape va au-delà de la simple collection d'éléments visuels en cherchant à créer une composition visuelle représentant l'identité, l'atmosphère et l'expérience globale d'un projet. Il permet ainsi de réfléchir à l'ensemble des éléments qui doivent être pris en compte dans le design, tels que l'identité de la marque, l'expérience utilisateur, etc.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bd42cab0c42544a2b7e4b57dd58c7556", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le Stylescape et le moodboard sont deux approches différentes utilisées dans le processus créatif pour visualiser et communiquer des idées de design. Le moodboard est principalement utilisé pour rassembler et présenter une collection d'inspirations visuelles, d'éléments graphiques, de textures, de couleurs, etc. C'est une représentation visuelle de l'ambiance et de l'esthétique générale d'un projet. Le Stylescape, quant à lui, va au-delà de la simple collection d'éléments visuels en cherchant à créer une composition visuelle qui représente l'identité, l'atmosphère et l'expérience globale d'un projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "a425d9d448e14f39b2bf4a181b709422", "prev_id": "4c6943198f4f442e8c6e608955fd85f1", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice pose une question pertinente sur la différence entre un Stylescape et un moodboard, ce qui touche à des concepts clés de la création graphique et du design. Bien que cela ne couvre pas directement toutes les techniques de production mentionnées dans la référence, il aborde des éléments importants liés à l'identité visuelle et à l'expérience utilisateur, qui sont essentiels dans le processus de design. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'aspects techniques ou normatifs liés aux méthodes de production pour obtenir une note plus élevée."}, {"exercise": {"id": "88e44b4f400e48ee8326db42c0d194ac", "query": "Pour être considérée comme éco-responsable, la somme des couleurs CMJN utilisées ne doit pas dépasser <blank>.", "answers": ["100 %"], "distractors": [["50 %", "200 %", "75 %", "150 %", "125 %", "90 %"]], "feedback": "La limite de 100 % pour les couleurs CMJN est essentielle pour garantir une moindre consommation d'encre et réduire l'impact environnemental. Cela permet de limiter les impressions excessives et de rester cohérent avec une approche éco-responsable.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "ab2c4333a8404e26b67ae0bfb901976a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La couleur peut avoir un impact éco-responsable en fonction des choix faits par la marque. Concrètement, il faut privilégier l'utilisation des couleurs CMJN tirées de la quadrichromie. Pour une éco-couleur, la somme de ces quatre couleurs ne doit pas dépasser les 100 %. Un guide des éco-couleurs est également disponible en open-source et propose plus de 150 références éco-responsables.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "06986d2b380844d089f754c1032d026b", "next_id": "a1f3d6ca175e46638cf8a1809f3f18d9", "prev_id": "8bec189d22504431a86e99e0fdbd320e", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13689, "doc_label": "Sequence 4_Mettre en page une affiche", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la connaissance des modèles colorimétriques CMJN, qui est un concept clé dans la référence concernant les techniques de production et la création graphique. La question sur la limite de 100 % pour les couleurs CMJN est pertinente car elle touche à l'importance de respecter les normes techniques pour une production efficace et éco-responsable. Cependant, l'exercice se concentre uniquement sur un aspect technique spécifique sans aborder d'autres éléments importants comme le design system ou l'expérience utilisateur, ce qui limite sa portée. C'est pourquoi il obtient une note de 7."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception, à savoir l'expérience utilisateur (UX), qui est mentionnée dans la référence. Cependant, il se concentre spécifiquement sur les référentiels ergonomiques et l'étude des usagers, ce qui n'est qu'une partie des techniques de production et du design abordés dans la synthèse. Bien que pertinent, l'exercice ne couvre pas directement d'autres concepts clés tels que le design system ou les normes prépresse, ce qui limite sa portée par rapport à l'ensemble des compétences attendues d'un expert en techniques de production."}, {"exercise": {"id": "4cc91b3570c44bd6b1da6c8f3f90d7d2", "question": "Que désigne le terme espace blanc en conception d'interface ?", "answers": ["Le vide autour ou à l'intérieur des éléments de la conception"], "distractors": ["La couleur utilisée pour les polices de texte", "Les bordures des fenêtres de dialogue", "La taille prédéfinie des sections", "Un affichage en mode plein écran", "Le contraste entre différents blocs", "La distance entre deux images", "La zone dédiée aux animations", "Un type spécifique de cadre dans l'interface", "La forme générale de l'interface"], "feedback": "L'espace blanc, également appelé espace négatif, désigne les vides autour ou à l'intérieur des éléments de la conception. Cet espace peut être utilisé de manière stratégique pour améliorer la lisibilité et la mise en valeur des différents éléments de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur le concept d'espace blanc en conception d'interface, qui est un aspect pertinent du design moderne et de la création graphique. Bien que cela touche à des éléments de l'expérience utilisateur (UX) et à la communication visuelle, il ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. L'exercice évalue une compréhension spécifique d'un élément de design, mais il aurait pu être plus lié aux processus globaux de production ou aux standards techniques évoqués dans la synthèse. Ainsi, bien qu'il soit pertinent, il n'évalue pas pleinement les compétences clés attendues pour un expert en techniques de production."}, {"exercise": {"id": "8a0090c63f2543fb9a56f60fd2dc163c", "question": "Comment est défini le terme design dans ce contexte spécifique ?", "answers": ["Il est synonyme de « conception »"], "distractors": ["Il se réfère aux illustrations", "Il s'agit de broderie numérique", "Il désigne des algorithmes", "Il décrit uniquement l'UX", "Il parle de graphisme pur", "Design signifie codage", "Il devient un synonyme de créativité", "Il est lié au marketing", "Il correspond à une interface"], "feedback": "Le terme design est souvent associé à la création visuelle, mais dans ce cas précis, il est utilisé comme synonyme de conception. Il s'agit donc d'une approche qui va au-delà de l'esthétique et qui inclut également la planification et la conception d'une expérience utilisateur optimale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du terme 'design' dans le contexte des techniques de production et de création. Bien que la réponse correcte soit pertinente, l'exercice ne couvre pas suffisamment les autres aspects clés mentionnés dans la référence, tels que les normes prépresse, l'expérience utilisateur ou les méthodes de production. Il se concentre uniquement sur une définition du design sans explorer son rôle plus large dans le processus créatif et technique. Cela limite sa capacité à évaluer pleinement la maîtrise des concepts abordés dans la synthèse."}, {"exercise": {"id": "870f44252b3f466d91e4ffa414b5cdbe", "query": "La hiérarchie des éléments d'une interface guide l'utilisateur dans sa navigation. Il commence par lire le contenu, puis, s'il le juge nécessaire, effectue une action pour laquelle il devra trouver <blank>.", "answers": ["un call to action"], "distractors": [["un formulaire de contact", "une barre de recherche", "un menu déroulant", "une notification", "un footer", "une suggestion d'article"]], "feedback": "Le 'call to action' est une incitation à accomplir une action particulière, par exemple cliquer sur un bouton ou remplir un formulaire. C'est l'élément que l'utilisateur doit trouver après avoir parcouru le contenu, lorsqu'il décide d'interagir avec l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de la hiérarchie des éléments d'une interface, ce qui est pertinent pour le design UI et l'expérience utilisateur (UX) mentionnés dans la référence. Cependant, il se concentre uniquement sur un aspect spécifique (le 'call to action') sans aborder d'autres concepts clés tels que les normes prépresse, les modèles colorimétriques ou la direction artistique. Bien qu'il soit utile pour évaluer une partie de l'apprentissage lié à l'interface utilisateur, il ne couvre pas suffisamment les autres dimensions essentielles du chapitre sur les techniques de production et le design."}, {"exercise": {"id": "48ef62b02b0148eeb79dd1d5e0017254", "query": "L'atomic design est une méthode qui consiste à <blank> en différents composants le design d'une interface.", "answers": ["découper"], "distractors": [["assembler", "simplifier", "fusionner", "compliquer", "agrandir", "réarranger"]], "feedback": "La bonne réponse est 'découper', car l'atomic design fait référence à la décomposition de l'interface en éléments plus petits et réutilisables, permettant ainsi une conception modulaire. Les autres propositions ne correspondent pas à cette idée de fragmentation en composants plus petits.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept spécifique lié à la conception d'interfaces, en l'occurrence l'atomic design. Bien que ce concept soit pertinent dans le cadre des techniques de production et du design moderne, il ne couvre pas directement les éléments clés mentionnés dans la référence, tels que les normes prépresse, les modèles colorimétriques ou l'expérience utilisateur. L'exercice est donc partiellement pertinent car il aborde un aspect du design mais ne touche pas aux compétences plus larges et essentielles décrites dans la synthèse."}, {"exercise": {"id": "58a83fde0a3348baaca5da731c2c0cf1", "query": "Dans le domaine du design d'expérience, le design ne se limite pas à <blank>, mais inclut également la prise en compte de l'expérience utilisateur.", "answers": ["la conception"], "distractors": [["le dessin", "la programmation", "le codage", "la visualisation", "la création d'interface", "les outils graphiques"]], "feedback": "La bonne réponse est 'la conception', car dans le cadre du design d'expérience, il est essentiel de comprendre que le terme « design » renvoie à la manière dont un produit est conçu, avec un accent particulier sur l'expérience utilisateur, et non simplement sur la création visuelle ou graphique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du concept de design dans le contexte de l'expérience utilisateur, ce qui est pertinent par rapport à la référence sur les techniques de production et le design. Cependant, il se concentre principalement sur une définition limitée du terme 'design' sans explorer d'autres aspects clés mentionnés dans la synthèse, tels que les normes prépresse, la direction artistique ou les modèles colorimétriques. Bien qu'il soit utile pour évaluer une partie de la compréhension des concepts liés au design, il ne couvre pas suffisamment l'ensemble des compétences et connaissances attendues d'un expert en techniques de production."}, {"exercise": {"id": "66ce7b152de44607970d26f764001f4b", "statement": "Améliorer l'accessibilité d'un site web permet d'augmenter son trafic et ses conversions.", "veracity": true, "feedback": "Cette affirmation est correcte. Il est explicitement mentionné que l'amélioration de l'accessibilité web permet de toucher un public plus large, ce qui a pour conséquence potentielle d'augmenter le trafic ainsi que les conversions sur le site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important du design web, à savoir l'accessibilité, qui est en lien avec l'expérience utilisateur (UX). Bien que cela soit pertinent pour le chapitre sur les techniques de production et le design, l'exercice ne couvre pas directement les concepts clés tels que la création graphique, les normes prépresse ou les spécificités des fichiers de fabrication. Il se concentre plutôt sur une conséquence d'une bonne pratique dans le design web sans explorer en profondeur les techniques de production elles-mêmes. Par conséquent, bien qu'il soit pertinent, il ne teste pas entièrement la compréhension des éléments fondamentaux du sujet."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception, à savoir l'ergonomie et l'expérience utilisateur (UX), qui sont des éléments clés dans le processus de création graphique mentionné dans la référence. Cependant, il ne couvre pas directement les techniques de production ou les normes prépresse, qui sont également essentielles pour devenir un expert en techniques de production. L'exercice est pertinent mais ne teste pas complètement tous les concepts clés évoqués dans la synthèse."}, {"exercise": {"id": "9658d6c80b9f4df48c99d7f3db50b327", "statement": "Les tendances dans la conception d'applications doivent toujours être suivies pour garantir une meilleure expérience utilisateur.", "veracity": false, "feedback": "Il est spécifiquement mentionné que les tendances ne doivent pas dicter la conception. Ce qui compte, c'est de créer une solution intuitive basée sur ce à quoi les utilisateurs sont habitués, afin de prévenir la frustration.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect important de l'expérience utilisateur (UX) en relation avec les tendances de conception. Bien qu'il aborde un point pertinent sur le fait que les tendances ne doivent pas être suivies aveuglément, il ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. L'exercice pourrait être amélioré en intégrant des éléments plus spécifiques liés aux méthodes de production et à la création graphique, mais il reste pertinent pour une partie des concepts clés abordés."}, {"exercise": {"id": "d76809cc290945e78447dc42776005c7", "statement": "Les animations présentes sur le site de Studio Brot jouent un rôle important dans l'expérience utilisateur en maintenant son attention.", "veracity": true, "feedback": "Les diverses animations présentes sur le site Web de Studio Brot sont conçues pour garder l'utilisateur engagé, en le surprenant et en suscitant la curiosité sur ce qui va suivre.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5406f7d079a64abf9cf0b94a61af4904", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Studio Brot est une agence de design qui se concentre sur la publicité et l'image de marque. Leurs services sont décomposés et simplifiés, présentés à l'utilisateur sous la forme d'une métaphore de la cuisson du pain (Brot - pain en allemand). Nous sommes tombés amoureux de leurs techniques de navigation et des diverses animations sur le site Web qui vous gardent toujours à l'affût, vous faisant vous demander à quoi vous attendre ensuite.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "f6090b0ed92f42daa23ee91e9a69ea73", "prev_id": "e1fb6be712cb4084b479d027f2ab6e53", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance des animations dans l'expérience utilisateur, ce qui est un aspect pertinent du design moderne mentionné dans la référence. Cependant, il ne couvre pas directement les techniques de production ou les normes prépresse, qui sont des éléments clés de la référence. L'exercice pourrait être amélioré en intégrant des questions sur les méthodes de création graphique et leur impact sur l'expérience utilisateur."}, {"exercise": {"id": "995e290cda554dceb9314682933f7829", "statement": "L'espace blanc, ou espace négatif, est utilisé pour représenter les parties textuelles du design.", "veracity": false, "feedback": "L'espace blanc, également appelé espace négatif, se réfère au vide autour ou à l'intérieur des éléments de conception, et non aux parties textuelles. Il s'agit d'un élément clé pour améliorer la lisibilité et la hiérarchie visuelle dans un design.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un concept important du design, à savoir l'espace blanc ou espace négatif, qui est essentiel pour la lisibilité et la hiérarchie visuelle. Cependant, bien que cela soit pertinent pour le design graphique, l'exercice ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. Il teste une compréhension d'un aspect du design mais ne touche pas aux compétences techniques ou aux processus de création évoqués dans la synthèse. Par conséquent, il est pertinent mais pas entièrement aligné avec tous les objectifs d'apprentissage de la référence."}, {"exercise": {"id": "93e7ef85a293427fa476fcf9bd39ab01", "question": "Quelle étape précède généralement la réalisation du zoning lors d’un projet web ?", "answers": ["La création de l’arborescence"], "distractors": ["La définition du cahier des charges", "Le développement de la base de données", "La mise en place des tests utilisateurs", "L’optimisation de la vitesse de chargement", "La proposition de maquettes aux parties prenantes", "La sélection des outils de gestion de projet", "L’écriture du contenu rédactionnel", "La validation finale du client", "La configuration des serveurs"], "feedback": "Avant de procéder au zoning, il est nécessaire de définir la structure du site à travers une arborescence. Cela permet d'avoir une vision globale de l'organisation des pages et des contenus. Ainsi, le zoning peut être réalisé en parallèle de la création de l'arborescence.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'une étape spécifique dans le processus de conception web, qui est un aspect clé des techniques de production et du design. La question sur l'étape précédant le zoning est pertinente car elle touche à la planification et à l'organisation nécessaires pour une création efficace. Cependant, bien que cela soit lié au design web, l'exercice ne couvre pas directement les concepts plus larges tels que les normes prépresse, les spécificités des fichiers de fabrication ou l'expérience utilisateur, qui sont également cruciaux dans le contexte donné. Par conséquent, il obtient une note relativement bonne mais pas parfaite."}, {"exercise": {"id": "2e4690c8ed0e457c984b12c5a4c9dc8a", "question": "Que désignent les micro-espaces blancs dans une conception graphique ?", "answers": ["Les petits espaces/tampons créés autour du contenu pour plus d'aération"], "distractors": ["Les grandes zones vides placées intentionnellement pour guider le lecteur", "Les couleurs claires utilisées pour alléger visuellement une page", "Les lignes invisibles délimitant les paragraphes dans un texte structuré", "Les éléments graphiques utilisés pour attirer l'attention sur le contenu", "Les zones d'ombre ajoutées pour créer un effet de relief", "Les marges de sécurité pour éviter les débordements de texte", "Les espaces réservés pour insérer des images ou des vidéos", "Les interlignes ajustables selon la police choisie pour le texte", "Les bordures entourant chaque section afin de garantir la lisibilité"], "feedback": "Les micro-espaces blancs sont créés autour du contenu pour aérer visuellement la mise en page et éviter un aspect trop chargé. Ils peuvent également être ajustés pour des raisons esthétiques, mais ils sont toujours présents même s'ils ne sont pas voulus.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur les micro-espaces blancs dans une conception graphique, ce qui est pertinent pour le design et l'esthétique des projets graphiques. Bien que cela ne couvre pas directement toutes les techniques de production mentionnées dans la référence, il touche à un aspect important de la communication visuelle et de l'expérience utilisateur. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés aux normes prépresse ou aux spécificités des fichiers de fabrication, qui sont également des concepts clés dans la référence."}, {"exercise": {"id": "f4b28520ee1f4e42b907e9f23a587b75", "query": "Les espaces blancs passifs sont des lacunes qui apparaissent naturellement dans la conception ou la typographie, tandis que les espaces blancs actifs sont ajoutés intentionnellement pour <blank>.", "answers": ["faciliter la lecture"], "distractors": [["améliorer le contraste", "réduire la fatigue oculaire", "remplir les zones vides", "augmenter l'espace visuel", "contrôler l'esthétique", "optimiser la typographie"]], "feedback": "La bonne réponse est 'faciliter la lecture' car les espaces blancs actifs ont pour but explicite de diriger l'attention d'un utilisateur en rendant la page plus facile à parcourir. Ils ne sont pas accidentels mais créés pour améliorer la lisibilité et le flux visuel.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur les espaces blancs dans la conception, ce qui est pertinent pour le design graphique et l'expérience utilisateur. Cependant, il ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. Bien qu'il teste une compétence liée à l'esthétique et à la lisibilité, il n'aborde pas des concepts clés comme le design system, la direction artistique ou les modèles colorimétriques qui sont essentiels pour un expert en techniques de production. Par conséquent, bien que l'exercice soit utile, il ne teste pas suffisamment les éléments centraux de la référence."}, {"exercise": {"id": "0404cd7946624d6ea2cefbd59a30a15e", "statement": "Un Stylescape est utilisé pour mieux communiquer avec les clients ou les parties prenantes.", "veracity": true, "feedback": "Un des objectifs clés d'un Stylescape est en effet de faciliter la communication en fournissant une vision claire du résultat attendu à toutes les personnes impliquées, y compris les clients ou autres parties prenantes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un concept pertinent lié à la communication visuelle et à la direction artistique, qui sont des éléments clés dans le domaine de la création et du design. Cependant, il ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. Bien que l'affirmation sur le Stylescape soit correcte et pertinente pour le processus créatif, elle n'évalue pas suffisamment les compétences techniques ou les connaissances spécifiques liées aux méthodes de production décrites dans la synthèse. Par conséquent, bien qu'il soit en lien avec certains aspects du design, l'exercice pourrait être plus ciblé sur les concepts fondamentaux des techniques de production."}, {"exercise": {"id": "bf5b3d2280b34d15a072e6270eabfaca", "question": "Quel est l'avantage principal du Stylescape par rapport à d'autres outils similaires ?", "answers": ["Il offre une expérience visuelle plus complète et immersive"], "distractors": ["Il est moins coûteux à réaliser.", "Il nécessite moins de ressources de conception.", "Il est entièrement basé sur des données chiffrées.", "Il permet de travailler sans retour client.", "Il ne demande aucun ajustement après présentation.", "Il se concentre uniquement sur les aspects techniques.", "Il exclut toute visualisation graphique.", "Il se passe d'interactions avec les parties prenantes.", "Il est utilisé uniquement pour la communication interne."], "feedback": "Le Stylescape va plus loin en offrant une représentation plus complète et immersive de l'expérience visuelle attendue, ce qui facilite la compréhension et la visualisation du résultat final. Il permet ainsi d'aligner plus efficacement les idées avec les clients et les parties prenantes concernées. Cela le rend plus avantageux par rapport à d'autres outils similaires qui ne fournissent peut-être pas une telle expérience visuelle complète.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1cc8dc888f674583a957f2a782085892", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les deux outils sont utilisés pour communiquer et aligner les idées avec les clients ou les parties prenantes concernées. Cependant, le Stylescape va plus loin en offrant une représentation plus complète et immersive de l'expérience visuelle attendue, ce qui facilite la compréhension et la visualisation du résultat final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "088d4c7f46de40f0986cfa0cc08bc0bc", "prev_id": "ec3a9e230f6943ae8c0b2d363898bc4d", "associated_block_ids": [], "first_page": 19, "last_page": 19, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un outil spécifique (Stylescape) qui est pertinent dans le contexte des techniques de production et du design. Bien qu'il ne couvre pas directement tous les aspects mentionnés dans la référence, il touche à l'importance de la représentation visuelle et de l'expérience utilisateur, qui sont des éléments clés du processus de création graphique. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés aux normes prépresse ou à la direction artistique, ce qui limiterait sa portée par rapport à l'ensemble des concepts abordés dans la synthèse."}, {"exercise": {"id": "a1de457818dc460db40991b785055b2a", "query": "Le Stylescape se différencie du moodboard en cherchant à représenter <blank> d'un projet.", "answers": ["l'identité, l'atmosphère et l'expérience globale"], "distractors": [["une simple collection d'inspirations visuelles", "les éléments graphiques et textures", "seulement l'esthétique générale", "uniquement les couleurs et styles", "principalement les tendances visuelles", "la palette de couleurs et polices"]], "feedback": "Le Stylescape dépasse la simple collecte d'inspirations visuelles pour créer une composition cohérente représentant l'identité, l'atmosphère et l'expérience globale d'un projet. Il ne se limite donc pas aux éléments visuels isolés comme dans un moodboard.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bd42cab0c42544a2b7e4b57dd58c7556", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le Stylescape et le moodboard sont deux approches différentes utilisées dans le processus créatif pour visualiser et communiquer des idées de design. Le moodboard est principalement utilisé pour rassembler et présenter une collection d'inspirations visuelles, d'éléments graphiques, de textures, de couleurs, etc. C'est une représentation visuelle de l'ambiance et de l'esthétique générale d'un projet. Le Stylescape, quant à lui, va au-delà de la simple collection d'éléments visuels en cherchant à créer une composition visuelle qui représente l'identité, l'atmosphère et l'expérience globale d'un projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "a425d9d448e14f39b2bf4a181b709422", "prev_id": "4c6943198f4f442e8c6e608955fd85f1", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé teste la compréhension d'un concept spécifique lié à la création et au design, en l'occurrence la différence entre un Stylescape et un moodboard. Bien que cela soit pertinent pour le domaine du design et de la création graphique, il ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. L'exercice évalue une compétence liée à l'identité visuelle, mais il aurait pu être plus directement lié aux aspects techniques ou aux processus de production décrits dans la synthèse. Par conséquent, bien qu'il soit pertinent, il ne touche pas suffisamment aux éléments clés de la référence pour obtenir une note plus élevée."}, {"exercise": {"id": "0df4b17da3fe4f64bb9904c291af286b", "statement": "Le Stylescape se concentre sur des éléments concrets qui représentent l'identité du projet.", "veracity": true, "feedback": "Le Stylescape est effectivement plus précis que le moodboard et se concentre sur des éléments clés et concrets qui reflètent l'identité et l'atmosphère du projet, donnant ainsi une vision plus claire de l'apparence finale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3114978bee814521a435aad18ed70c89", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le moodboard est souvent utilisé au début du processus créatif pour explorer différentes directions et rassembler des influences visuelles. Il est plus large et ouvert, permettant d'explorer diverses options. Le Stylescape, en revanche, est plus précis et spécifique. Il se concentre sur les éléments clés qui représentent l'identité et l'atmosphère du projet, en utilisant des éléments plus concrets et en donnant une idée plus précise de l'apparence finale.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "da98e60ed8304ac9972d483d953bebef", "prev_id": "cc80a773dfd44d73a0652219668ed7df", "associated_block_ids": [], "first_page": 18, "last_page": 18, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un concept lié à l'identité visuelle et à la direction artistique, qui sont des éléments importants dans le domaine de la création et du design. Cependant, bien que le Stylescape soit pertinent pour représenter l'identité d'un projet, l'exercice ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. Il aurait été plus pertinent de poser une question sur les méthodes de production ou sur comment ces éléments s'intègrent dans un processus de création graphique global."}, {"exercise": {"id": "a0733f4df0a4419a9590bc72e176fd8e", "statement": "Le Stylescape se limite à rassembler des éléments visuels pour présenter une ambiance générale.", "veracity": false, "feedback": "Le Stylescape ne se limite pas uniquement à la collecte d'éléments visuels comme le moodboard. Il va plus loin en créant une composition visuelle qui capture l'identité, l'atmosphère et l'expérience globale d'un projet de manière plus immersive et articulée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bd42cab0c42544a2b7e4b57dd58c7556", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le Stylescape et le moodboard sont deux approches différentes utilisées dans le processus créatif pour visualiser et communiquer des idées de design. Le moodboard est principalement utilisé pour rassembler et présenter une collection d'inspirations visuelles, d'éléments graphiques, de textures, de couleurs, etc. C'est une représentation visuelle de l'ambiance et de l'esthétique générale d'un projet. Le Stylescape, quant à lui, va au-delà de la simple collection d'éléments visuels en cherchant à créer une composition visuelle qui représente l'identité, l'atmosphère et l'expérience globale d'un projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "a425d9d448e14f39b2bf4a181b709422", "prev_id": "4c6943198f4f442e8c6e608955fd85f1", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de Stylescape, qui est pertinent dans le contexte de la création et du design, en particulier en ce qui concerne l'identité visuelle et l'expérience utilisateur. Cependant, bien que cela touche à des aspects importants du design moderne, l'exercice ne couvre pas directement les techniques de production ou les normes prépresse mentionnées dans la référence. Il évalue plutôt une compréhension d'un outil spécifique utilisé dans le processus créatif. Ainsi, bien qu'il soit lié au sujet global, il ne teste pas de manière exhaustive les compétences clés attendues d'un expert en techniques de production."}], "sources": [{"document": {"id": 13701, "label": "Sequence 1_Brief et stylescape", "authors": [], "title": "Création et Design Digital pour Musilac", "content": [], "mime_type": "application/pdf", "short_summary": "Le festival Musilac prévoit de collaborer avec des experts en création visuelle pour 2024, tout en maintenant sa direction artistique actuelle. Un service marketing introduira également une Box VIP en pré-vente sur le site internet.", "long_summary": "- Le festival Musilac cherche des experts pour la création de supports de communication visuelle pour 2024.\n- L'équipe souhaite conserver la direction artistique existante et adapter le nouveau visuel sur divers supports.\n- Les fichiers de production doivent être transmis directement aux prestataires concernés.\n- Introduction d'une Box VIP en pré-vente sur le site internet par le service marketing.\n- La veille graphique est essentielle pour suivre l'évolution visuelle d'une marque et maintenir une image forte et cohérente.\n- Elle permet d'identifier les opportunités, prévenir les problèmes potentiels, et renforcer la reconnaissance de la marque.\n- Observer les tendances assure que la marque reste pertinente dans son secteur.\n- Un stylescape est un outil utile pour présenter les éléments clés du design d'un projet.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/0D0xJo5p6o8h3dJ8/documents/c0be784_sequence-1_brief-et-stylescape.pdf", "external_url": null, "path": null, "corpus_id": 639, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- MAJEURE 4 > 64 heures > 10 jours\n===\n\n- LES NOTIONS ABORDÉES\n===\n\n- VOTRE PROGRAMME\n===\n\n- ÉDITION 2024 FESTIVAL MUSILAC\n===\n\n  - ## L'identité visuelle\n\n  - ## Adapter les stratégies\n\n  - ## Bell MT\n", "number_of_pages": 19, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 11.4, "top_pages": [10, 14], "top_minutes": []}, {"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 9.2, "top_pages": [267, 268], "top_minutes": []}]}