{"introduction": "La conception de maquettes et pré-maquettes est une étape cruciale dans le développement d'interfaces numériques, permettant de visualiser et d'organiser les éléments avant leur mise en œuvre finale. Ce processus implique une compréhension approfondie des besoins des utilisateurs, ainsi que l'application de principes de design centrés sur l'expérience utilisateur (UX). Cette synthèse explore divers concepts clés qui sous-tendent la création efficace de maquettes, en mettant l'accent sur la fonctionnalité, l'esthétique et l'accessibilité.", "synthesis": "La conception d'expérience utilisateur (UX) est au cœur du processus de création de maquettes. Elle vise à optimiser les interactions entre les utilisateurs et les produits numériques, en tenant compte des comportements et préférences des usagers. Les designers UX collaborent avec les UI designers pour établir des interfaces intuitives qui améliorent la satisfaction utilisateur tout en gérant la complexité du système. Dans ce contexte, le wireframing se présente comme une technique essentielle pour créer des maquettes schématiques qui clarifient la structure d'une interface sans se concentrer sur le design graphique final.\n\nUn autre aspect fondamental est la simplicité dans le design, qui privilégie un minimalisme fonctionnel afin de rendre les interfaces claires et faciles à utiliser. La cohérence joue également un rôle clé : elle assure une uniformité dans le design et les interactions, facilitant ainsi la compréhension par l'utilisateur. Les composants d'interface tels que boutons, liens et menus sont essentiels pour permettre cette interaction fluide.\n\nLes éléments graphiques contribuent à enrichir visuellement ces interfaces tout en aidant à communiquer efficacement des informations complexes. L'utilisabilité est mesurée pour garantir que chaque interface soit intuitive et satisfaisante pour l'utilisateur final. Des outils comme Magic UI offrent des bibliothèques prêtes à l'emploi qui accélèrent le développement tout en maintenant un haut niveau esthétique.\n\nL'éco-conception émerge comme une approche moderne intégrant des considérations environnementales dans le design numérique, visant à réduire l'impact écologique tout au long du cycle de vie d'un produit ou service. Parallèlement, le responsive design permet aux sites web de s'adapter dynamiquement aux différentes tailles d'écran, garantissant ainsi une expérience utilisateur optimale sur tous types d'appareils.\n\nEnfin, les gabarits de pages et modèles prédéfinis facilitent la création uniforme tout en respectant les principes ergonomiques nécessaires pour optimiser la navigation. En somme, réaliser une maquette efficace nécessite non seulement une attention particulière aux détails visuels mais aussi une compréhension profonde des besoins utilisateurs afin d'assurer que chaque élément contribue positivement à leur expérience.", "concepts": [{"concept": {"id": "baebe016-d0cc-4e32-9346-f7e1124193a3", "label": "Conception d'Expérience Utilisateur (UX)", "definition": "La conception d'expérience utilisateur (UX) est une discipline centrée sur l'optimisation des interactions entre les utilisateurs et les produits ou services numériques. Elle vise à améliorer la satisfaction et l'efficacité de l'utilisation en créant des interfaces utilisateur intuitives et attrayantes, tout en tenant compte des comportements, besoins cognitifs et préférences des utilisateurs finaux. Ce processus englobe à la fois l'esthétique et la fonctionnalité, influençant ainsi l'expérience globale par des choix visuels et structurels. Les professionnels tels que les designers UX et UI travaillent à établir des interactions significatives, simplifiant l'interaction utilisateur tout en gérant la complexité sous-jacente du système.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13609, 13709], "aliases": ["dbb0eb49-384a-4835-8a27-f3df10e75759", "91010b14-36ae-419d-bf38-a846de1275f6", "574e83b8-4354-48fa-850e-93c5120ebc83", "ecf19b49-88ec-4c4c-a1b6-95ffa690e97f", "25934ed3-33c1-4498-8e65-074291667094", "796f5e0a-7a74-4541-adfb-b2193ad73b61", "a23c6da5-a4ab-4891-991e-7b937aa0abdc", "37ee1509-2635-464b-9584-a9b0c9d9c8ad", "c00973e6-b1c9-4905-942b-5be484cb15c3", "d4bcea8d-2203-4129-9886-2b5a3d013def", "10afcc11-a32f-4ff7-b2c9-b91fd8f41279", "bfa65925-0083-4475-bf52-1b49b880a8ef", "172c8581-4218-4949-9879-3623e9c81b76", "84c2a388-034d-4adb-8881-3d024eed3a5c", "54158781-d4d4-4026-a63f-e0e8693a8902", "9f681d3a-0c7c-4485-9bcf-e52381ff9719", "da83989a-f0e2-4e84-b8e1-dbb6cfe0e312"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Conception d'Expérience Utilisateur (UX)' est au cœur du processus de création de maquettes, car elle vise à optimiser l'interaction utilisateur avec les interfaces conçues."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "'Wireframing' est directement lié à la réalisation de maquettes, car il s'agit d'une technique fondamentale pour visualiser et structurer une interface avant sa finalisation."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "La simplicité est un principe fondamental dans le design d'interfaces et joue un rôle crucial dans la réalisation efficace des maquettes."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les usagers sont au cœur du processus de conception ; comprendre leurs besoins et comportements est fondamental pour réaliser efficacement des maquettes adaptées et fonctionnelles."}, {"concept": {"id": "bbec4b6c-ecb2-4980-a828-4ea2e6a15f47", "label": "Cohérence", "definition": "Uniformité dans le design et les interactions au sein d'une interface ou d'une application, favorisant une meilleure compréhension et garantissant une expérience fluide pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["df6e29c5-d22e-4955-90b8-9e1627d2e164"], "wikientity": null, "wordnetentity": {"label": "Cohérence", "definition": "a harmonious uniformity or agreement among things or parts", "name": "consistency.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "La cohérence est cruciale dans la mise en forme et le design des maquettes, garantissant une expérience utilisateur fluide et harmonieuse."}, {"concept": {"id": "935f36e5-c751-4b36-a60c-e2e65c6fa825", "label": "Tableau de mise en forme", "definition": "Un tableau de mise en forme est un tableau utilisé pour organiser visuellement des données ou du contenu, où le contenu doit rester compréhensible même lorsqu'il est linéarisé. Son utilisation doit également respecter certaines règles d'accessibilité afin de garantir que l'information soit accessible à tous les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["57962488-811b-4da6-8fde-5194589a599d"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Tableau de mise en forme' est hautement pertinent car il s'agit d'un outil essentiel pour organiser visuellement les informations dans les maquettes."}, {"concept": {"id": "180973ca-7ea4-4179-9de6-4306d5f4a2c2", "label": "Composants d'interface", "definition": "Les composants d'interface sont des éléments interactifs sur une page web, tels que des boutons, des liens et des menus, qui permettent aux utilisateurs d'interagir avec le système et sont essentiels pour l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["b5b72bc5-0aa8-4ebc-9e2a-5b66e752e50d"], "wikientity": {"label": "Composant d'interface graphique", "definition": "En informatique, un composant d'interface graphique (aussi appelé widget en anglais ou encore control) est un élément de base d'une interface graphique avec lequel un utilisateur peut interagir (par exemple une fenêtre ou une zone de texte). Ces composants sont généralement regroupés dans des boîtes à outils graphiques (appelées toolkit en anglais). Une fois assemblés par un programmeur, ces composants forment une interface graphique complète.", "page_id": "1587875", "wikidata_id": "Q605117", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Les composants d'interface sont fondamentaux pour toute maquette car ils représentent les éléments interactifs qui composent l'expérience utilisateur finale."}, {"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Éléments graphiques' sont essentiels dans la création de maquettes, car ils constituent les composants visuels nécessaires à la mise en forme et à l'interaction utilisateur."}, {"concept": {"id": "7843365f-32d0-4ace-98d4-f900474fa71e", "label": "UI Designer", "definition": "Designer d'interface utilisateur responsable de l'apparence visuelle et de l'interactivité d'un produit numérique, complémentaire au travail de l'UX designer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'UI Designer' est très pertinent car ce rôle se concentre spécifiquement sur l'apparence et l'interactivité des produits numériques, essentiels lors de la création de maquettes."}, {"concept": {"id": "93243cf1-1c62-40e6-b2ac-c4f1322cfadb", "label": "Utilisabilité", "definition": "Mesure de l'efficacité et de la satisfaction d'une interface utilisateur, essentielle pour garantir une interaction fluide et intuitive.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": {"label": "Utilisabilité", "definition": "L’utilisabilité, ou encore aptitude à l'utilisation est définie par la norme ISO 9241-11 comme « le degré selon lequel un produit peut être utilisé, par des utilisateurs identifiés, pour atteindre des buts définis avec efficacité, efficience et satisfaction, dans un contexte d’utilisation spécifié ».\nC'est une notion proche de celle d'affordance, ou même d’ergonomie qui est cependant plus large.\nLes critères de l’utilisabilité sont :\n\nl’efficacité : le produit permet à ses utilisateurs d’atteindre le résultat prévu.", "page_id": "142385", "wikidata_id": "Q216378", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'utilisabilité est essentielle lors de la conception de maquettes car elle détermine comment les utilisateurs interagiront avec l'interface créée."}, {"concept": {"id": "70a3cabd-4c5e-4877-897a-b00631814b8c", "label": "Magic UI", "definition": "Bibliothèque UI conçue pour créer des interfaces élégantes et fonctionnelles, offrant des composants prêts à l'emploi et spécifiquement développée pour React, idéale pour un développement rapide grâce à ses composants prédéfinis faciles à utiliser.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": ["89987706-dc96-44d1-8631-a92753660f62"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Magic UI est très pertinent car il fournit des composants prêts à l'emploi pour créer des interfaces, ce qui est essentiel lors de la réalisation de maquettes."}, {"concept": {"id": "8d20d835-630d-4c6b-8a00-86480b18dc06", "label": "Conception pour les pouces", "definition": "Approche de design axée sur l'accessibilité des éléments d'interface pour une utilisation à une main, particulièrement pertinente pour les appareils mobiles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La conception pour les pouces est extrêmement pertinente car elle aborde spécifiquement comment rendre les interfaces accessibles et utilisables sur mobile, ce qui est essentiel lors de la création de maquettes modernes."}, {"concept": {"id": "d21b0904-b791-40c5-bc3a-973c8612f170", "label": "Template", "definition": "Un template est un modèle ou un gabarit utilisé pour générer des documents dynamiques, facilitant la réutilisation et l'organisation du contenu dans le développement web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13618], "aliases": [], "wikientity": {"label": "Template (programmation)", "definition": "En programmation informatique, les templates (en français modèles, parfois aussi appelés patrons) sont une particularité de la programmation en langage C++, qui autorise l'écriture d'un code sans considération envers le type des données avec lesquelles il sera finalement utilisé. Les templates introduisent le concept de programmation générique dans le langage.\nLes templates sont d'une grande utilité pour les programmeurs en C++, plus particulièrement en les combinant avec l'héritage multiple, la surcharge d'opérateur ou plus généralement la programmation orientée objet.", "page_id": "3096127", "wikidata_id": "Q1411845", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Template", "definition": "a model or standard for making comparisons", "name": "template.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "Un template est un outil fondamental dans la création de maquettes, permettant d'organiser et de réutiliser des éléments visuels efficacement."}, {"concept": {"id": "5792c744-4854-454e-8f87-ec4f5ccf2582", "label": "Éco-conception", "definition": "L'éco-conception est une approche de design qui intègre des considérations écologiques et les enjeux environnementaux dans la conception de produits ou services, y compris le développement durable dans la création de sites web. Elle vise à minimiser l'impact environnemental tout au long du cycle de vie des produits ou services, en équilibrant durabilité, faisabilité technique et performance visuelle et économique, tout en cherchant spécifiquement à réduire l'empreinte écologique des plateformes numériques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689, 13705, 13707, 13710], "aliases": ["38fcc5fa-1e9a-4c59-aae0-84056f944879", "609f9dc6-35e8-4391-930d-0357b9e53ae7", "dfc96dcc-97c8-4069-b1a1-dfbb8ca41f8a", "05a8aba3-d572-485a-b33a-17449f7e81db", "4e4dabed-3dd1-4b7f-a965-da4f5c53ce5d"], "wikientity": {"label": "Écoconception", "definition": "L’écoconception est la volonté de concevoir des produits respectant les principes du développement durable et de l'environnement, en — selon l'Ademe — recourant « aussi peu que possible aux ressources non renouvelables en leur préférant l'utilisation de ressources renouvelables, exploitées en respectant leur taux de renouvellement et associées à une valorisation des déchets qui favorise le réemploi, la réparation et le recyclage », dans un contexte qui évoluerait alors vers une économie circulaire.\nLa définition officielle qui fait foi pour l'ADEME est la suivante : « C’est une démarche préventive et innovante qui permet de réduire les impacts négatifs du produit, service ou bâtiment sur l’environnement sur l’ensemble de son cycle de vie (ACV), tout en conservant ses qualités d’usage. »\nÀ partir de celle-ci, on peut en effet décliner d'autres formulations ou déclinaisons.", "page_id": "3967563", "wikidata_id": "Q795082", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "'Éco-conception' est très pertinente car elle intègre des considérations écologiques dans le design, ce qui peut fortement influencer la manière dont les maquettes sont conçues et perçues visuellement."}, {"concept": {"id": "adc8dc13-f786-4914-8a14-7ba79f9406d6", "label": "Responsive Design", "definition": "La conception réactive, ou responsive design, est une approche de conception web qui permet aux sites et emails de s'adapter automatiquement à différentes tailles d'écran et formats. Elle ajuste dynamiquement le contenu selon la largeur de l'écran, optimisant ainsi l'expérience utilisateur sur tous les appareils, y compris mobiles et tablettes. Cette méthode garantit une accessibilité améliorée et une expérience utilisateur cohérente sans nécessiter la création de maquettes séparées. Avec l'augmentation du trafic mobile, cette approche est devenue essentielle pour répondre aux besoins variés des utilisateurs sur toutes les plateformes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13670, 13705], "aliases": ["efecb8a8-c6df-48af-bf39-bb4da8fd8376", "1f741a6d-bbf7-4bfe-b77b-a1ef82c29bc6", "e1917e2a-f148-467e-8262-4f1dd26e2f71", "cc031509-4f61-49ef-aa86-aa8c871fcb3e", "7bfb57a5-469b-4c0b-9487-f9afdcf3b3cd", "dfaa8d51-d283-479b-9fe7-b089a0e35db8", "54138ec5-0216-46c4-89a9-1c8119032f02", "a8bde322-f83e-42d7-9eb7-e659681882c6", "4fd67f4c-c4cf-4125-bea0-62c60a94d589", "4ea15d31-4c8b-47ac-8abd-3a55541f163e"], "wikientity": {"label": "Site web réactif", "definition": "Un site web réactif (RWD, de l’anglais responsive web design : conception de sites web réactifs) est un site web dont la conception vise, grâce à différents principes et techniques, à offrir une consultation confortable sur des écrans de tailles très différentes. L'utilisateur peut ainsi consulter le même site web à travers une large gamme d'appareils (moniteurs d'ordinateur, smartphone, tablettes, télévision…) avec le même confort visuel et sans avoir recours au défilement horizontal ou au zoom avant/arrière sur les appareils tactiles notamment, manipulations qui peuvent parfois dégrader l'expérience utilisateur, tant en lecture qu'en navigation. Un site web réactif est un exemple de plasticité des interfaces.", "page_id": "6049523", "wikidata_id": "Q420295", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le responsive design est crucial pour la mise en forme des maquettes, car il garantit que celles-ci s'adaptent à différents appareils, ce qui est essentiel dans le contexte de la conception moderne."}, {"concept": {"id": "1092d789-d0be-4326-b469-d82156055fd1", "label": "Modèles prédéfinis", "definition": "Structures HTML fournies par Twig pour insérer facilement des données tout en maintenant une séparation claire entre le code et le visuel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13618], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Modèles prédéfinis' est très pertinent car il s'agit d'une méthode utilisée pour structurer visuellement les données lors de la création de maquettes, facilitant ainsi le design."}, {"concept": {"id": "af063a7b-697c-4698-a3f9-571b25d446e7", "label": "Ergonomie web", "definition": "Discipline visant à adapter, concevoir et optimiser les interfaces web et utilisateur afin de garantir une utilisation facile, intuitive et confortable, favorisant ainsi la satisfaction des utilisateurs tout en tenant compte des lois psychologiques comme celles de Miller et Fitts, et améliorant l'expérience utilisateur sur les sites internet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707], "aliases": ["a22c9961-6357-4e30-8ce8-913123f918ec", "124581b4-e0cd-46eb-affc-0e2e0d426e33"], "wikientity": {"label": "Ergonomie des interfaces informatiques", "definition": "L'ergonomie informatique (ou ergonomie des interfaces) est une branche de l'ergonomie, qui a pour objectif d'améliorer les interactions homme-machine, la facilité d’utilisation et d’apprentissage des produits interactifs. Cette pratique cherche à concevoir ou modifier des interfaces afin qu'elles soient en adéquation avec les caractéristiques physiologiques, perceptives et cognitives de leurs utilisateurs potentiels. Elle s'appuie sur différentes  méthodes de conception et d’évaluation permettant d’obtenir le logiciel ou le site web le mieux adapté aux utilisateurs visés.", "page_id": "4962192", "wikidata_id": "Q1642623", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'ergonomie web est essentielle pour concevoir des interfaces utilisateur efficaces et intuitives, ce qui est central dans le processus de création de maquettes."}, {"concept": {"id": "ff356c21-a6a9-4643-9b85-5ea63c1962d7", "label": "Composants d'Interface Utilisateur", "definition": "Les composants d'interface utilisateur sont des unités graphiques indépendantes et réutilisables, telles que des boutons, des liens ou des cartes, qui encapsulent la logique et le rendu d'une partie de l'interface. Ils permettent aux utilisateurs d'interagir avec le contenu et les fonctionnalités sur une page web. Dans des outils comme Figma, ces éléments aident les designers à maintenir une cohérence visuelle tout en facilitant les mises à jour, s'assemblant pour former des structures plus complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13668, 13708], "aliases": ["aa4065a5-c93e-4843-8784-987b3fb4a95b", "a52293d6-e08a-4666-9aa0-34c8daaf1426", "c177b8d1-7c43-4e1e-8b3d-ae5c9e7b3057"], "wikientity": {"label": "Composant logiciel", "definition": "En architecture logicielle, un composant logiciel est un élément constitutif d'un logiciel destiné à être incorporé en tant que pièce détachée dans des applications. Les paquets, les bibliothèques logicielles, les exécutables, les fichiers, les bases de données ou encore des éléments de configuration (paramètres, scripts, fichiers de commandes) sont des composants logiciels. \nLes composants logiciels sont développés par des professionnels de l'informatique en vue d'être réutilisés dans leurs propres logiciels, ou en vue d'être mis sur le marché et incorporés dans des logiciels tiers.", "page_id": "1824031", "wikidata_id": "Q17176533", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les composants d'interface utilisateur sont essentiels dans la conception de maquettes, car ils constituent les éléments graphiques qui composent ces dernières et influencent leur mise en forme."}, {"concept": {"id": "d5978979-95eb-4c2f-bbf0-34d3ca920f47", "label": "Objectifs stratégiques", "definition": "Buts définis par un site web ou une application qui guident le design et l'ergonomie en fonction des besoins des usagers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Objectifs stratégiques' sont cruciaux pour orienter le design et garantir que les besoins des usagers sont pris en compte lors de la création des maquettes."}, {"concept": {"id": "826ac735-9873-4b63-a658-7a9022f13f23", "label": "Organisation de page", "definition": "Structure et agencement des éléments d'une page web pour optimiser la navigation et l'expérience utilisateur, en tenant compte de la hiérarchie visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'organisation de page est essentielle pour concevoir des maquettes efficaces et optimiser l'expérience utilisateur, ce qui est central à l'objectif pédagogique donné."}, {"concept": {"id": "7cff2f67-e7cc-4264-ade4-2d0d96f0cadb", "label": "Outils de design web", "definition": "Logiciels utilisés par les designers pour créer des interfaces utilisateur attrayantes et fonctionnelles, tels que Adobe XD ou Figma.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Outils de design web' sont cruciaux pour réaliser des maquettes et mettre en forme les designs, rendant ce concept très pertinent."}, {"concept": {"id": "36b55b52-94e1-4db8-ac2f-49632c6632bc", "label": "Composants prédéfinis", "definition": "Éléments d'interface utilisateur déjà conçus et disponibles dans une bibliothèque, facilitant le développement rapide sans partir de zéro.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Composants prédéfinis' sont directement liés à la mise en forme et à la conception d'interfaces, facilitant le développement de maquettes visuelles."}, {"concept": {"id": "8cfe3c8d-558a-44c3-8e30-f8297911c562", "label": "Modèle", "definition": "Représentation simplifiée d'un concept ou d'un système, utilisée pour comprendre et organiser des informations complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": {"label": "Modèle", "definition": "Le modèle concerne la notion de ressemblance, d’imitation, de représentation, il désigne :\n\nun objet réel dont on va chercher à donner une représentation, que l'on va chercher à imiter (exemple : le « modèle » du peintre, le « modèle » que constitue le maître pour le disciple) ;\nun concept ou objet considéré comme « représentatif d’un autre » (exemple : le « modèle réduit » ou maquette, le « modèle » du scientifique), déjà existant ou que l'on va s'efforcer de construire.\nLe premier sens est le « sens original ». Le second sens dérive de la pratique des architectes et ingénieurs (puis des scientifiques) consistant à construire d’abord un prototype, concret ou conceptuel, qui servira de « modèle » à une construction réelle : le modèle est ainsi devenu, en outre, l’assemblage de concepts représentant de manière simplifiée une chose « réelle déjà existante » (objet, phénomène, etc.), en vue de la comprendre, d’en prédire le comportement.", "page_id": "94751", "wikidata_id": "Q1979154", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Modèle", "definition": "the act of representing something (usually on a smaller scale)", "name": "model.n.09", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "'Modèle', en tant que représentation simplifiée d'un concept, est pertinent pour comprendre et organiser les informations nécessaires lors de la réalisation d'une maquette."}, {"concept": {"id": "adeae403-e261-4e4e-9de1-f885ca1eacfa", "label": "Gabarits de pages", "definition": "Modèles préétablis utilisés pour créer des pages web uniformes tout en respectant les principes d'ergonomie.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Gabarit (mise en page)", "definition": "Un gabarit, souvent nommé template ou layout, est un patron de mise en page où l'on place images et textes. \nAussi, il est souvent utilisé de manière répétitive pour créer des documents présentant une même structure. \nOn parle aussi de patron comme en couture ou bien, parfois, de grille.", "page_id": "117934", "wikidata_id": "Q25397911", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les gabarits de pages sont très pertinents pour la réalisation de maquettes, car ils fournissent des modèles préétablis qui aident à concevoir des interfaces web uniformes et ergonomiques."}, {"concept": {"id": "ba5eb7ea-dd8a-4048-baec-bd6ad0fdadc2", "label": "Masque de saisie", "definition": "Format prédéfini pour la saisie d'informations dans un formulaire, facilitant l'entrée correcte des données par les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le masque de saisie est pertinent pour la création de formulaires dans des maquettes, car il aide à structurer l'entrée des données et améliore l'expérience utilisateur."}, {"concept": {"id": "fe7bdcdc-9ca0-447d-bc67-86e4f075b51d", "label": "Automatisation", "definition": "L'automatisation est un processus qui utilise des technologies, outils et scripts pour exécuter automatiquement des tâches répétitives sans intervention humaine. Elle simplifie et accélère l'installation, la mise à jour des dépendances, ainsi que les tâches de développement, tests et déploiement. En réduisant les interventions humaines, elle augmente l'efficacité, la rapidité et la fiabilité du développement logiciel tout en étant essentielle pour améliorer la réactivité face aux alertes dans le monitoring et accélérer la livraison dans un environnement DevOps.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13629, 13640, 13642, 13655], "aliases": ["9d0191c4-1d66-4472-9d35-405e466aae91", "b5a52639-a786-4189-bf08-75a9cedbeccb", "4b15c581-dc9e-4e77-bd3b-81a6e780993b", "7bb2611c-8a59-4119-8d4a-d6443a2af309", "559df97b-750e-472d-8eb2-83037c0d82dc"], "wikientity": null, "wordnetentity": {"label": "Automatisation", "definition": "equipment used to achieve automatic control or operation", "name": "automation.n.03", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "L'automatisation joue un rôle clé dans le développement moderne, y compris dans le déploiement rapide et efficace des designs créés sous forme de maquettes. Elle facilite également les itérations rapides sur ces designs."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'expérience utilisateur est essentielle lors de la conception de maquettes, car elle influence directement la manière dont les utilisateurs interagissent avec le produit final."}, {"concept": {"id": "feafc97b-1109-4c79-9965-6ab15ec6ccd9", "label": "Symfony", "definition": "Symfony est un framework PHP open-source populaire utilisé pour le développement d'applications web robustes. Il repose sur le modèle MVC, favorise la réutilisation de code et l'architecture modulaire, et utilise Composer pour gérer ses propres dépendances. En plus de ces caractéristiques, Symfony offre également des outils avancés pour la gestion de la sécurité et de l'authentification, facilitant ainsi le processus de développement tout en assurant une protection efficace des applications.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13624, 13617, 13620, 13629, 13618, 13622], "aliases": ["bb7a7cb1-f082-4725-8b09-874357873101", "849bd3a7-6b32-41e3-aefa-375413a4f541", "12c1e4a1-2bf4-4a79-a4f8-c6a8b3207555", "f67a91fa-5d6d-414f-960e-463d8193da01", "86f34ac7-951a-4292-8e7b-2c4044e20fb4", "f1f39ba9-637d-47ca-8912-2e964f2d9586"], "wikientity": {"label": "Symfony", "definition": "Symfony est un ensemble de composants PHP ainsi qu'un framework MVC libre écrit en PHP. Il fournit des fonctionnalités modulables et adaptables qui permettent de faciliter et d’accélérer le développement d'un site web.", "page_id": "830377", "wikidata_id": "Q1322933", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Symfony étant un framework utilisé pour développer des applications web robustes, il a une forte pertinence dans le contexte de réalisation de maquettes et pré-maquettes."}, {"concept": {"id": "a2024caf-bad3-4b20-a384-8d3cea0b2ff7", "label": "Dribbble", "definition": "Plateforme en ligne pour designers permettant de partager des travaux créatifs et de s'inspirer des tendances actuelles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": {"label": "Dribbble", "definition": "Dribbble est un site internet qui regroupe des travaux de designer. Il sert de plate-forme de conception de portfolio , l'une des plus grandes plates-formes permettant aux concepteurs de partager leur travail en ligne. La société est entièrement isolée, sans siège social.", "page_id": "12597240", "wikidata_id": "Q7605173", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "'Dribbble' est très pertinent car c'est une plateforme où les designers partagent leurs travaux, ce qui peut inspirer et influencer la création de maquettes."}, {"concept": {"id": "3b4e3edc-01a2-4e45-a97b-d86cbd0b4064", "label": "Fonctionnalités prioritaires", "definition": "Éléments d'une interface jugés essentiels qui doivent être mis en avant pour améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les fonctionnalités prioritaires sont essentielles pour la conception d'une maquette efficace, car elles influencent directement l'expérience utilisateur et doivent être mises en avant dans le design."}, {"concept": {"id": "ec55ef1f-c143-437e-bfde-cd949f81d42b", "label": "Conversion d'action", "definition": "Mesure du succès d'une interaction sur un site web, souvent augmentée par le respect des principes ergonomiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Conversion d'action' est très pertinent car il touche aux principes ergonomiques qui doivent guider le design et la mise en forme des interfaces utilisateurs dans les maquettes."}, {"concept": {"id": "6d3fbeee-86a4-41d4-a9ad-e070ec9ee91d", "label": "Tailwind CSS", "definition": "Framework CSS utility-first qui facilite le développement rapide d'interfaces personnalisées grâce à une approche modulaire, permettant une personnalisation complète des styles et favorisant un design sur mesure avec une courbe d'apprentissage moyenne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": ["b675e32a-5667-419f-9ee6-b88fde7adf32"], "wikientity": {"label": "Tailwind CSS", "definition": "Tailwind CSS est un framework CSS open source. La fonctionnalité principale de cette bibliothèque est, contrairement à d'autres frameworks CSS comme Bootstrap, qu'elle ne procure pas une série de classes prédéfinies pour des éléments tels que des boutons ou des tables. À la place, Tailwind crée une liste de classes CSS « utilitaires » pouvant être utilisés pour ajouter un style à chaque élément en les mélangeant et en les agençant,.", "page_id": "15618742", "wikidata_id": "Q102173844", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Tailwind CSS facilite le design d'interfaces personnalisées et peut être très utile lors de la création de maquettes, rendant ce concept hautement pertinent."}, {"concept": {"id": "7f68a084-10a3-4266-90e0-653c0f007cfd", "label": "Design-first", "definition": "Approche de conception priorisant l'esthétique et l'expérience utilisateur dès le début du processus de développement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Design-first' souligne l'importance de l'esthétique dès le début du processus, ce qui est pertinent pour concevoir des maquettes attrayantes."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "'Image', bien qu'elle soit un élément graphique important, doit être intégrée dans une structure plus large lors de la conception d'une maquette."}, {"concept": {"id": "4a8b913d-0e2c-4a5d-95de-187630be097d", "label": "Figer le design", "definition": "Processus consistant à stabiliser l'architecture d'un module avant son développement complet, impactant la flexibilité future du code.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13611], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Figer le design' est pertinent car stabiliser une architecture avant son développement peut influencer positivement les maquettes créées par la suite."}, {"concept": {"id": "11723149-c36a-4793-bec4-052fc856d45b", "label": "Focus visible", "definition": "Le focus visible est un indicateur visuel qui montre quel élément d'une interface utilisateur ou d'une page web est actuellement sélectionné ou actif. Il représente l'état d'un élément qui reçoit l'attention de l'utilisateur, permettant ainsi l'interaction via dispositifs de pointage ou raccourcis clavier. Ce mécanisme est crucial pour les interactions clavier et l'accessibilité, car il aide les utilisateurs à comprendre facilement où se trouve leur attention dans l'interface, facilitant la navigation et l'interaction avec les éléments interactifs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["394b0a02-f858-421b-85a0-540ba39c364f", "71670944-41a5-4691-aaee-2bdeb718d6e7", "ffcaa1f6-724e-4337-99db-6d8a09701358"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le focus visible contribue à l'accessibilité et à l'interaction utilisateur dans les interfaces conçues, ce qui est pertinent pour les maquettes et leur mise en forme."}, {"concept": {"id": "fe3431e6-f552-40bf-9acf-a8dc64fff9bb", "label": "Couleur contiguë", "definition": "Couleur touchant directement une autre couleur dans un design graphique, importante pour le contraste et la lisibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La couleur contiguë joue un rôle important dans le design graphique et peut affecter directement l'esthétique d'une maquette."}, {"concept": {"id": "2172016e-bb68-48f3-9747-553c8e14c159", "label": "Réclamations", "definition": "Demandes formelles faites par les utilisateurs concernant l'accessibilité des services en ligne, permettant de signaler des problèmes ou des manquements.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les réclamations concernant l'accessibilité sont très pertinentes lors de la conception de maquettes, car elles doivent prendre en compte les besoins variés des utilisateurs pour garantir une expérience inclusive."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'<svg>' est pertinent car il permet d'intégrer des graphiques vectoriels dans les designs web, contribuant ainsi à l'aspect visuel des maquettes."}, {"concept": {"id": "ddbc052d-4bbb-4745-a0d3-13f5a0148583", "label": "MVC (Model-View-Controller)", "definition": "Modèle architectural séparant les données (Model), l'interface utilisateur (View) et la logique de contrôle (Controller), facilitant la maintenance et l'évolution des applications.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13624], "aliases": [], "wikientity": {"label": "Modèle-vue-contrôleur", "definition": "Modèle-vue-contrôleur ou MVC est un motif d'architecture logicielle destiné aux interfaces graphiques, lancé en 1978 et très populaire pour les applications web. Le motif est composé de trois types de modules ayant trois responsabilités différentes : les modèles, les vues et les contrôleurs.\n\nUn modèle (Model) contient les données à afficher ;\nUne vue (View) contient la présentation de l'interface graphique ;\nUn contrôleur (Controller) contient la logique concernant les actions effectuées par l'utilisateur.", "page_id": "196211", "wikidata_id": "Q44860", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le modèle MVC est essentiel pour structurer les applications web et peut influencer la manière dont les maquettes sont conçues et mises en œuvre, rendant ce concept assez pertinent."}, {"concept": {"id": "9f12dc58-55e6-4764-b5e1-ecd9e79fcfa9", "label": "Architecture logicielle", "definition": "Structure organisationnelle des systèmes logiciels, définissant les composants, leurs interactions et les principes de conception pour assurer une application efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13624], "aliases": [], "wikientity": {"label": "Architecture logicielle", "definition": "En informatique l’architecture logicielle décrit d’une manière symbolique et schématique les différents éléments d’un ou de plusieurs systèmes informatiques, leurs interrelations et leurs interactions. Contrairement aux spécifications produites par l’analyse fonctionnelle, le modèle d'architecture, produit lors de la phase de conception, ne décrit pas ce que doit réaliser un système informatique mais plutôt comment il doit être conçu de manière à répondre aux spécifications. L’analyse décrit le « quoi faire » alors que l’architecture décrit le « comment le faire ».", "page_id": "76855", "wikidata_id": "Q846636", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'architecture logicielle peut influencer la manière dont les maquettes sont conçues, bien qu'elle soit plus axée sur l'organisation du code que sur l'aspect visuel."}, {"concept": {"id": "04d75263-90f3-4c5f-afb0-72168b1d10dc", "label": "Mécanisme d'affichage", "definition": "Outils ou options permettant aux utilisateurs d'ajuster la présentation du contenu, notamment le contraste des couleurs sur les pages web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le mécanisme d'affichage est pertinent car il touche à l'aspect visuel et interactif des maquettes, essentiel pour une bonne présentation du contenu."}, {"concept": {"id": "3ed9d66a-d19e-424b-8675-069a1af427ae", "label": "Contenus additionnels", "definition": "Éléments d'interface ou informations supplémentaires qui apparaissent lors d'interactions comme le survol ou le focus, nécessitant un contrôle utilisateur pour éviter la confusion et assurer une accessibilité au clavier.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["9527d779-d294-49eb-9de5-87490800dada"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les contenus additionnels sont importants pour l'interaction utilisateur dans une interface et peuvent affecter comment une maquette est conçue pour être accessible et intuitive."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le format vectoriel est très pertinent car il est souvent utilisé dans la création de maquettes graphiques, permettant une mise à l'échelle sans perte de qualité, ce qui est essentiel pour le design."}], "exercises": [{"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension de l'importance de l'expérience utilisateur (UX) dans le processus de conception des maquettes, ce qui est un concept clé mentionné dans la référence. La question demande spécifiquement ce que doit prendre en compte le design pour être efficace, et la réponse correcte 'L'expérience utilisateur' reflète bien cette exigence. Les distracteurs proposés sont pertinents car ils représentent des aspects du design qui peuvent être confondus avec l'UX, mais ne répondent pas à la question centrale. Cependant, une légère amélioration pourrait consister à inclure une question supplémentaire sur d'autres éléments clés comme la simplicité ou la cohérence pour tester plus largement les connaissances de l'apprenant."}, {"exercise": {"id": "da35feb49e864dec9be4a552fb20bd03", "query": "Les wireframes servent de base aux web designers pour <blank>, tout en respectant les souhaits et contraintes validés par le client.", "answers": ["la conception des maquettes"], "distractors": [["la gestion du budget", "le développement des fonctionnalités", "la maintenance du site", "la création du contenu", "l'organisation des réunions", "l'élaboration de scripts"]], "feedback": "Les wireframes sont des schémas représentant la structure d'une page web. Ils guident les web designers dans la phase créative appelée 'conception des maquettes', qui consiste à traduire ces schémas en une interface visuelle définitive. Les autres options, comme la maintenance du site ou la gestion du budget, relèvent de processus différents qui n’interviennent pas directement dans cette phase.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice proposé évalue directement la compréhension du rôle des wireframes dans le processus de conception des maquettes, ce qui est un concept clé mentionné dans la référence. En demandant aux apprenants de compléter une phrase sur l'utilisation des wireframes, l'exercice teste leur capacité à relier cette technique essentielle à la création de maquettes tout en respectant les contraintes du client. Les distracteurs sont pertinents car ils représentent d'autres aspects du design et de la gestion de projet qui ne sont pas directement liés à la conception des maquettes, renforçant ainsi l'évaluation ciblée. Cependant, une note de 9 plutôt que 10 est attribuée car l'exercice pourrait être amélioré en incluant davantage d'éléments sur les interactions utilisateur ou les principes ergonomiques évoqués dans la synthèse."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue la compréhension du terme 'design' dans le contexte de la conception d'expérience utilisateur (UX), ce qui est un aspect clé de la référence. En demandant à l'apprenant de distinguer entre 'création visuelle' et 'conception', il teste leur capacité à saisir les nuances importantes liées à la maquette et à la mise en forme, notamment l'organisation des éléments pour optimiser l'interaction utilisateur. L'explication fournie renforce cette compréhension en clarifiant que le design va au-delà de l'esthétique visuelle, ce qui est essentiel dans le processus de création de maquettes. Cependant, une note parfaite n'est pas attribuée car l'exercice pourrait inclure des éléments supplémentaires sur d'autres concepts clés comme le wireframing ou l'éco-conception pour être encore plus complet."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension du concept de wireframing, qui est un élément clé dans la réalisation de maquettes et pré-maquettes. La question cible l'objectif principal du wireframe, ce qui est pertinent par rapport à la référence donnée sur la conception de maquettes. La réponse correcte souligne l'importance d'organiser les éléments sans se concentrer sur le design visuel final, ce qui reflète bien les principes abordés dans la synthèse concernant l'expérience utilisateur et la structure des interfaces. Cependant, une légère amélioration pourrait être apportée en intégrant davantage d'aspects liés à l'interaction utilisateur ou à l'éco-conception mentionnée dans la synthèse."}, {"exercise": {"id": "cfb5a24978ac4fb2bf3fa2db59ed0ebe", "question": "Quelle est l'utilité des wireframes dans le processus de création web?", "answers": ["Ils servent de base à la conception des maquettes web"], "distractors": ["Ils déterminent exclusivement les couleurs du site.", "Ils fournissent uniquement le texte du contenu.", "Ils remplacent les graphiques finaux sur le site.", "Ils sont créés en dernier après la conception graphique.", "Ils indiquent exactement où placer les images.", "Ils proposent les logos nécessaires pour le site web.", "Ils permettent d'ajuster uniquement la navigation visuelle.", "Ils représentent essentiellement l'esthétique finale du site.", "Ils s'occupent de la gestion du back-end du projet."], "feedback": "Les wireframes servent de base pour la conception des maquettes web en organisant les éléments et la navigation du site. Ils ne déterminent pas exclusivement l'esthétique finale du site, mais sont plutôt un guide pour respecter les fonctionnalités souhaitées par le client et le budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension de l'utilité des wireframes dans le processus de création web, ce qui est un concept clé mentionné dans la référence. Les wireframes sont essentiels pour clarifier la structure d'une interface et organiser les éléments, ce qui correspond à l'objectif de réaliser des maquettes et pré-maquettes. La question permet aux apprenants de démontrer leur connaissance sur un aspect fondamental du design UX, en lien avec la synthèse fournie. Cependant, une légère amélioration pourrait être apportée en incluant des questions supplémentaires sur d'autres aspects du design ou en demandant une explication plus détaillée sur l'importance des wireframes par rapport à d'autres éléments de conception."}, {"exercise": {"id": "d98bc70a159f4f99ada0181438d991b5", "query": "Le wireframe se concentre principalement sur <blank>, sans s'occuper de l'aspect visuel ou du graphisme.", "answers": ["l'organisation des éléments et des formes"], "distractors": [["la création des images et vidéos finales", "la mise en forme graphique", "la palette de couleurs et typographie", "la réalisation des animations interactives", "l'optimisation des performances", "le développement du code fonctionnel"]], "feedback": "La bonne réponse est 'l'organisation des éléments et des formes' car le wireframe a pour but de déterminer la disposition structurelle des blocs comme les textes, images, ou vidéos, tout en ne tenant pas compte des détails graphiques qui seront travaillés ultérieurement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice proposé évalue directement la compréhension du concept de wireframing, qui est un élément clé dans la réalisation de maquettes et pré-maquettes. En demandant à l'apprenant de compléter une phrase sur le rôle du wireframe, il teste sa connaissance sur l'organisation des éléments sans se concentrer sur les aspects visuels, ce qui est en adéquation avec les objectifs d'apprentissage mentionnés dans la référence. Les distracteurs sont également pertinents car ils représentent des concepts liés mais distincts, permettant ainsi de vérifier si l'apprenant distingue bien entre le wireframing et d'autres aspects du design. Cependant, pour obtenir un score parfait, l'exercice aurait pu inclure une dimension supplémentaire liée à l'interaction utilisateur ou à la simplicité dans le design."}, {"exercise": {"id": "a9e39306cb3b4f74b096fd9dd4b2697a", "statement": "Le wireframe consiste à définir l'organisation des éléments et des formes tout en travaillant l'aspect visuel.", "veracity": false, "feedback": "Le wireframe se concentre sur l'organisation des éléments comme les images, textes ou vidéos sans travailler l'aspect visuel. Le graphisme n'intervient qu'à une étape ultérieure du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un élément clé dans la réalisation de maquettes et pré-maquettes. La question teste la capacité de l'apprenant à distinguer entre l'organisation des éléments et le design graphique, ce qui est fondamental pour concevoir des interfaces intuitives. L'explication fournie renforce cette compréhension en clarifiant que le wireframe ne se concentre pas sur l'aspect visuel, mais sur la structure. Cependant, une légère amélioration pourrait être apportée en intégrant d'autres aspects mentionnés dans la synthèse, comme la simplicité ou la cohérence dans le design."}, {"exercise": {"id": "e846ef0159d94e02a46b826e22c81e6b", "question": "Pour améliorer la compréhension d'une interface, que faut-il respecter principalement ?", "answers": ["La hiérarchie visuelle et l'ordre de lecture de l'utilisateur"], "distractors": ["Les polices de caractères artistiques et les animations interactives.", "Les couleurs de fond claires avec des éléments graphiques complexes.", "L'intégration de plusieurs menus déroulants imbriqués.", "L'affichage direct de plusieurs options techniques avancées.", "La quantité maximale d'informations sur une seule ligne.", "L'utilisation d'icônes réduites pour chaque section.", "Le positionnement aléatoire des boutons d'action.", "L'ajout de contenu vidéo en arrière-plan.", "La mise en place d'un menu global en bas de page."], "feedback": "Pour améliorer la compréhension d'une interface, il est important de respecter la hiérarchie entre les éléments visuels et de suivre l'ordre de lecture de l'utilisateur. Cela permet une meilleure compréhension de l'action à effectuer et facilite ainsi son utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'interfaces, en se concentrant sur l'importance de la hiérarchie visuelle et de l'ordre de lecture pour améliorer l'expérience utilisateur. Ces éléments sont directement liés aux objectifs de réalisation de maquettes et à l'optimisation des interactions utilisateurs mentionnés dans la référence. Bien que les distracteurs soient variés et incluent des options qui ne respectent pas ces principes, le fait que la question cible spécifiquement un aspect fondamental du design UX montre une bonne pertinence par rapport à la référence. Une légère amélioration pourrait être apportée en intégrant davantage d'éléments spécifiques au processus de création de maquettes."}, {"exercise": {"id": "f73b609c41224a5eb611f366c35d9a2a", "question": "Quel critère doit être respecté pour rendre une application intuitive ?", "answers": ["Son fonctionnement doit être familier aux utilisateurs"], "distractors": ["Elle doit offrir de nombreuses options uniques d'interface", "Elle doit suivre les dernières tendances du marché", "Elle doit être visuellement impressionnante", "Sa conception doit ignorer les habitudes des utilisateurs", "Elle doit inclure toutes les fonctionnalités demandées par les développeurs", "Elle doit intégrer au moins deux modes de navigation", "Son design doit être avant-gardiste et innovant", "Son utilisation doit être complexe mais enrichissante", "Elle doit simuler des défis d’apprentissage pour les utilisateurs"], "feedback": "Respecter les habitudes des utilisateurs permet de rendre l'application intuitive car les utilisateurs seront familiers avec son fonctionnement et pourront l'utiliser facilement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un critère fondamental pour la conception d'une interface utilisateur intuitive, qui est essentiel dans le contexte de la réalisation de maquettes et de mises en forme. La réponse correcte souligne l'importance de la familiarité des utilisateurs avec le fonctionnement de l'application, ce qui est en adéquation avec les concepts abordés dans la synthèse, notamment l'optimisation des interactions et la prise en compte des comportements et préférences des usagers. Les distracteurs proposés sont également pertinents car ils représentent des idées fausses ou secondaires qui pourraient détourner l'attention du véritable objectif d'une interface intuitive. Cependant, une légère amélioration pourrait être apportée en intégrant davantage d'aspects liés à la simplicité et à la cohérence dans le design."}, {"exercise": {"id": "a979f369544e4c46b0a02f5ae402fb4c", "question": "Quelle implication découle de l'application de la loi de Fitts en matière d'interface ?", "answers": ["Les fonctions clés doivent être plus visibles pour l'utilisateur"], "distractors": ["Toutes les fonctions ont la même importance dans une interface", "Le nombre de boutons doit être réduit au minimum", "Le positionnement des fonctions n’impacte pas l’expérience utilisateur", "Seules les fonctions secondaires doivent être mises en avant", "Une interface doit limiter les interactions à deux clics maximum", "Un design fluide est plus important que la hiérarchie des fonctions", "Le choix des couleurs prime sur la taille des éléments", "Les fonctions non-essentielles doivent être masquées", "Le texte explicatif améliore toujours l'expérience utilisateur"], "feedback": "La loi de Fitts met en avant l'importance de rendre les fonctions clés plus visibles pour l'utilisateur en les représentant de manière plus impactante. Les distracteurs proposés sont soit inexistants, soit contradictoires avec cette implication.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de la loi de Fitts, qui est un concept pertinent dans le cadre de la conception d'interfaces utilisateur. En demandant aux apprenants d'identifier l'implication de cette loi, l'exercice teste leur capacité à relier des principes théoriques à des pratiques concrètes en matière de design UX. Bien que cela ne couvre pas directement tous les aspects mentionnés dans la référence sur la réalisation de maquettes et mise en forme, il reste très pertinent car il touche à l'optimisation des interactions utilisateurs, un élément clé du processus de création de maquettes. Cependant, une note plus élevée aurait été justifiée si l'exercice avait inclus des éléments spécifiques sur le wireframing ou la simplicité dans le design."}, {"exercise": {"id": "87c2b33f5503487ebf5bb50b8dbb6746", "question": "Quel concept permet à l'utilisateur de comprendre comment utiliser un objet avant utilisation ?", "answers": ["L'affordance offre une compréhension intuitive d'un objet avant son utilisation"], "distractors": ["L'utilisabilité repose sur la compréhension immédiate de l'objet", "Le feedback permet d’interagir avec l’objet après l’avoir utilisé", "L’ergonomie se focalise uniquement sur l'aspect esthétique de l'objet", "La signalisation guide l'utilisation mais implique une lecture préalable", "La redondance renforce l'accessibilité des objets via répétition", "La ludification transforme l’interaction en jeu pour meilleure accessibilité", "L'anthropomorphisme associe des caractéristiques humaines aux objets", "L'accessibilité concerne uniquement les personnes à mobilité réduite dans le design", "La modularité permet de personnaliser un objet selon les besoins spécifiques"], "feedback": "L'affordance est un concept qui permet à l'utilisateur de comprendre intuitivement comment utiliser un objet avant même de l'avoir utilisé. Cela se fait par le biais de signes et de stimuli visuels, tels que la forme d'un objet ou les actions qu'il inspire, qui suggèrent à l'utilisateur comment interagir avec l'objet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé en design UX, à savoir l'affordance, qui est essentiel pour réaliser des maquettes et optimiser l'expérience utilisateur. Bien que la question ne traite pas directement de la réalisation de maquettes ou de mise en forme, elle touche à un aspect fondamental du design d'interfaces : comment les utilisateurs perçoivent et interagissent avec les éléments graphiques. Cela s'inscrit dans le cadre plus large de la conception d'expérience utilisateur mentionnée dans la synthèse. Cependant, une connexion plus directe avec des aspects pratiques de la création de maquettes aurait pu renforcer encore davantage la pertinence de l'exercice."}, {"exercise": {"id": "a286d7d9d1844bed865e42b39a918f65", "statement": "Les wireframes valides sont immuables et ne peuvent en aucun cas être modifiés par les créatifs.", "veracity": false, "feedback": "Bien que les wireframes valides constituent la base du travail, ils ne sont pas immuables. Les web designers peuvent ajuster l'organisation des éléments et le système de navigation, tant qu'ils respectent les fonctionnalités validées par le client et restent dans les limites du budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des wireframes, qui sont un élément clé de la conception de maquettes mentionnée dans la référence. En posant une affirmation sur la nature immuable des wireframes, l'exercice teste la connaissance des apprenants sur le processus de création et d'ajustement des maquettes en fonction des besoins utilisateurs et des contraintes du projet. La réponse correcte souligne que les wireframes peuvent être modifiés, ce qui est en accord avec l'idée que la conception doit être itérative et adaptable. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à d'autres concepts abordés dans la synthèse, comme l'importance de l'expérience utilisateur ou de la cohérence dans le design."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface, en particulier l'importance de la visibilité des fonctions clés pour améliorer l'expérience utilisateur. Cela est directement lié à la référence qui mentionne la nécessité d'optimiser les interactions et de créer des interfaces intuitives. L'affirmation est pertinente car elle aborde un aspect fondamental du design UX, et l'explication fournie renforce cette pertinence en faisant référence à la loi de Fitts, qui est un concept clé dans le design d'interfaces. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la maquette et à la mise en forme, comme le wireframing ou la cohérence visuelle."}, {"exercise": {"id": "2e8282503d8d465cb75918606843cf30", "statement": "Un bouton d'appel à l'action trop grand peut nuire à la hiérarchie visuelle d'une mise en page.", "veracity": true, "feedback": "Un bouton trop grand peut effectivement perturber la composition visuelle et altérer la hiérarchie de la mise en page, ce qui rendrait l'interface utilisateur moins harmonieuse et ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la hiérarchie visuelle dans la conception d'interfaces, un concept clé mentionné dans la référence. En effet, le fait qu'un bouton d'appel à l'action trop grand puisse nuire à cette hiérarchie est pertinent pour réaliser une maquette efficace. L'explication fournie renforce cette idée en soulignant comment cela peut affecter l'ergonomie et l'harmonie de l'interface utilisateur. Cependant, bien que cela touche un aspect important du design UX, l'exercice pourrait être encore plus complet s'il abordait également d'autres éléments comme la cohérence ou le minimalisme fonctionnel."}, {"exercise": {"id": "a445f4b4019a4cff837aa3d8e9bba2c5", "statement": "Il n'est pas nécessaire de prendre en compte la personnalité du service lors de la création de CTA.", "veracity": false, "feedback": "Il est explicitement mentionné qu'il faut tenir compte de la personnalité que l'on souhaite transmettre via le produit ou service lorsqu'on décide du format de CTA à utiliser.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "adfd1b1bb75348adb19ed130d411fcb0", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut tout d'abord savoir qu'il existe différents types de CTA et qu'en fonction de l'importance que l'on souhaite donner à l'action, il faut choisir entre ces trois gabarits : Bien sûr il faut prendre en compte le type de service / produit et la personnalité qu'on souhaite transmettre mais c'est une donnée intéressante à garder en tête !", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "55f684c91106495595873b5ac0d2fdb1", "next_id": "f6522177a2774dce8b042a498e560196", "prev_id": "55f684c91106495595873b5ac0d2fdb1", "associated_block_ids": [], "first_page": 252, "last_page": 259, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la personnalité du service dans la création d'appels à l'action (CTA), ce qui est pertinent pour la conception de maquettes et d'interfaces utilisateur. Bien que l'exercice ne couvre pas directement tous les aspects mentionnés dans la référence, il touche un point clé lié à l'expérience utilisateur et à la conception centrée sur l'utilisateur. La capacité à intégrer des éléments comme la personnalité du service dans le design est essentielle pour réaliser une maquette efficace. Cependant, il aurait été bénéfique d'inclure des éléments plus larges sur le wireframing ou les principes de simplicité et de cohérence pour obtenir une note parfaite."}, {"exercise": {"id": "47cef18f7e6c47dcb2baaf060b4257b4", "statement": "L'affordance permet à l'utilisateur de comprendre comment utiliser un objet avant même qu'il n'ait besoin de l'essayer.", "veracity": true, "feedback": "C'est exact. L'affordance décrit la capacité d'un objet ou d'une interface à communiquer visuellement ou intuitivement comment elle doit être utilisée, sans que l'utilisateur ait besoin de tâtonner ou d'expérimenter auparavant.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'interfaces, à savoir l'affordance, qui est essentielle pour optimiser l'expérience utilisateur (UX). Bien que l'exercice ne traite pas directement de la réalisation de maquettes ou de leur mise en forme, il aborde un aspect fondamental du design UX qui influence la manière dont les maquettes sont conçues. La capacité d'une interface à communiquer son utilisation est cruciale pour créer des maquettes efficaces. Cependant, une note légèrement inférieure est attribuée car l'exercice pourrait être plus directement lié aux techniques spécifiques de wireframing ou aux éléments graphiques mentionnés dans la synthèse."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des concepts de clarté et de cohérence dans le design d'interface, qui sont des éléments clés mentionnés dans la référence. En affirmant que ces normes sont essentielles pour éviter de perdre l'utilisateur, l'exercice touche directement à l'objectif pédagogique de réaliser une maquette efficace en tenant compte des besoins utilisateurs. Cependant, il pourrait être amélioré en intégrant des aspects supplémentaires comme le wireframing ou l'éco-conception, ce qui lui empêche d'obtenir un score parfait."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le processus de conception, ce qui est un aspect clé mentionné dans la référence. L'affirmation souligne que le design doit inclure l'expérience utilisateur pour être efficace, ce qui est en accord avec les concepts abordés dans la synthèse, notamment l'optimisation des interactions et la collaboration entre designers UX et UI. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments plus spécifiques sur la réalisation de maquettes ou sur des techniques comme le wireframing, afin d'évaluer plus directement les compétences liées à la mise en forme et à la création de maquettes."}, {"exercise": {"id": "fcf86d429da24f679769741afa7e8165", "question": "À quoi sert principalement le zoning dans le processus de création d'une page web ?", "answers": ["À schématiser la disposition du contenu et des fonctionnalités"], "distractors": ["À détailler le design final de la page", "À définir la palette de couleurs utilisée", "À créer une carte des utilisateurs", "À programmer les différentes fonctionnalités", "À choisir les outils graphiques à utiliser", "À écrire le contenu de la page", "À optimiser le SEO de la page web", "À définir les standards de performance", "À tester la compatibilité sur différents navigateurs"], "feedback": "Le zoning sert principalement à schématiser la disposition du contenu et des fonctionnalités sur une page web, en utilisant des blocs pour représenter les différents éléments. Il intervient généralement après la création de l'arborescence, qui définit l'organisation globale du site, et permet ainsi de valider ou ajuster les grandes lignes avant de passer aux étapes suivantes de conception.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la création de maquettes, en l'occurrence le zoning, qui est essentiel pour schématiser la disposition du contenu et des fonctionnalités sur une page web. Cela s'inscrit parfaitement dans le contexte de la réalisation de maquettes et pré-maquettes mentionné dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments spécifiques à l'expérience utilisateur (UX) ou à l'interaction entre les designers UX et UI, ce qui lui aurait permis d'obtenir une note plus élevée."}, {"exercise": {"id": "df6d8e1ef0c24891972ea92c71fd1f92", "statement": "Le contenu utilisé dans le wireframe peut être fictif si les informations finales ne sont pas encore disponibles.", "veracity": true, "feedback": "Il est mentionné que les informations finales ne sont pas toujours connues à ce stade du projet, donc un contenu fictif peut être utilisé pour organiser le wireframe.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un élément clé dans la réalisation de maquettes et pré-maquettes. En demandant à l'apprenant d'évaluer la véracité d'une affirmation sur l'utilisation de contenu fictif dans un wireframe, il teste sa capacité à appliquer les connaissances acquises sur le processus de conception UX. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des questions supplémentaires qui explorent d'autres aspects mentionnés dans la synthèse, comme la simplicité du design ou l'importance de la cohérence. Cela permettrait une évaluation plus complète des compétences liées à la réalisation de maquettes."}, {"exercise": {"id": "63fc6d6be00f486fbc566c553cd77f02", "statement": "Les sites Web minimalistes font souvent usage de typographies complexes et d'une large variété de styles de caractères.", "veracity": false, "feedback": "Les sites Web minimalistes utilisent généralement une typographie simple et une gamme limitée de styles de caractères pour offrir une expérience épurée. L’objectif est de favoriser la lisibilité et éliminer les distractions inutiles, en cohérence avec le principe de réduction des détails.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de design minimaliste, qui est un aspect clé de la réalisation de maquettes et de mise en forme. En demandant à l'apprenant d'identifier la véracité d'une affirmation sur les sites Web minimalistes, il teste leur connaissance des éléments essentiels du design UX, notamment la simplicité et la lisibilité. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des questions plus directement liées à la création de maquettes ou à l'utilisation spécifique d'outils comme le wireframing. Cela aurait permis une évaluation encore plus ciblée sur les compétences pratiques nécessaires pour réaliser une maquette efficace."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'étude des usagers dans le cadre d'un référentiel ergonomique, ce qui est un concept clé dans la conception de maquettes et d'interfaces utilisateur. La référence mentionne explicitement l'optimisation des interactions entre les utilisateurs et les produits numériques, ce qui implique une connaissance approfondie des besoins et comportements des usagers. Bien que la question ne couvre pas tous les aspects liés à la réalisation de maquettes (comme le wireframing ou la simplicité du design), elle reste pertinente car elle touche à un élément fondamental pour concevoir des interfaces efficaces. Cependant, une note légèrement inférieure à 10 est attribuée car l'exercice pourrait être plus directement lié aux techniques spécifiques de création de maquettes."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des éléments ergonomiques dans la conception de maquettes, ce qui est un aspect clé de la référence. En effet, l'affirmation souligne que les choix d'éléments doivent être basés sur une étude des usagers, ce qui est en ligne avec le concept de conception centrée sur l'utilisateur abordé dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des questions plus variées ou en demandant des exemples concrets d'éléments ergonomiques pour tester davantage la maîtrise du sujet."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface, en particulier l'importance de la cohérence et du respect des normes de référence pour éviter de perdre l'utilisateur. Cela est directement lié à la réalisation de maquettes et à la mise en forme, comme mentionné dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments plus spécifiques sur le wireframing ou les techniques de design UX abordées dans la synthèse. Néanmoins, il teste efficacement un aspect clé du sujet."}, {"exercise": {"id": "27f72194fe76474eb0a9bbbd1d1a154a", "question": "Quelle option permet d'adapter un site à toutes les tailles d'écran mobile ?", "answers": ["Le site responsive design permet cette adaptation"], "distractors": ["Un site minimaliste conçu uniquement pour ordinateur.", "La personnalisation des menus déroulants fixes.", "Un site avec des images haute résolution spécifiques.", "La réduction de la taille des polices manuellement.", "L'ajout de sections cachées non visibles sur mobile.", "L'activation d'un mode hors ligne universel.", "L'optimisation des vidéos HD pour tablette.", "Une application dédiée à chaque utilisateur mobile.", "La modification aléatoire des couleurs d'arrière-plan."], "feedback": "Le site responsive design est une option qui permet de créer un site web adapté à toutes les tailles d'écran mobile. Il s'agit d'un design flexible qui s'ajuste automatiquement à la taille de l'écran sans nécessiter une gestion manuelle des éléments. Cela garantit une expérience utilisateur optimale sur tous les types d'appareils mobiles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un aspect clé de la référence concernant la réalisation de maquettes et la mise en forme. La question cible directement une compétence essentielle pour concevoir des interfaces adaptées aux utilisateurs sur différents appareils, ce qui est fondamental dans le contexte de l'expérience utilisateur (UX). Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant d'autres éléments liés à la conception de maquettes ou à l'interaction utilisateur, afin d'évaluer plus largement les compétences couvertes par la référence."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance du responsive design, qui est un aspect clé de la réalisation de maquettes et de mises en forme adaptées aux différents appareils. En demandant à l'apprenant de compléter une phrase sur les conséquences d'une mauvaise adaptation du contenu, il teste leur capacité à relier le concept de responsive design à l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects mentionnés dans la synthèse, comme la simplicité ou la cohérence dans le design."}, {"exercise": {"id": "046002d154f54faba26d356d715ab78c", "query": "Pour offrir une bonne expérience utilisateur sur mobile, il est important d'adapter l'interface de votre site à la taille de l'écran, ce qui peut être réalisé grâce à un site <blank>.", "answers": ["responsive design"], "distractors": [["statique", "interactif", "multi-plateforme", "dynamique", "minimaliste", "augmenté"]], "feedback": "Le terme 'responsive design' fait référence à une technique de conception qui ajuste automatiquement l'affichage du site en fonction de la taille et la résolution de l'écran utilisé. Cela permet aux utilisateurs de smartphone ou tablette d'avoir une meilleure expérience sans avoir à zoomer ou faire défiler horizontalement. Contrairement aux autres options proposées, seule cette approche vise spécifiquement à adapter l'affichage à différents appareils de manière fluide.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un aspect clé de la conception d'expérience utilisateur (UX) mentionné dans la référence. Il teste la capacité de l'apprenant à identifier une technique essentielle pour optimiser l'interface en fonction des comportements et préférences des utilisateurs sur différents appareils. Cependant, bien que pertinent, l'exercice se concentre uniquement sur un élément spécifique du processus de création de maquettes et ne couvre pas d'autres aspects importants tels que le wireframing ou la simplicité dans le design. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "053de79d8f01448d8c9ae2f115f8abaf", "statement": "Les pages Responsive ne fonctionnent correctement que lorsque leur largeur est entre 400 et 4000 pixels.", "veracity": false, "feedback": "Le concept de 'Responsive' signifie que les pages Web s'adaptent automatiquement à la taille de la fenêtre du navigateur, quelle que soit la largeur (que ce soit moins de 400 pixels ou plus de 4000 pixels). Cela permet au contenu de rester flexible et lisible peu importe la dimension de l'écran.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c8c9fd5c615d4aeb89687638c827428e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Amazon a commencé à vendre des livres en ligne. Se concentrer sur les livres à un prix bas en 1994 avec une conception Web simpliste a suffi à l'entreprise pour se développer et se diversifier. Les pages qui sont à 100% Responsive s'adaptent à la taille de la fenêtre de navigateur. Peu importe que la largeur soit de 400 pixels ou 4000pixels. Des contenus, comme par exemple des images ou des textes, s'intègrent simplement et de manière flexible selon la grandeur de l'écran respectif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "b7e9e4bbcc3540a78cb7b632d44e7ab9", "next_id": "47662b070fa14ac3b3344aab7550d2e6", "prev_id": "b84de263ccd2406f97694b0dd7e6441c", "associated_block_ids": [], "first_page": 189, "last_page": 194, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un aspect clé de la référence concernant la réalisation de maquettes et la mise en forme. En testant la véracité d'une affirmation sur le responsive design, l'exercice permet d'apprécier si l'apprenant saisit bien que ce type de design s'adapte à toutes les tailles d'écran, ce qui est essentiel pour optimiser l'expérience utilisateur. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects mentionnés dans la synthèse, tels que le wireframing ou l'importance de la simplicité et de la cohérence dans le design. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "cc8ce2b19f52403790617b85986c9f73", "statement": "Un site responsive design s'adapte à la taille de la fenêtre du navigateur pour offrir une meilleure expérience utilisateur sur mobile.", "veracity": true, "feedback": "Un site responsive design ajuste automatiquement son affichage en fonction de la taille de la fenêtre du navigateur, ce qui garantit une expérience optimisée quel que soit l'appareil utilisé, que ce soit un smartphone ou tout autre appareil.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de responsive design, qui est un aspect clé de la réalisation de maquettes et de mises en forme dans le contexte de l'expérience utilisateur (UX). La question teste la capacité à reconnaître comment un site responsive améliore l'interaction utilisateur sur différents appareils, ce qui est pertinent pour concevoir des maquettes efficaces. Cependant, bien que cela soit important, l'exercice ne couvre pas d'autres éléments essentiels mentionnés dans la synthèse, tels que le wireframing ou la simplicité dans le design. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "13247fe064be47ff9a12fc3711eb01ec", "query": "Il est recommandé de limiter le nombre d'options dans un menu de navigation à <blank> pour faciliter la compréhension par l'utilisateur.", "answers": ["7"], "distractors": [["5", "10", "15", "20", "3", "12"]], "feedback": "Le cerveau humain a une capacité limitée à traiter simultanément plusieurs informations, et il est recommandé de limiter le nombre d'options de navigation à 7 au maximum pour réduire la surcharge cognitive. Choisir un nombre plus élevé comme 10 ou 15 compliquerait l'assimilation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5dbc8b0bd3404789aa35b91256382f16", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "En web, on proclame que 20% du contenu permet de satisfaire 80% des recherches. Ce qui revient à dire qu'une « bonne » architecture doit servir en priorité « seulement » 20% des contenus les plus importants quitte à éventuellement délaisser le reste. Le cerveau humain étant limité dans sa capacité à traiter l'information, celui-ci aborde la complexité en traitant l'information par blocs. Ce fait est souvent utilisé comme un argument pour limiter le nombre d'options de navigation d'un menu à 7 maximum.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d7449175be5f4d5abb6a02e0a986fa0e", "next_id": "786f9d6e532046c6a6395a4085cce92f", "prev_id": "49495f581f1a4c16a156717fde22db5e", "associated_block_ids": [], "first_page": 12, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un principe clé de la conception d'expérience utilisateur (UX), à savoir la limitation du nombre d'options dans un menu de navigation pour éviter la surcharge cognitive. Cela est directement lié à l'objectif de réaliser des maquettes et mises en forme efficaces, car une bonne navigation est essentielle pour optimiser l'interaction utilisateur. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects mentionnés dans la synthèse, comme le wireframing ou l'éco-conception, ce qui empêche une note parfaite."}, {"exercise": {"id": "37e722b43c2447cea81131e2194b84bb", "statement": "Le cerveau humain peut traiter simultanément un grand nombre d'options dans un menu, c'est pourquoi il est recommandé d'avoir plus de 10 options de navigation.", "veracity": false, "feedback": "C'est inexact. En réalité, le cerveau humain a une capacité limitée à traiter l'information, ce qui justifie la recommandation de limiter le nombre d'options de navigation à 7 ou moins. Cette limite permet au cerveau de mieux appréhender la complexité tout en facilitant la prise de décision pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5dbc8b0bd3404789aa35b91256382f16", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "En web, on proclame que 20% du contenu permet de satisfaire 80% des recherches. Ce qui revient à dire qu'une « bonne » architecture doit servir en priorité « seulement » 20% des contenus les plus importants quitte à éventuellement délaisser le reste. Le cerveau humain étant limité dans sa capacité à traiter l'information, celui-ci aborde la complexité en traitant l'information par blocs. Ce fait est souvent utilisé comme un argument pour limiter le nombre d'options de navigation d'un menu à 7 maximum.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d7449175be5f4d5abb6a02e0a986fa0e", "next_id": "786f9d6e532046c6a6395a4085cce92f", "prev_id": "49495f581f1a4c16a156717fde22db5e", "associated_block_ids": [], "first_page": 12, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interfaces, en particulier en ce qui concerne la gestion de la complexité et l'utilisabilité. La question sur le nombre d'options dans un menu touche directement à l'expérience utilisateur (UX) et à la nécessité de simplifier les choix pour améliorer la navigation. Bien que l'exercice ne couvre pas tous les aspects de la réalisation de maquettes, il aborde un concept clé lié à l'optimisation des interactions utilisateurs, ce qui le rend pertinent par rapport à la référence."}, {"exercise": {"id": "61f1c0b8a36c429c8447c37deec46a19", "question": "Comment doit être organisée la relation entre une étiquette et son champ associé ?", "answers": ["Ils doivent être visuellement proches pour éviter toute confusion"], "distractors": ["Ils doivent apparaître sur des lignes différentes séparées", "Ils doivent avoir des couleurs fortement contrastées", "Ils doivent être dans des blocs distincts", "Ils doivent être placés dans le pied de page", "Ils doivent être interactifs et cliquables", "Ils doivent avoir un lien réciproque avec le champ", "Ils doivent être centrés sur la page", "Ils doivent inclure un numéro identifiant commun", "Ils doivent s'afficher uniquement au survol du curseur"], "feedback": "En plaçant visuellement l'étiquette et son champ associé proches l'un de l'autre, il est plus facile pour les utilisateurs de comprendre quelle étiquette correspond à quel champ et évite ainsi toute confusion.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'organisation visuelle des éléments d'interface, ce qui est un aspect clé de la conception de maquettes et de l'expérience utilisateur (UX). La question porte sur la relation entre une étiquette et son champ associé, ce qui est pertinent pour assurer une interface intuitive et cohérente. La réponse correcte souligne l'importance de la proximité visuelle pour éviter la confusion, ce qui reflète bien les principes d'utilisabilité mentionnés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à d'autres concepts abordés dans le corpus, comme le minimalisme fonctionnel ou le responsive design."}, {"exercise": {"id": "9a099c489b864346b9811c59dacad8ce", "question": "Comment améliorer la navigation en renseignant la position de l'utilisateur ?", "answers": ["Utiliser un fil d'Ariane pour indiquer la localisation de l'internaute"], "distractors": ["Créer des raccourcis clavier personnalisés pour chaque page", "Ajouter un message popup à chaque étape", "Utiliser uniquement des icônes pour naviguer", "Insérer un message texte fixe sur chaque page", "Limiter la navigation à un seul niveau de profondeur", "Ajouter des numéros de page en haut de chaque section", "Utiliser une animation de défilement pour chaque changement de page", "Modifier la couleur du fond selon la section", "Intégrer des éléments visuels encombrants pour attirer l'attention"], "feedback": "Utiliser un fil d'Ariane pour indiquer la localisation de l'internaute permet à l'utilisateur de savoir où il se trouve dans la navigation et de revenir facilement en arrière s'il le souhaite. Cela facilite également la compréhension de la structure du site pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception d'expérience utilisateur (UX), à savoir l'amélioration de la navigation. La question cible spécifiquement comment renseigner la position de l'utilisateur, ce qui est pertinent dans le contexte de la réalisation de maquettes et de mise en forme. La réponse correcte, qui consiste à utiliser un fil d'Ariane, est une méthode reconnue pour améliorer la navigation et correspond bien aux principes d'ergonomie et de clarté mentionnés dans la synthèse. Cependant, l'exercice pourrait être renforcé en intégrant des éléments supplémentaires sur les autres aspects du design UX abordés dans la synthèse, comme le wireframing ou l'éco-conception."}, {"exercise": {"id": "e6abe4b7c1c049b39f395ba056388e95", "question": "Quelle stratégie est recommandée pour l'architecture de menu ?", "answers": ["Favoriser la largeur plutôt que la profondeur du menu"], "distractors": ["Rendre les menus aussi profonds que possible", "Utiliser une seule icône pour chaque menu", "Limiter le nombre d’options visibles à l’écran", "Toujours placer les options populaires en bas du menu", "Privilégier une navigation en profondeur, de multiple niveaux", "Utiliser au maximum des sous-catégories", "Créer des menus très textuels avec de nombreux détails sur chaque option", "Réduire la largeur du menu à un minimum", "Séparer les menus en plusieurs sections indépendantes"], "feedback": "Il est recommandé de favoriser une largeur plutôt qu'une profondeur importante dans l'architecture des menus pour faciliter la navigation. En proposant plus d'options visibles à l'écran, cela permet à l'utilisateur de trouver plus facilement ce qu'il cherche sans être perdu dans un menu trop profond.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'une stratégie clé dans la conception d'interfaces utilisateur, en particulier concernant l'architecture des menus. La question posée est pertinente car elle touche à l'un des aspects fondamentaux de la conception UX mentionnés dans la synthèse : l'optimisation de l'expérience utilisateur par une navigation intuitive. Favoriser la largeur du menu plutôt que sa profondeur est effectivement une recommandation courante pour améliorer la clarté et l'utilisabilité des interfaces. Cependant, bien que cela soit pertinent, l'exercice pourrait être encore plus directement lié à d'autres concepts clés tels que le wireframing ou les principes de simplicité et de cohérence dans le design. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "d54493bfc49e475391dfb249fb95159f", "statement": "Il est recommandé d'organiser les menus en profondeur plutôt qu'en largeur.", "veracity": false, "feedback": "La recommandation est de privilégier une architecture de menu large plutôt que profonde. Une organisation trop profonde allonge les parcours de navigation, tandis qu'une structuration large permet d'accéder plus rapidement aux informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interfaces, en particulier en ce qui concerne l'organisation des menus, qui est un aspect clé de la création de maquettes. La référence mentionne l'importance de la simplicité et de la cohérence dans le design, et cet exercice teste directement ces concepts en abordant l'architecture des menus. Cependant, il pourrait être amélioré en intégrant davantage d'éléments liés à la conception UX globale ou à d'autres aspects mentionnés dans la synthèse, comme le wireframing ou l'éco-conception. Néanmoins, il reste pertinent pour tester une compétence essentielle liée à la mise en forme des maquettes."}, {"exercise": {"id": "4570d883513647c595941a5d33546fc8", "question": "Pourquoi est-il risqué de réinventer une icône connue par les utilisateurs ?", "answers": ["Cela peut désorienter l'utilisateur et nuire à son expérience"], "distractors": ["Cela permet d'améliorer l'expérience utilisateur immédiatement.", "Cela rend l'interface plus créative et intuitive.", "Cela aide l'utilisateur à mieux comprendre les nouvelles fonctionnalités.", "Cela garantit une meilleure interaction avec la technologie.", "Cela simplifie l'utilisation des options avancées pour les experts.", "Cela permet de se différencier de la concurrence.", "Cela assure une compatibilité optimale avec toutes les interfaces existantes.", "Cela accroît la flexibilité de conception dans les interfaces complexes.", "Cela améliore la lisibilité générale des informations présentées à l'écran."], "feedback": "Les icônes familières sont facilement reconnaissables par les utilisateurs et leur permettent de comprendre rapidement comment utiliser une fonctionnalité sans avoir à apprendre de nouvelles représentations visuelles. Modifier une icône peut donc désorienter l'utilisateur et nuire à son expérience.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des icônes familières dans le design d'interfaces, ce qui est pertinent pour la réalisation de maquettes et la mise en forme. La question aborde directement les risques associés à la réinvention d'icônes connues, ce qui touche aux concepts de simplicité et de cohérence dans le design UX mentionnés dans la synthèse. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant des éléments plus spécifiques sur le processus de création de maquettes ou sur les techniques comme le wireframing. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "870f44252b3f466d91e4ffa414b5cdbe", "query": "La hiérarchie des éléments d'une interface guide l'utilisateur dans sa navigation. Il commence par lire le contenu, puis, s'il le juge nécessaire, effectue une action pour laquelle il devra trouver <blank>.", "answers": ["un call to action"], "distractors": [["un formulaire de contact", "une barre de recherche", "un menu déroulant", "une notification", "un footer", "une suggestion d'article"]], "feedback": "Le 'call to action' est une incitation à accomplir une action particulière, par exemple cliquer sur un bouton ou remplir un formulaire. C'est l'élément que l'utilisateur doit trouver après avoir parcouru le contenu, lorsqu'il décide d'interagir avec l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension de la hiérarchie des éléments d'une interface, ce qui est pertinent pour la réalisation de maquettes et la mise en forme. En effet, comprendre comment les utilisateurs naviguent dans une interface et où ils doivent trouver des éléments clés comme un 'call to action' est essentiel pour concevoir des maquettes efficaces. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la conception UX mentionnés dans la synthèse, tels que l'importance de la simplicité ou de la cohérence dans le design. Néanmoins, il teste bien un concept clé lié à l'objectif pédagogique."}, {"exercise": {"id": "2f9b8c77092542f7b1b9ff425a63a1c1", "statement": "La hiérarchie entre les éléments d'une interface aide à mieux comprendre les actions à réaliser.", "veracity": true, "feedback": "Il est exact que la hiérarchie entre les différents éléments permet une meilleure compréhension des actions à entreprendre. Cette organisation guide l'utilisateur dans son parcours, rendant l'expérience plus fluide et intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de maquettes, à savoir l'importance de la hiérarchie des éléments dans une interface utilisateur. Cette notion est essentielle pour réaliser des maquettes efficaces qui optimisent l'expérience utilisateur, comme mentionné dans la synthèse. L'affirmation et son explication soulignent comment une bonne organisation des éléments aide les utilisateurs à naviguer plus facilement, ce qui est en accord avec les objectifs d'apprentissage liés à la réalisation de maquettes. Cependant, l'exercice pourrait être amélioré en intégrant des aspects supplémentaires tels que le wireframing ou la cohérence visuelle, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "5e5e624e0c9749189df302e3a469edd0", "statement": "Une application intuitive fonctionne de manière proche des habitudes déjà acquises par les utilisateurs.", "veracity": true, "feedback": "L'énoncé est correct car il est recommandé de concevoir une application qui se rapproche du mode de fonctionnement auquel les utilisateurs sont déjà habitués, pour éviter des difficultés inutiles dans l'utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un principe clé de la conception UX, à savoir l'importance de créer des interfaces intuitives qui s'alignent sur les habitudes des utilisateurs. Cela est en lien direct avec la référence qui mentionne la nécessité d'optimiser les interactions entre les utilisateurs et les produits numériques. Cependant, bien que pertinent, l'exercice ne couvre pas directement tous les aspects de la réalisation de maquettes et de mise en forme, comme le wireframing ou l'utilisation d'éléments graphiques. Il aurait pu être amélioré en intégrant des éléments spécifiques à la création de maquettes pour obtenir une note plus élevée."}, {"exercise": {"id": "5c99b0872ad447488fc21208ec035890", "statement": "La constance dans l'utilisation d'icônes universelles permet d'améliorer l'intuitivité d'une interface.", "veracity": true, "feedback": "L'emploi d'icônes avec une signification établie, connue des utilisateurs, permet de maintenir une interface intuitive. Cela évite de réinventer sans raison des éléments qui ont déjà fait leurs preuves dans la compréhension utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la cohérence et de l'intuitivité dans le design d'interfaces, qui sont des concepts clés mentionnés dans la référence. L'affirmation sur l'utilisation d'icônes universelles est pertinente car elle touche à la manière dont les éléments graphiques peuvent améliorer l'expérience utilisateur. Cependant, bien que cela soit un aspect important, l'exercice pourrait être renforcé en incluant des questions sur d'autres éléments comme le wireframing ou la simplicité du design, pour couvrir plus largement les différents aspects abordés dans la synthèse."}, {"exercise": {"id": "f7db6816b25d40e7b88284be2d31d0ac", "statement": "Les utilisateurs préfèrent des icônes nouvelles et originales plutôt que celles établies pour mieux comprendre leur fonction.", "veracity": false, "feedback": "Au contraire, il est mentionné que les icônes ayant une signification établie sont déjà connues des utilisateurs et qu'il est risqué d'en créer de nouvelles. Le changement pourrait rendre l'interface moins intuitive et désorienter les utilisateurs, ce qui est à éviter pour ne pas les faire fuir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface utilisateur, en particulier l'importance de la cohérence et de l'intuitivité dans le design. La question sur les icônes établies versus nouvelles touche directement à la nécessité d'utiliser des éléments graphiques familiers pour améliorer l'expérience utilisateur, ce qui est un concept clé dans la référence. Cependant, bien que pertinent, l'exercice pourrait être enrichi par des questions supplémentaires portant sur d'autres aspects mentionnés dans la synthèse, comme le wireframing ou l'éco-conception, pour obtenir une évaluation plus complète des compétences liées à la réalisation de maquettes."}, {"exercise": {"id": "d4e9ab91b0d543e59d4284af6b4ebc5f", "question": "Pourquoi la taille de l'écran mobile peut poser problème lors de la conception ?", "answers": ["La taille restreinte complique la créativité et le webdesign"], "distractors": ["Les smartphones n'ont pas assez de performances pour un bon design.", "Les sites mobiles ne peuvent pas contenir de contenu multimédia.", "La navigation mobile impose toujours deux mains pour interagir.", "L'amélioration des visuels pour mobile est plus simple qu'avec un ordinateur.", "La taille d’écran mobile améliore toujours l'expérience utilisateur.", "Les écrans de téléphone n'affichent pas les images en haute qualité.", "Le responsive design supprime tout besoin de réflexion créative.", "Les couleurs doivent changer entre les versions mobile et desktop.", "Toutes les interfaces mobiles doivent être monochromes pour optimiser le design."], "feedback": "La taille de l'écran d'un terminal mobile peut poser problème pour les créateurs de sites web, car cela limite leur capacité à être créatif et à concevoir des designs complexes et esthétiques. La limitation de l'espace sur un petit écran peut également poser des problèmes pour l'optimisation de la navigation et de l'expérience utilisateur globale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect pertinent de la conception de maquettes, en se concentrant sur les défis posés par la taille des écrans mobiles. Cela est directement lié à l'objectif de réaliser des maquettes et à la nécessité d'optimiser l'expérience utilisateur (UX) dans le contexte du responsive design. Cependant, bien que la question soit pertinente, elle ne couvre pas entièrement tous les éléments clés mentionnés dans la synthèse, tels que l'importance de la simplicité, de la cohérence ou des composants d'interface. L'exercice pourrait être amélioré en intégrant des questions qui évaluent également ces autres aspects essentiels du design UX."}, {"exercise": {"id": "b53e075a8c0d4892899e64c22caa14d1", "question": "Que signifie le fait que des pages soient 100% Responsive ?", "answers": ["Elles s'adaptent à la taille de la fenêtre du navigateur"], "distractors": ["Elles intègrent automatiquement des réseaux sociaux", "Elles augmentent la vitesse du site web", "Elles réduisent la consommation de bande passante", "Elles adaptent les langues automatiquement", "Elles corrigent les erreurs de serveur en temps réel", "Elles empêchent les pop-ups publicitaires", "Elles optimisent les vidéos haute définition", "Elles compressent toutes les images", "Elles améliorent le référencement en ligne"], "feedback": "La bonne réponse est que les pages s'adaptent à la taille de la fenêtre du navigateur, car cela signifie qu'elles sont conçues pour être consultées sur tous les types d'écrans, offrant ainsi une expérience utilisateur optimale et un meilleur référencement en ligne.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c8c9fd5c615d4aeb89687638c827428e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Amazon a commencé à vendre des livres en ligne. Se concentrer sur les livres à un prix bas en 1994 avec une conception Web simpliste a suffi à l'entreprise pour se développer et se diversifier. Les pages qui sont à 100% Responsive s'adaptent à la taille de la fenêtre de navigateur. Peu importe que la largeur soit de 400 pixels ou 4000pixels. Des contenus, comme par exemple des images ou des textes, s'intègrent simplement et de manière flexible selon la grandeur de l'écran respectif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "b7e9e4bbcc3540a78cb7b632d44e7ab9", "next_id": "47662b070fa14ac3b3344aab7550d2e6", "prev_id": "b84de263ccd2406f97694b0dd7e6441c", "associated_block_ids": [], "first_page": 189, "last_page": 194, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension du concept de responsive design, qui est un aspect clé de la réalisation de maquettes et de mises en forme dans le contexte de l'expérience utilisateur. La question cible directement la capacité à identifier ce qu'implique une page web responsive, ce qui est pertinent pour concevoir des interfaces adaptées aux utilisateurs. Cependant, bien que cela soit important, l'exercice ne couvre pas d'autres éléments cruciaux mentionnés dans la synthèse, tels que le wireframing ou l'importance de la simplicité et de la cohérence dans le design. Par conséquent, bien qu'il soit pertinent, il n'évalue pas entièrement tous les aspects essentiels liés à la référence."}, {"exercise": {"id": "a7a4e17d20c843f0bc5686d8e5efabf2", "statement": "La taille réduite de l'écran sur un terminal mobile peut poser des défis en termes de créativité et de conception web.", "veracity": true, "feedback": "Effectivement, la taille réduite de l'écran sur un appareil mobile rend la conception plus difficile en raison de contraintes créatives et en termes de webdesign, comparativement à des écrans plus grands.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect important de la conception de maquettes, à savoir les défis posés par la taille réduite des écrans sur les appareils mobiles. Cela est pertinent dans le contexte de la réalisation de maquettes et de mise en forme, car il souligne l'importance du responsive design, qui est mentionné dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à la création de maquettes ou au processus UX/UI, comme des questions sur le wireframing ou l'ergonomie. Néanmoins, il teste une compréhension essentielle des contraintes liées à la conception pour différents formats d'écran."}, {"exercise": {"id": "daff570ba9ce48f8817243015706c164", "query": "Pour une navigation optimale, il est conseillé de prioriser la largeur plutôt que <blank> dans l'architecture d'un menu.", "answers": ["la profondeur"], "distractors": [["l'hauteur", "la simplicité", "la vitesse", "l'élégance", "la cohérence", "la longueur"]], "feedback": "Prioriser la largeur signifie qu'il est préférable d'avoir plus de choix disponibles dès le premier niveau de navigation (largeur) plutôt que plusieurs sous-niveaux de menus qui augmenteraient la complexité et rendraient la navigation plus difficile (profondeur).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à l'architecture de l'information dans la conception de maquettes, en particulier la notion de largeur versus profondeur dans les menus. Cela est pertinent pour le contexte de réalisation de maquettes et mise en forme, car une navigation optimale est essentielle pour améliorer l'expérience utilisateur. Cependant, bien que cela touche un aspect important du design UX, l'exercice pourrait être plus complet en intégrant d'autres éléments mentionnés dans la synthèse, comme la simplicité ou la cohérence. Il ne couvre pas tous les aspects fondamentaux du processus de création de maquettes mais reste pertinent."}, {"exercise": {"id": "76bdc1cfb02b421aa9ebecc7377c69b5", "query": "Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que <blank>.", "answers": ["vos utilisateurs ont l'habitude de côtoyer"], "distractors": [["les tendances du marché exigent", "les concepteurs jugent innovant", "vous voulez proposer", "la concurrence met en avant", "les experts considèrent optimal", "les nouveaux standards recommandent"]], "feedback": "L'application doit fonctionner en s'appuyant sur ce que les utilisateurs connaissent déjà ou ont l'habitude d'utiliser. Cela rend l'expérience plus fluide et intuitive, évitant des frustrations liées à un trop grand changement ou à des nouveautés inutiles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé évalue la compréhension de l'importance d'adapter une application aux habitudes des utilisateurs, ce qui est en lien avec le concept de conception centrée sur l'utilisateur abordé dans la référence. Cependant, il ne couvre pas directement les aspects techniques de la réalisation de maquettes ou de wireframing mentionnés dans la synthèse. Bien qu'il soit pertinent pour tester une partie des compétences liées à l'expérience utilisateur, il pourrait être amélioré en intégrant des éléments plus spécifiques à la création et à la mise en forme des maquettes."}, {"exercise": {"id": "315cfc8b0c0a4c239408287509fd82a3", "statement": "L'ajout d'animations est utilisé uniquement pour rendre un site plus esthétique, sans impact sur l'expérience utilisateur.", "veracity": false, "feedback": "Bien que l'ajout d'animations puisse contribuer à l'esthétique d’un site Web, il ne se limite pas à cela. Les animations jouent également un rôle dans l'expérience utilisateur, en influençant potentiellement les émotions et les perceptions des utilisateurs dans les zones de conflit mentionnées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension de l'impact des éléments graphiques, comme les animations, sur l'expérience utilisateur, ce qui est pertinent pour le sujet de la maquette et de la mise en forme. Cependant, il ne couvre pas directement d'autres aspects clés tels que le wireframing ou la simplicité dans le design. Bien qu'il soit lié à l'optimisation des interactions utilisateurs, il aurait pu être plus complet en abordant d'autres concepts mentionnés dans la synthèse."}, {"exercise": {"id": "4cc91b3570c44bd6b1da6c8f3f90d7d2", "question": "Que désigne le terme espace blanc en conception d'interface ?", "answers": ["Le vide autour ou à l'intérieur des éléments de la conception"], "distractors": ["La couleur utilisée pour les polices de texte", "Les bordures des fenêtres de dialogue", "La taille prédéfinie des sections", "Un affichage en mode plein écran", "Le contraste entre différents blocs", "La distance entre deux images", "La zone dédiée aux animations", "Un type spécifique de cadre dans l'interface", "La forme générale de l'interface"], "feedback": "L'espace blanc, également appelé espace négatif, désigne les vides autour ou à l'intérieur des éléments de la conception. Cet espace peut être utilisé de manière stratégique pour améliorer la lisibilité et la mise en valeur des différents éléments de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur le concept d'espace blanc en conception d'interface, qui est un élément pertinent dans la réalisation de maquettes et la mise en forme. Bien que cela touche à l'esthétique et à l'ergonomie des interfaces, il ne couvre pas directement les aspects clés mentionnés dans la référence, tels que le wireframing, la collaboration entre designers UX et UI, ou encore l'optimisation des interactions utilisateur. L'exercice évalue une connaissance spécifique mais ne teste pas de manière exhaustive les compétences nécessaires pour réaliser une maquette complète. Ainsi, bien qu'il soit pertinent, il n'évalue pas entièrement les objectifs d'apprentissage liés à la conception de maquettes."}, {"exercise": {"id": "2b0b51b6c6f54f0f93556389a239ab78", "question": "Quel outil est utilisé par les Designers parmi ces propositions ?", "answers": ["Le figma"], "distractors": ["Trello", "Visual Studio Code", "Invision", "WordPress", "Canva", "Affinity Photo", "GitHub", "Blender", "Le jira"], "feedback": "Figma est un outil de conception d'interface utilisateur qui permet aux designers de collaborer sur des projets en temps réel et de créer des prototypes interactifs. Il est de plus en plus utilisé dans l'industrie du design pour sa facilité d'utilisation et ses fonctionnalités avancées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c3856ee582864d13a2fe35045e21346f", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Le métier de Designer a beaucoup évolué ces dernières années avec l'apparition de différentes spécialités ( UX Designer, UIDesigner, Product Designer, ... ) denouvelles méthodes (Atomic Design, Design Thinking, ... ) et de nouveaux outils (Sketch, Figma, Adobe XD, ... )", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef9ea6dd9a1c4597a041e212a02fc1e7", "next_id": null, "prev_id": "bd60d99870b747389a3bbc7e9ecb73ee", "associated_block_ids": [], "first_page": 3, "last_page": 3, "start_time": null, "end_time": null, "doc_id": 13680, "doc_label": "Sequence 7_créativité et originalité", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'un outil spécifique utilisé par les designers, ce qui est pertinent dans le contexte de la réalisation de maquettes et de mise en forme. Cependant, il ne couvre pas directement les concepts clés tels que l'expérience utilisateur (UX), le wireframing, ou la simplicité dans le design mentionnés dans la synthèse. Bien que Figma soit un outil important pour les designers UX/UI, l'exercice pourrait être amélioré en intégrant des questions qui évaluent davantage la compréhension des principes de conception et d'interaction utilisateur plutôt que de se concentrer uniquement sur un outil particulier."}, {"exercise": {"id": "2a9f6fa4179b4b48bccc91cf9cccb25e", "question": "Parmi ces actions, lesquelles sont citées comme moyens d'interagir avec un objet ou interface ?", "answers": ["Tirer, cliquer, appuyer, effleurer sont cités comme des moyens d'interaction"], "distractors": ["Agiter, faire glisser et zoomer sur l'objet sont recommandés pour l’interaction", "Tourner, secouer et projeter sont les principaux modes d'interaction décrits", "Taper, soumettre, valider sont des étapes essentielles d'interaction avec l’interface", "Presser, encaisser, valider facilitent la navigation au sein des interfaces interactives", "Déplier, afficher, superposer sont des techniques d'implémentation des éléments visuels", "Appuyer, visionner, partager définissent l'interaction entre utilisateur et technologie", "Effectuer un clic long est le plus souvent conseillé pour les interactions complexes", "Ajouter, supprimer, confirmer sont les trois étapes de base de toute interaction interface", "Identifier, mémoriser et répéter sont des processus cognitifs essentiels à l’affordance"], "feedback": "Dans cet exemple, tirer, cliquer, appuyer et effleurer sont des actions concrètes que l'on peut effectuer pour interagir avec un objet ou une interface. Ces actions sont faciles à comprendre et à exécuter pour les utilisateurs, et sont donc considérées comme faisant partie de l'affordance d'un objet ou d'une interface. Les autres distracteurs sont soit des étapes supplémentaires dans le processus d'interaction (ex : partager, partager), soit des actions moins courantes pour interagir avec un objet ou une interface (ex : projeter, encaisser).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé évalue la compréhension des actions d'interaction avec une interface, ce qui est pertinent dans le contexte de la conception de maquettes et de l'expérience utilisateur (UX). Cependant, il ne couvre pas directement les aspects clés mentionnés dans la référence, tels que le wireframing, la simplicité du design ou l'importance de la cohérence. Bien que les actions d'interaction soient importantes pour l'ergonomie et l'utilisabilité des interfaces, l'exercice pourrait être amélioré en intégrant des questions sur la création de maquettes ou sur les principes fondamentaux du design UX. Ainsi, bien qu'il soit pertinent, il ne teste pas entièrement tous les concepts clés liés à la réalisation de maquettes."}, {"exercise": {"id": "8a0090c63f2543fb9a56f60fd2dc163c", "question": "Comment est défini le terme design dans ce contexte spécifique ?", "answers": ["Il est synonyme de « conception »"], "distractors": ["Il se réfère aux illustrations", "Il s'agit de broderie numérique", "Il désigne des algorithmes", "Il décrit uniquement l'UX", "Il parle de graphisme pur", "Design signifie codage", "Il devient un synonyme de créativité", "Il est lié au marketing", "Il correspond à une interface"], "feedback": "Le terme design est souvent associé à la création visuelle, mais dans ce cas précis, il est utilisé comme synonyme de conception. Il s'agit donc d'une approche qui va au-delà de l'esthétique et qui inclut également la planification et la conception d'une expérience utilisateur optimale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du terme 'design' dans le contexte de la conception d'expérience utilisateur (UX) et de la création de maquettes. Bien que cela soit pertinent pour le sujet, l'exercice pourrait être amélioré en se concentrant davantage sur des aspects spécifiques liés à la réalisation de maquettes et à leur mise en forme, comme les principes d'utilisabilité ou les techniques de wireframing. La question est trop générale et ne permet pas d'évaluer en profondeur la maîtrise des concepts clés abordés dans la référence."}, {"exercise": {"id": "41548d75a81a4ada9f8310827926ecef", "query": "Apple recommande que les boutons d'appel à l'action dans l'interface utilisateur mobile aient une taille minimale de <blank> pixels.", "answers": ["44 x 44"], "distractors": [["50 x 50", "34 x 26", "40 x 40", "48 x 48", "38 x 38", "36 x 36"]], "feedback": "La bonne réponse est '44 x 44'. Apple spécifie que, dans l'interface utilisateur mobile, la taille minimale d'un bouton d'appel à l'action doit être de 44 pixels de large et de 44 pixels de haut. Cela garantit une bonne visibilité et permet aux utilisateurs d'interagir facilement avec le bouton.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une spécification technique concernant la taille des boutons dans une interface utilisateur mobile, ce qui est pertinent pour la conception de maquettes et l'optimisation de l'expérience utilisateur. Cependant, il ne couvre pas directement les concepts plus larges abordés dans la référence, tels que le wireframing, la simplicité du design ou l'interaction globale entre les utilisateurs et les produits numériques. Bien qu'il soit utile pour évaluer un aspect spécifique de l'interface, il manque une approche plus holistique sur la conception de maquettes et leur mise en forme."}, {"exercise": {"id": "58a83fde0a3348baaca5da731c2c0cf1", "query": "Dans le domaine du design d'expérience, le design ne se limite pas à <blank>, mais inclut également la prise en compte de l'expérience utilisateur.", "answers": ["la conception"], "distractors": [["le dessin", "la programmation", "le codage", "la visualisation", "la création d'interface", "les outils graphiques"]], "feedback": "La bonne réponse est 'la conception', car dans le cadre du design d'expérience, il est essentiel de comprendre que le terme « design » renvoie à la manière dont un produit est conçu, avec un accent particulier sur l'expérience utilisateur, et non simplement sur la création visuelle ou graphique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé teste la compréhension du concept de design dans le contexte de l'expérience utilisateur, ce qui est pertinent par rapport à la référence sur la réalisation de maquettes et mise en forme. Cependant, il ne couvre pas directement les aspects spécifiques liés à la création de maquettes ou à l'utilisation des techniques comme le wireframing, ni les éléments visuels et fonctionnels essentiels pour optimiser l'interaction utilisateur. Bien que l'exercice aborde un aspect clé du design d'expérience, il pourrait être amélioré en intégrant des questions plus directement liées aux compétences pratiques nécessaires pour réaliser une maquette efficace."}, {"exercise": {"id": "995e290cda554dceb9314682933f7829", "statement": "L'espace blanc, ou espace négatif, est utilisé pour représenter les parties textuelles du design.", "veracity": false, "feedback": "L'espace blanc, également appelé espace négatif, se réfère au vide autour ou à l'intérieur des éléments de conception, et non aux parties textuelles. Il s'agit d'un élément clé pour améliorer la lisibilité et la hiérarchie visuelle dans un design.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept important dans le design, à savoir l'espace blanc (ou espace négatif), qui est essentiel pour la création de maquettes et l'optimisation de l'expérience utilisateur. Bien que cela soit pertinent pour le contexte de la réalisation de maquettes, l'exercice ne couvre pas directement les aspects spécifiques mentionnés dans la référence, tels que le wireframing, la simplicité du design ou la cohérence des interfaces. Il aborde un élément visuel important mais ne touche pas aux compétences pratiques liées à la conception de maquettes. Ainsi, bien qu'il ait une certaine pertinence, il n'évalue pas complètement les objectifs d'apprentissage liés à la mise en forme et à la conception des maquettes."}, {"exercise": {"id": "5dfa078c93a7429e8dc56bddb5e73e9f", "statement": "Le mobile représente plus de 52% du trafic en ligne, ce qui rend le responsive design essentiel.", "veracity": true, "feedback": "Il est correct que le mobile représente plus de la moitié du trafic en ligne. Dans ce contexte, il est crucial de concevoir des sites ou applications compatibles avec divers appareils, notamment mobiles, d'où l'importance du responsive design pour offrir une bonne expérience utilisateur sur tous types de supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de responsive design, qui est un aspect important de la conception d'interfaces et de maquettes. Bien que cela soit pertinent pour la réalisation de maquettes et la mise en forme, l'exercice se concentre principalement sur une statistique concernant le trafic mobile plutôt que sur les compétences pratiques ou théoriques liées à la création effective de maquettes. Il évalue une compréhension générale du responsive design mais ne teste pas directement les compétences nécessaires pour réaliser des maquettes ou pré-maquettes, ce qui limite sa pertinence par rapport à l'objectif pédagogique."}, {"exercise": {"id": "2c1395cb073e47e99fb0a0ec65707d09", "statement": "Les affordances concernent uniquement l'interaction physique avec des objets, comme appuyer sur une poignée de porte ou tirer une chaise.", "veracity": false, "feedback": "Cela est incorrect, car les affordances couvrent un spectre large d'interactions, y compris celles avec des interfaces numériques. Elles ne se limitent pas à des actions physiques ; par exemple, cliquer ou tapoter sur des éléments d'une interface graphique sont également des affordances utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept des affordances, qui est pertinent dans le contexte de la conception d'expérience utilisateur (UX) et de la création de maquettes. Bien que l'affirmation porte sur un aspect spécifique des interactions, elle touche à une notion clé qui influence la manière dont les utilisateurs interagissent avec les interfaces numériques. Cependant, l'exercice ne teste pas directement la capacité à réaliser une maquette ou à mettre en forme des éléments visuels, ce qui est au cœur de la référence. Il aurait été plus pertinent d'inclure des questions sur le wireframing ou sur les principes de design mentionnés dans la synthèse pour évaluer pleinement la compréhension des compétences nécessaires à la réalisation de maquettes."}, {"exercise": {"id": "93e7ef85a293427fa476fcf9bd39ab01", "question": "Quelle étape précède généralement la réalisation du zoning lors d’un projet web ?", "answers": ["La création de l’arborescence"], "distractors": ["La définition du cahier des charges", "Le développement de la base de données", "La mise en place des tests utilisateurs", "L’optimisation de la vitesse de chargement", "La proposition de maquettes aux parties prenantes", "La sélection des outils de gestion de projet", "L’écriture du contenu rédactionnel", "La validation finale du client", "La configuration des serveurs"], "feedback": "Avant de procéder au zoning, il est nécessaire de définir la structure du site à travers une arborescence. Cela permet d'avoir une vision globale de l'organisation des pages et des contenus. Ainsi, le zoning peut être réalisé en parallèle de la création de l'arborescence.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des étapes de conception d'un projet web, en se concentrant sur l'arborescence qui est une étape préliminaire à la réalisation de maquettes. Bien que cela soit pertinent pour le processus de création de maquettes et pré-maquettes, l'exercice ne couvre pas directement les concepts clés liés à la mise en forme et à l'expérience utilisateur (UX) mentionnés dans la référence. Il aurait été plus pertinent d'inclure des questions sur le wireframing ou sur les principes de design UX pour évaluer plus précisément la maîtrise des éléments essentiels liés à la réalisation de maquettes."}, {"exercise": {"id": "9ffa467f37084a368ad722d16d9aebc8", "query": "Le zoning permet de définir l'organisation générale des pages après la création de <blank>.", "answers": ["l'arborescence"], "distractors": [["les wireframes", "la charte graphique", "le prototype", "les maquettes", "l'interface", "le contenu"]], "feedback": "La bonne réponse est 'l'arborescence', car le zoning intervient généralement après que l'arborescence a été créée. L'arborescence correspond à la structure hiérarchique du site, tandis que le zoning s'intéresse à la répartition des blocs de contenu sur les pages. Les autres réponses sont incorrectes car elles concernent des étapes ou éléments distincts dans le processus de conception web (wireframes, maquettes, etc.).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du concept de zoning dans le processus de conception d'une maquette, ce qui est pertinent par rapport à la référence sur la réalisation de maquettes et pré-maquettes. Cependant, il se concentre principalement sur l'arborescence plutôt que sur les aspects clés tels que l'expérience utilisateur, le wireframing ou la mise en forme des maquettes. Bien qu'il soit lié au sujet général, il ne couvre pas directement les éléments essentiels mentionnés dans la synthèse, comme l'interaction utilisateur ou la simplicité du design. Par conséquent, bien qu'il ait une certaine pertinence, il ne teste pas complètement les compétences clés attendues."}, {"exercise": {"id": "0dbdd87a7b9c4075b3ef23380297eec5", "query": "Les sites web adoptant un design minimaliste utilisent souvent <blank> pour créer un effet visuel apaisant et épuré.", "answers": ["des couleurs atténuées"], "distractors": [["des couleurs flashy", "des textures granulaires", "de multiples polices de caractères", "des animations complexes", "des formes géométriques audacieuses", "des images vives et contrastées"]], "feedback": "La bonne réponse est 'des couleurs atténuées', car les sites minimalistes mettent l'accent sur la simplicité, souvent en réduisant l'intensité des couleurs pour renforcer l'effet visuel calme et épuré. Les autres options, comme 'des couleurs flashy' ou 'des images vives et contrastées', contreviennent à cet objectif en ajoutant trop de détails et de dynamisme.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect du design minimaliste, qui est un élément clé de la référence sur la réalisation de maquettes et la mise en forme. Cependant, il se concentre uniquement sur les choix de couleurs sans aborder d'autres concepts importants tels que l'interaction utilisateur, la cohérence ou le wireframing. Bien qu'il soit pertinent, il ne couvre pas suffisamment les divers aspects nécessaires à une conception efficace des maquettes."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension du concept de design system, qui est pertinent dans le contexte de la réalisation de maquettes et de mise en forme. Un design system contribue à la cohérence et à l'homogénéité des éléments graphiques, ce qui est essentiel pour optimiser l'expérience utilisateur. Cependant, l'exercice ne teste pas directement les compétences liées à la création de maquettes ou au wireframing, qui sont des aspects clés mentionnés dans la référence. Ainsi, bien qu'il soit lié au sujet général, il ne couvre pas entièrement les objectifs d'apprentissage spécifiques liés à la conception de maquettes."}, {"exercise": {"id": "388525c44d4749319aec5fc378adefa3", "statement": "Un design system se limite uniquement aux éléments graphiques et visuels d'un produit.", "veracity": false, "feedback": "Un design system ne se limite pas uniquement aux éléments graphiques et visuels. Il inclut également des règles, des éléments de branding, le ton, et d'autres points de contact relatifs au produit, afin de créer un système cohérent et standardisé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent de la conception de maquettes en se concentrant sur le design system, qui est essentiel pour assurer la cohérence et l'uniformité dans le design des interfaces. Cependant, bien qu'il soit lié à la mise en forme et à la conception UX, il ne teste pas directement les compétences spécifiques liées à la réalisation de maquettes ou au wireframing mentionnées dans la référence. L'exercice pourrait être amélioré en intégrant des questions plus directement liées aux techniques de création de maquettes ou à l'optimisation des interactions utilisateur."}, {"exercise": {"id": "357b4a2ec744463291cf30d8fb6bdd46", "question": "À quoi la loi de Hick-Hyman est-elle principalement liée dans le domaine des technologies ?", "answers": ["À l'évaluation de l'utilisabilité des interfaces"], "distractors": ["Au calcul des ressources matérielles nécessaires", "À la gestion de la mémoire des appareils", "À l'amélioration de la sécurité des systèmes", "Au développement des applications mobiles", "À la synchronisation des processus en temps réel", "À l'optimisation des bases de données", "À la réduction des bugs logiciels", "Au suivi des performances utilisateurs en temps réel", "À la gestion de l’énergie consommée"], "feedback": "La loi de Hick-Hyman est principalement utilisée dans le domaine des technologies pour évaluer la qualité des interfaces. En se basant sur la relation entre le temps de réaction et les possibilités de choix, elle permet de déterminer si une interface est facile à utiliser ou non. Cela permet aux concepteurs de prendre en compte ces éléments lors du développement de nouvelles interfaces afin d'améliorer leur utilisabilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a6f7b6ba24a348699c378ebeacc17668", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Hick-Hyman est une loi mathématique qui permet d'évaluer l'utilisabilité des interfaces. Cette loi établit clairement une relation entre le temps de réaction et les possibilités de choix.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3ab21d83414d4633ab5831f7c654f27f", "next_id": "065e4ecd54d94505ba62d7cbace2e6e9", "prev_id": "3ab21d83414d4633ab5831f7c654f27f", "associated_block_ids": [], "first_page": 21, "last_page": 21, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un concept pertinent lié à l'utilisabilité des interfaces, ce qui est en lien avec la réalisation de maquettes et la mise en forme dans le contexte de la conception UX. La loi de Hick-Hyman est effectivement un principe important pour évaluer la qualité des interfaces, ce qui peut influencer la conception des maquettes. Cependant, l'exercice ne teste pas directement les compétences spécifiques liées à la création de maquettes ou à leur mise en forme, mais plutôt une théorie générale sur l'utilisabilité. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement les aspects pratiques et techniques attendus dans le cadre de la référence."}, {"exercise": {"id": "bfadd69830f842acbfe37e3154657004", "statement": "La loi de Hick-Hyman permet d'évaluer l'efficacité des interfaces en analysant le nombre de choix disponibles.", "veracity": true, "feedback": "La loi de Hick-Hyman met en relation le temps de réaction et le nombre de choix possibles. Elle est souvent utilisée pour évaluer l'utilisabilité des interfaces en fonction de la complexité des choix offerts à l'utilisateur, ce qui est un facteur important dans l'évaluation de leur efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a6f7b6ba24a348699c378ebeacc17668", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Hick-Hyman est une loi mathématique qui permet d'évaluer l'utilisabilité des interfaces. Cette loi établit clairement une relation entre le temps de réaction et les possibilités de choix.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3ab21d83414d4633ab5831f7c654f27f", "next_id": "065e4ecd54d94505ba62d7cbace2e6e9", "prev_id": "3ab21d83414d4633ab5831f7c654f27f", "associated_block_ids": [], "first_page": 21, "last_page": 21, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un concept pertinent pour la conception d'interfaces, à savoir la loi de Hick-Hyman, qui est liée à l'usabilité et à l'efficacité des interfaces. Cependant, bien que cela soit en lien avec la mise en forme et la maquette, l'exercice ne teste pas directement les compétences spécifiques liées à la réalisation de maquettes ou de pré-maquettes. Il se concentre davantage sur une théorie psychologique appliquée aux choix utilisateurs plutôt que sur les aspects pratiques de la conception de maquettes. Ainsi, il évalue partiellement des éléments clés mais ne couvre pas entièrement les objectifs d'apprentissage liés à la création concrète de maquettes."}, {"exercise": {"id": "e192175fbdbe46bebd93a510b0827b98", "question": "Quel est le but principal de l'éco-conception, selon la définition donnée ?", "answers": ["Trouver un compromis environnemental avec les contraintes de conception du produit"], "distractors": ["Maximiser l'efficacité énergétique à tout prix.", "Garantir seulement la faisabilité technique d'un projet.", "Minimiser uniquement les coûts de production.", "Optimiser exclusivement les délais de fabrication.", "Améliorer la performance commerciale avant tout.", "Assurer une expérience utilisateur parfaite sans considération écologique.", "Réduire drastiquement les émissions de carbone.", "Prioriser l'efficacité commerciale à la durabilité.", "Atteindre une réduction totale des déchets de fabrication."], "feedback": "L'éco-conception vise à trouver un équilibre entre les contraintes environnementales et les autres contraintes liées à la conception d'un produit, telles que la faisabilité technique, les coûts, les délais et la performance d'utilisation. Cela signifie qu'il ne s'agit pas seulement de minimiser l'impact écologique, mais aussi de prendre en compte d'autres critères importants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7fd2dfc8eaaa465f9363402ce9492498", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif de cette démarche n'est pas la performance mais l'efficience : (Consommer le moins de mémoire, CPU, Stockage, Bande passante) L'éco-conception recherche le juste compromis de l'environnement avec toutes les autres contraintes liées à la conception du produit. Ainsi, elle intègre les réflexions environnementales au même titre que la faisabilité technique, la maîtrise des coûts et délais, la commercialisation, ainsi que la performance d'usage, etc.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "51b2faf1dccf4c88a474ccace8951217", "next_id": "4b2cf00ad8b24049accfa4ddbbced494", "prev_id": "1ce45de7c77c4f7882ffa6a2781ce4fb", "associated_block_ids": [], "first_page": 4, "last_page": 9, "start_time": null, "end_time": null, "doc_id": 13705, "doc_label": "QUALITE-WEB-_C2", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'éco-conception, qui est un aspect mentionné dans la synthèse. Cependant, il ne teste pas directement les compétences liées à la réalisation de maquettes et à la mise en forme, qui sont au cœur de la référence. Bien que pertinent pour le contexte général du design UX, l'exercice se concentre sur un concept spécifique (l'éco-conception) sans aborder les éléments clés tels que le wireframing ou l'interaction utilisateur. Cela limite sa pertinence par rapport à l'objectif principal de la référence."}, {"exercise": {"id": "ec341e9a45cc486a89ecfc8b67368b32", "statement": "L'Adaptive Design consiste à créer une seule maquette qui s'adapte à tous les supports.", "veracity": false, "feedback": "L'Adaptive Design demande de créer plusieurs maquettes spécifiques pour chaque type de support afin d'offrir un confort maximal à l'utilisateur. Contrairement au responsive design qui décline une seule maquette pour tous les écrans, l'Adaptive refait des conceptions distinctes pour différents appareils ou résolutions.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "647fe78547e04201ae0b5a62bcdcab10", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Un site web réalisé en Adaptive est plus chère ... Pourquoi ? Car L'Adaptive demande de réaliser une maquette différente pour chaque support. L'adaptive permet le plus grand des confort pour l'utilisateur. On ne se contente pas de décliner comme le responsive design, on casse tout, et on recommence pour chaque support.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "86ada8bf5c004d50b7a49a3ca6caba9c", "next_id": "6053e9c5b3fb43ddb753713ab3805c43", "prev_id": "ad99bf68f1d84dd49df562681fe89fed", "associated_block_ids": [], "first_page": 196, "last_page": 196, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des concepts de design adaptatif et réactif, qui sont pertinents dans le contexte de la réalisation de maquettes. Cependant, il ne couvre pas directement les aspects clés mentionnés dans la référence, tels que l'importance de la conception UX, le wireframing ou l'utilisabilité. Bien qu'il aborde un sujet lié à la mise en forme des maquettes, il ne s'agit pas d'une évaluation complète des compétences nécessaires pour réaliser une maquette efficace selon les principes discutés dans la synthèse."}, {"exercise": {"id": "b17e37191d8e4ee096cbcba422cbd719", "question": "Quelle est la méthode qui découpe le design d'une interface en composants ?", "answers": ["L'atomic design"], "distractors": ["Le responsive design", "Le flat design", "Le skeuomorphisme", "Le material design", "Le wireframing", "Le design génératif", "Le minimalisme", "La méthode OOCSS", "Le visual design"], "feedback": "L'atomic design est une méthode de découpe du design d'une interface en plusieurs composants, permettant ainsi une meilleure organisation et une plus grande flexibilité dans la création de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une méthode de design d'interface, l'atomic design, qui est pertinente dans le contexte de la réalisation de maquettes. Cependant, bien que cela touche à la conception d'expérience utilisateur (UX), l'exercice ne couvre pas directement les aspects clés mentionnés dans la référence, tels que le wireframing ou l'importance de la simplicité et de la cohérence dans le design. De plus, il ne permet pas d'évaluer la compréhension des concepts fondamentaux liés à la création de maquettes et pré-maquettes. Ainsi, bien qu'il soit en lien avec le sujet général, il n'évalue pas pleinement les compétences spécifiques attendues."}, {"exercise": {"id": "98e4a74f235e4dc1a2c1d0fc6551ae85", "query": "Il est important que l'étiquette et son champ soient visuellement <blank>, afin d'éviter toute confusion sur leur relation.", "answers": ["proches"], "distractors": [["séparés", "indépendants", "dissociés", "distants", "espacés", "invisibles"]], "feedback": "L'étiquette doit être visuellement proche de son champ pour que l'utilisateur puisse facilement comprendre qu'ils sont liés. Si l'étiquette est trop distante ou dissociée de son champ, cela peut entraîner une confusion pour l'utilisateur sur la fonctionnalité associée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect important de la conception d'interfaces, à savoir la relation visuelle entre les étiquettes et leurs champs, ce qui est pertinent pour la réalisation de maquettes. Cependant, il ne couvre pas l'ensemble des concepts clés mentionnés dans la référence, tels que le wireframing, l'ergonomie ou l'éco-conception. Bien qu'il soit utile pour évaluer une partie de la mise en forme des maquettes, il manque de profondeur et ne permet pas d'évaluer pleinement les compétences nécessaires à la conception globale d'une maquette efficace."}, {"exercise": {"id": "6ca4c7b0e56e4844b746c5c3333c8553", "statement": "L'étiquette et son champ doivent toujours être séparés visuellement pour éviter toute confusion.", "veracity": false, "feedback": "Au contraire, l'étiquette et son champ doivent être visuellement proches afin de créer une relation claire entre les deux et d'éviter la confusion. Une telle proximité permet aux utilisateurs de comprendre plus facilement quelle étiquette correspond à quel champ de saisie.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des principes de conception d'interfaces, en particulier la relation entre les étiquettes et les champs de saisie, ce qui est pertinent pour la réalisation de maquettes. Cependant, il ne couvre pas directement tous les aspects clés mentionnés dans la référence, tels que le wireframing, l'ergonomie ou l'éco-conception. Bien qu'il aborde un aspect important de l'expérience utilisateur (UX), il pourrait être amélioré en intégrant davantage d'éléments liés à la création globale de maquettes et à leur mise en forme."}, {"exercise": {"id": "938b269faa0545afaa17e43085e495a4", "statement": "Les composants d'interface doivent obligatoirement être activables uniquement par la touche entrée du clavier.", "veracity": false, "feedback": "Les composants d'interface doivent être activables à la fois par la touche entrée du clavier et par un dispositif de pointage, comme une souris. Cela signifie que les utilisateurs peuvent enclencher l'action prévue aussi bien au clavier qu'avec un pointeur, sans restriction exclusive à la touche entrée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5e58a2a21cc2421591889be147d15c6f", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "· Un composant d'interface (lien, bouton, ... ) est activable au clavier et par tout dispositif de pointage lorsque l'utilisateur peut enclencher, indifféremment, l'action prévue par le composant d'interface par une pression du pointeur ou la touche entrée du clavier. Note importante : le recours à certaines technologies peut rendre la gestion du focus trop complexe ou trop instable pour ne reposer que sur la tabulation, les touches de direction et la touche entrée. Dans ce cas, la mise à disposition de raccourcis clavier peut être la seule solution pour rendre le composant utilisable. Le critère ne peut être considéré comme conforme qu'à la condition que les raccourcis clavier utilisés soient correctement documentés, qu'ils soient fonctionnels et qu'ils respectent le critère 12.10.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "49faef6e06c24bfb90a077b52bee2b5e", "next_id": "d20170ade45a40b4be25f87ff0d47fc0", "prev_id": "07eedf5563fb486da7d81015a164005c", "associated_block_ids": [], "first_page": 84, "last_page": 84, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des composants d'interface et leur accessibilité, ce qui est pertinent pour la réalisation de maquettes et la mise en forme. Cependant, il ne couvre pas directement les aspects de conception UX ou de wireframing mentionnés dans la référence. Bien qu'il aborde un point important sur l'interaction utilisateur, il pourrait être amélioré en intégrant des éléments plus spécifiques à la création de maquettes ou à l'optimisation des interactions dans le cadre du design UX."}, {"exercise": {"id": "8ac6c3f6b595481f886c30555728b99b", "statement": "Le fil d'Ariane aide à indiquer la position de l'utilisateur sur un site.", "veracity": true, "feedback": "Le fil d'Ariane est un élément de navigation qui informe l'utilisateur de son emplacement actuel dans le site, facilitant ainsi le repérage et la navigation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un élément de navigation (le fil d'Ariane) qui est pertinent dans le contexte de la conception d'expérience utilisateur (UX) et de la création de maquettes. Bien que cela soit un aspect important du design UX, l'exercice ne couvre pas directement les concepts clés tels que le wireframing, la simplicité dans le design ou l'interaction fluide entre les utilisateurs et les interfaces. Il aborde un point spécifique mais ne permet pas d'évaluer pleinement la maîtrise des compétences nécessaires pour réaliser une maquette efficace. Par conséquent, il obtient une note intermédiaire."}, {"exercise": {"id": "a89e80f3f1dc43a68ce19fbb0af28b4a", "statement": "L'utilisateur va d'abord trouver le call to action avant de lire le contenu.", "veracity": false, "feedback": "L'utilisateur commence par lire le contenu, puis s'il le souhaite, il entreprendra une démarche pour ensuite trouver le call to action. Le processus suit un ordre logique respectant le sens de lecture et la hiérarchie des éléments de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'interaction utilisateur avec une interface, ce qui est pertinent pour le contexte de la réalisation de maquettes et de mise en forme. En abordant la manière dont un utilisateur interagit avec le contenu et les éléments d'appel à l'action (call to action), il touche à des concepts clés tels que l'utilisabilité et la hiérarchie visuelle. Cependant, il pourrait être amélioré en intégrant des aspects plus spécifiques liés à la conception de maquettes, comme le wireframing ou la simplicité dans le design. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement tous les aspects essentiels mentionnés dans la synthèse."}, {"exercise": {"id": "9658d6c80b9f4df48c99d7f3db50b327", "statement": "Les tendances dans la conception d'applications doivent toujours être suivies pour garantir une meilleure expérience utilisateur.", "veracity": false, "feedback": "Il est spécifiquement mentionné que les tendances ne doivent pas dicter la conception. Ce qui compte, c'est de créer une solution intuitive basée sur ce à quoi les utilisateurs sont habitués, afin de prévenir la frustration.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect important de la conception UX, à savoir que les tendances ne doivent pas être suivies aveuglément, mais que l'accent doit être mis sur l'intuitivité et les habitudes des utilisateurs. Cependant, bien qu'il soit pertinent pour le contexte de la maquette et de la mise en forme, il ne couvre pas directement des éléments clés tels que le wireframing, la simplicité dans le design ou l'ergonomie mentionnés dans la synthèse. L'exercice pourrait être amélioré en intégrant des questions plus spécifiques sur ces concepts."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 10.2, "top_pages": [34, 20], "top_minutes": []}, {"document": {"id": 13670, "label": "Bonus_21B", "authors": [], "title": "Comprendre et Appliquer l'UI/UX dans les Projets Fullstack", "content": [], "mime_type": "application/pdf", "short_summary": "Ce cours met en avant l'importance de l'UI/UX dans le développement fullstack, soulignant les principes fondamentaux et les bénéfices d'un bon design. Il aborde également des outils comme Tailwind CSS, Magic UI et Shadcn UI pour améliorer la conception des interfaces.", "long_summary": "- Importance de l'UI/UX dans le développement web et mobile.\n- Définition de l'UI (Interface Utilisateur) et de l'UX (Expérience Utilisateur).\n- Principes fondamentaux : simplicité, consistance, réactivité, accessibilité, esthétique.\n- Statistiques sur le taux de rebond et l'impact d'une bonne UX sur les conversions.\n- Satisfaction des utilisateurs liée à une interface bien conçue.\n- Outils d'inspiration : Dribbble, Behance, Tailwind CSS, Magic UI, Shadcn UI.\n- Avantages du maquettage : clarification des objectifs, communication entre acteurs du projet, réduction des coûts et amélioration de l'expérience utilisateur.\n- Découverte de frameworks CSS utility-first comme Tailwind CSS.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/6cdca90_bonus_21b.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Objectifs du Cours\n===\n\n- Principes Fondamentaux de l'UI/UX\n===\n\n- L'importance de l'UI/UX\n===\n\n- L'importance de l'UI/UX\n===\n\n- Trouver de l'inspiration\n===\n\n- L'importance du maquettage\n===\n\n- Avantage du maquettage\n===\n\n- Découverte Tailwind CSS\n===\n\n- Découverte Magic UI\n===\n\n- Découverte Shaden UI\n===\n\n- Debrief\n===\n", "number_of_pages": 13, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 8.7, "top_pages": [6, 7], "top_minutes": []}]}