{"introduction": "La conception de la cartographie fonctionnelle d'un système d'information (SI) est une étape cruciale dans l'architecture des systèmes et des réseaux. Elle permet de visualiser les interactions entre les différentes composantes du SI, facilitant ainsi la compréhension des besoins des utilisateurs et l'organisation des informations. Cette synthèse aborde divers concepts clés qui contribuent à cette démarche, allant de l'analyse des besoins à la gestion de projet, en passant par le design digital et les outils de communication visuelle.", "synthesis": "La première section se concentre sur l'analyse des besoins du client, un processus fondamental pour identifier les exigences explicites et implicites qui guideront la conception du SI. En parallèle, le diagnostic joue un rôle essentiel en permettant une évaluation approfondie afin de formuler des recommandations adaptées aux attentes du client. Ces étapes préliminaires sont cruciales pour garantir que le système conçu répondra efficacement aux objectifs fixés.\n\nEnsuite, nous abordons les outils et techniques de conception tels que le wireframing et le design system. Le wireframing permet de créer des maquettes schématiques qui clarifient la structure d'une interface utilisateur sans se concentrer sur le design final, tandis qu'un design system assure une cohérence visuelle à travers différents produits grâce à une bibliothèque standardisée d'éléments graphiques. Ces outils facilitent non seulement la communication entre les parties prenantes mais aussi le développement ultérieur du produit.\n\nUne autre dimension importante est celle de l'organisation hiérarchique et de l'arborescence, qui permettent d'organiser efficacement les informations au sein du SI. Cela améliore la navigation et l'accès aux données essentielles, rendant ainsi le système plus intuitif pour ses utilisateurs. La lisibilité est également un aspect clé dans cette organisation, garantissant que toutes les informations présentées soient facilement compréhensibles.\n\nLa gestion de projet est également primordiale dans ce contexte; elle implique l'application méthodique de compétences pour planifier et superviser chaque phase du développement du SI tout en respectant les contraintes budgétaires et temporelles. Les dépendances entre tâches doivent être gérées avec soin pour assurer un flux de travail harmonieux.\n\nEnfin, nous examinons comment utiliser des indicateurs clés de performance (KPI) pour évaluer le succès du système mis en place. Ces mesures quantifiables permettent non seulement d'évaluer l'efficacité mais aussi d'ajuster les stratégies en fonction des résultats obtenus. L'ensemble de ces concepts interconnectés forme une base solide pour concevoir une cartographie fonctionnelle efficace qui répond aux besoins spécifiques identifiés lors des phases initiales.", "concepts": [{"concept": {"id": "9c7cbcbd-6820-4fcd-bd00-88a36b11fe80", "label": "Analyse des Besoins du Client", "definition": "Processus d'évaluation des exigences explicites et implicites d'un client afin de fournir des solutions adaptées à ses attentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'analyse des besoins du client est cruciale pour concevoir une architecture adaptée aux attentes des utilisateurs, rendant ce concept très pertinent pour la référence donnée."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "'Wireframing' est très pertinent car il s'agit d'une technique essentielle pour visualiser et structurer une interface utilisateur dans le cadre de l'architecture du SI."}, {"concept": {"id": "9d810e58-40a4-40c3-9db4-16ad82dcf8b6", "label": "Business Technology", "definition": "Technologies utilisées pour améliorer les opérations commerciales, incluant l'automatisation, l'analyse de données et la gestion des ressources.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La Business Technology est très pertinente car elle englobe les outils et technologies nécessaires pour optimiser les opérations commerciales au sein d'un système informatique."}, {"concept": {"id": "ad750065-352f-471a-b1fc-a896a99991b2", "label": "Actionable Insights", "definition": "Informations dérivées de données qui peuvent être directement appliquées pour prendre des décisions stratégiques dans une entreprise.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les insights exploitables sont cruciaux pour prendre des décisions stratégiques lors de la conception et de l'optimisation d'un système d'information."}, {"concept": {"id": "1ef72a7e-5e74-4275-8671-d3b08e7e6482", "label": "Design System", "definition": "Un design system est une bibliothèque standardisée d'éléments graphiques, de composants réutilisables et de règles de branding unifiées, qui assurent la cohérence visuelle et fonctionnelle dans le développement de produits, sites ou applications. Il vise à standardiser le développement et à garantir une expérience utilisateur homogène à travers plusieurs produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13700], "aliases": ["9dbaffae-3852-4454-b66b-2adfc8c61863", "959c321e-cd66-4ef2-beec-74a58976030e"], "wikientity": {"label": "Système de design", "definition": "Un système de design, un système de conception ou un design system est un ensemble de composants réutilisables et de normes claires qui peuvent être assemblés pour créer un nombre illimité d'applications. Les systèmes de design aident à la conception de produits numériques et au développement de produits tels que des applications mobiles ou des sites Web. Ils peuvent contenir, sans toutefois s'y limiter, des bibliothèques de modèles/composants, des dictionnaires de conception, des guides de style (police, couleur, espacement, placement), des composants codés, des langages de marque et de la documentation.", "page_id": "16328891", "wikidata_id": "Q81875083", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Un design system contribue à l'architecture d'un système en assurant la cohérence visuelle et fonctionnelle, ce qui est essentiel lors de la conception d'une cartographie fonctionnelle."}, {"concept": {"id": "99c4272d-b04d-46f9-8678-16107829dbb3", "label": "Arborescence", "definition": "Structure hiérarchique permettant d'organiser des fichiers ou informations, facilitant la navigation et l'accès aux données dans un projet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": {"label": "Arborescence", "definition": "En mathématiques, plus précisément dans la théorie des graphes : une arborescence est un arbre comportant un sommet particulier \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n, nommé racine de l'arborescence, à partir duquel il existe un chemin unique vers tous les autres sommets.\n\nEn informatique, cette notion désigne souvent celle d'arbre de la théorie des graphes. Une arborescence désigne alors généralement une organisation des données en mémoire, de manière logique et hiérarchisée, utilisant une structure algorithmique d'arbre.", "page_id": "76749", "wikidata_id": "Q2067937", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'arborescence est essentielle pour organiser les informations dans une cartographie fonctionnelle, facilitant ainsi l'accès et la navigation au sein du système."}, {"concept": {"id": "296f12ab-03eb-495e-a89c-a642b60fb59f", "label": "Stylescape", "definition": "Un stylescape est un outil de conception visuelle élaboré qui représente l'identité d'une marque en regroupant typographie, couleurs, images et éléments graphiques. Il définit une direction esthétique et communique l'essence d'un projet ou d'une marque en illustrant une vision créative. Enrichissant la présentation des propositions, il transmet également l'identité ainsi que l'expérience globale souhaitées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679, 13691, 13701], "aliases": ["00177c06-47fd-4e59-aaf0-40bae219397f", "9b293c40-def0-4671-adf0-4548e76ec630", "3be7bd57-bfea-4bcb-8f2c-3043b5337341", "1adbfe40-1617-4b38-97bc-4d3517ae959b", "b1f8fe5b-f9f7-4dbb-8b77-60dfa36ab7c0"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Stylescape' joue un rôle significatif en définissant l'identité visuelle nécessaire pour communiquer efficacement une vision créative dans le cadre d'une architecture systémique."}, {"concept": {"id": "a8a00071-1e94-47d4-ae1f-c4d1d56d0f25", "label": "Suivi de projet", "definition": "Processus de gestion permettant de surveiller l'avancement des tâches et d'ajuster les délais en fonction des besoins.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le suivi de projet est crucial pour gérer efficacement le développement d'une architecture de système et s'assurer que toutes les étapes sont respectées."}, {"concept": {"id": "3898834d-4869-40af-9c13-784f85193239", "label": "Diagnostic", "definition": "Un diagnostic dans le contexte commercial fait référence à l'analyse approfondie des besoins d'un client, permettant de formuler des recommandations adaptées pour atteindre ses objectifs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le diagnostic est crucial pour comprendre les besoins avant de concevoir un système d'information, ce qui en fait un concept pertinent dans ce contexte."}, {"concept": {"id": "649b9e0a-1d5a-4e90-adf3-d037c915dfd0", "label": "Organisation hiérarchique", "definition": "Méthode de structuration des idées par niveaux d'importance, permettant une meilleure clarté et compréhension des relations entre les concepts.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'Organisation hiérarchique est essentielle pour structurer les informations et les relations entre différents composants d'un système, ce qui est fondamental pour une cartographie fonctionnelle efficace."}, {"concept": {"id": "ae467590-b74a-463a-8b8f-0d480a17c50a", "label": "Gestion de projet", "definition": "La gestion de projet est une discipline qui consiste à appliquer des connaissances, compétences et techniques pour planifier, exécuter et superviser des projets afin d'atteindre des objectifs spécifiques dans un cadre temporel défini. Elle implique l'organisation et la planification des ressources tout en respectant les contraintes budgétaires, et elle est particulièrement cruciale dans divers domaines, y compris le domaine créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13698, 13682, 13701], "aliases": ["232cece6-e141-4a95-9074-9c0f3fa70420", "4e6d523f-1898-42bd-8663-8d1982f44771", "14b98af1-6aaa-43a4-b8a5-8b6c40a54ef9"], "wikientity": {"label": "Gestion de projet", "definition": "La gestion de projet, est l'ensemble des activités visant à organiser le bon déroulement d’un projet et à en atteindre les objectifs en temps et en heures selon les objectifs visés. Elle consiste à appliquer les méthodes, techniques, et outils de gestion spécifiques aux différentes étapes du projet, de l'évaluation de l'opportunité jusqu'à l'achèvement du projet.\nCette activité porte également le nom de conduite de projet, pilotage de projet, ingénierie de projet, ou encore management de projet.", "page_id": "27967", "wikidata_id": "Q179012", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La gestion de projet est essentielle pour planifier et exécuter efficacement le développement d'une architecture de système, ce qui en fait un concept pertinent."}, {"concept": {"id": "16384365-b375-49f3-af7d-26f647af9d38", "label": "Real Time Clarity", "definition": "Capacité à obtenir une compréhension immédiate et précise des données ou situations actuelles pour une prise de décision rapide.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La clarté en temps réel est essentielle pour comprendre les données d'un système d'information, ce qui est crucial lors de la conception de son architecture."}, {"concept": {"id": "c046e017-bd93-494e-935f-03880b12ef92", "label": "Spécifications du produit", "definition": "Détails techniques et exigences précises concernant un produit ou service demandé par le client.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": {"label": "Spécification (norme technique)", "definition": "Une spécification est un ensemble explicite d'exigences à satisfaire par un matériau, produit ou service. Si un matériau, produit ou service ne parviennent pas à satisfaire à une ou plusieurs des spécifications applicables, il peut être désigné comme étant hors spécification.\nUne spécification technique peut être développée en privé, par exemple, par une société, un organisme de réglementation, ou une organisation militaire, ou bien elle peut être développée par des organismes de normalisation qui sont souvent plus amenés à développer des normes volontaires (ces normes volontaires pouvant devenir obligatoires si elles sont adoptées par un du gouvernement ou un contrat d'entreprise).", "page_id": "79499", "wikidata_id": "Q2101564", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les spécifications du produit sont cruciales pour définir les exigences techniques nécessaires lors de la conception d'une architecture de système."}, {"concept": {"id": "dadb4cae-ecdd-4562-ad1c-c4f863b80368", "label": "Design digital", "definition": "Discipline qui englobe la création d'éléments visuels et de contenus numériques, incluant l'interface utilisateur (UI) et l'expérience utilisateur (UX), intégrant esthétique et fonctionnalité tout en influençant l'expérience utilisateur et le marketing moderne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696, 13699, 13701], "aliases": ["37366e80-dc38-4858-88b6-e28fcdd1db5d", "b664875f-3175-4572-8451-a28607cf63e8", "a1e23201-bb06-4457-b988-61590e500cb9"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Design digital' est très pertinent car il englobe des éléments essentiels comme l'interface utilisateur et l'expérience utilisateur qui sont cruciaux dans la conception d'un système."}, {"concept": {"id": "0edf2749-c81c-43eb-9df3-80cccb6cce55", "label": "Organiser", "definition": "Disposer des éléments de manière structurée pour améliorer la clarté et la lisibilité des informations présentées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Organiser", "definition": "put into a proper or systematic order", "name": "arrange.v.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "Organiser est un concept clé dans la création de cartographies fonctionnelles, car il s'agit de structurer les informations pour une meilleure clarté et lisibilité."}, {"concept": {"id": "6b7099eb-a61e-4517-9ce3-81e0edfcee4e", "label": "Règles d'insertion", "definition": "Directives précises sur la manière dont les éléments graphiques doivent être disposés sur divers supports pour maintenir l'harmonie visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13677], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les règles d'insertion aident à maintenir l'harmonie visuelle dans une présentation graphique, ce qui est important lors de la création d'une cartographie fonctionnelle."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La lisibilité est importante pour assurer que les documents techniques soient clairs et compréhensibles, ce qui est essentiel dans une cartographie fonctionnelle."}, {"concept": {"id": "3f184a33-971f-4946-a8d3-ed21a6289e37", "label": "Éléments de présentation", "definition": "Composants variés (logos, maquettes) inclus dans le dossier final pour illustrer le processus créatif et les résultats obtenus.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13690], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les éléments de présentation sont importants pour illustrer une cartographie fonctionnelle et peuvent aider à communiquer efficacement les résultats du processus de conception."}, {"concept": {"id": "46f98aa1-718b-4130-a429-5e0c698e2f72", "label": "Design Thinking", "definition": "Méthodologie centrée sur l'utilisateur visant à résoudre des problèmes complexes par l'empathie, la définition, l'idéation, le prototypage et le test.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680], "aliases": [], "wikientity": {"label": "Démarche design", "definition": "Une démarche design ou conception créative (en anglais : design thinking) est une méthode de gestion de l'innovation élaborée à l'université Stanford aux États-Unis dans les années 1980 par Rolf Faste.\nCette méthode, qui se veut une synthèse entre pensée analytique et pensée intuitive, relève du design collaboratif, pratique du design qui implique les usagers dans un processus de co-créativité.", "page_id": "7876435", "wikidata_id": "Q1200670", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Design Thinking' est pertinent car il met l'accent sur une approche centrée sur l'utilisateur qui peut guider le développement de systèmes adaptés aux besoins réels."}, {"concept": {"id": "008d5789-6187-488a-86aa-9faf7453aed1", "label": "Questions Essentielles", "definition": "Interrogations clés posées au client pour clarifier ses besoins et attentes avant le début d'un projet créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les Questions Essentielles sont cruciales pour comprendre les besoins du client avant de concevoir un système, ce qui en fait un concept pertinent pour établir une cartographie fonctionnelle."}, {"concept": {"id": "60a2b77b-d4ec-4234-811d-9ae2c333e8a5", "label": "Branches principales", "definition": "Catégories majeures dérivées du sujet central dans un mind map, représentant les thèmes principaux à explorer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Branches principales' évoque une structuration thématique qui peut aider à visualiser les différentes composantes d'un système lors de sa cartographie."}, {"concept": {"id": "4c7bd337-41a5-4fa5-be76-8ba4d625aba3", "label": "Dépendances", "definition": "Les dépendances désignent les relations entre différentes tâches dans un projet, où certaines doivent être complétées avant que d'autres puissent commencer. Elles incluent également les bibliothèques, modules ou packages externes nécessaires au bon fonctionnement d'un logiciel, gérées par des outils comme Composer ou d'autres gestionnaires de paquets pour éviter les conflits et assurer une intégration harmonieuse. La gestion des dépendances est cruciale lors de la construction d'images Docker, garantissant que toutes les ressources nécessaires sont disponibles et correctement configurées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13616, 13682, 13629, 13646], "aliases": ["9bea9086-d32a-43ce-9c7b-b43fa8ca722f", "5b3faef6-87f6-4964-b875-afcd1b03f286", "73db64f4-c345-4052-964e-c6f9e45c0b54"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les dépendances sont cruciales pour la conception de l'architecture d'un système, car elles déterminent comment les différentes parties interagissent et s'appuient les unes sur les autres."}, {"concept": {"id": "bf9dcd29-03f3-4cd8-a076-8331895e019d", "label": "KPI (Indicateurs Clés de Performance)", "definition": "Les KPI, ou Indicateurs Clés de Performance, sont des mesures quantifiables utilisées pour évaluer le succès et l'efficacité d'un produit, service ou stratégie marketing. Ils jouent un rôle essentiel dans le suivi des performances des équipes, notamment dans les objectifs DevOps, en facilitant la prise de décisions éclairées et en permettant d'ajuster les actions si nécessaire.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676, 13644], "aliases": ["87e70941-61ac-4056-9449-16f5a2eb30de", "73f1aa64-cede-40bc-b84c-46a66b3d5549"], "wikientity": {"label": "Indicateur clé de performance", "definition": "Un indicateur clé de performance (ICP) – en anglais : key performance indicator (KPI) – est un indicateur utilisé pour l'aide à la décision dans les organisations. Les ICP sont utilisés particulièrement en gestion de la performance organisationnelle.", "page_id": "1432151", "wikidata_id": "Q860554", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Les KPI sont essentiels pour évaluer les performances d'un système, ce qui peut être pertinent lors de la conception de sa cartographie fonctionnelle."}, {"concept": {"id": "137a1b7b-5295-4717-a31c-50ad7854381b", "label": "Lien visuel", "definition": "Relation entre différents éléments graphiques qui aide à établir des connexions logiques ou thématiques dans une présentation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le lien visuel aide à établir des connexions logiques entre différents éléments dans une présentation, ce qui peut être utile dans une cartographie fonctionnelle."}, {"concept": {"id": "b73d77d1-523f-4328-a45c-d7b91e2a52ff", "label": "Méthode de l'entonnoir", "definition": "Technique de collecte d'informations pour clarifier un projet, facilitant la compréhension et la communication des idées créatives.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La méthode de l'entonnoir aide à clarifier les projets, ce qui peut être utile lors de la conception architecturale d'un système."}, {"concept": {"id": "c3fa5716-aedd-4faf-a2f9-b805c8102d83", "label": "Lexique client", "definition": "Ensemble de termes spécifiques utilisés par le client, révélant ses priorités et nuances essentielles pour comprendre son brief.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un lexique client peut aider à mieux comprendre les besoins spécifiques lors de la conception d'un système, rendant ce concept assez pertinent."}], "exercises": [{"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un outil clé dans la conception de l'architecture d'un système d'information (SI). La question cible spécifiquement l'objectif principal du wireframe, ce qui est pertinent par rapport à la référence sur la cartographie fonctionnelle du SI. Cependant, bien que cela touche un aspect important de la conception, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à l'analyse des besoins ou à l'organisation hiérarchique mentionnée dans la synthèse. Cela aurait permis une évaluation plus complète des compétences nécessaires pour concevoir efficacement un SI."}, {"exercise": {"id": "cfb5a24978ac4fb2bf3fa2db59ed0ebe", "question": "Quelle est l'utilité des wireframes dans le processus de création web?", "answers": ["Ils servent de base à la conception des maquettes web"], "distractors": ["Ils déterminent exclusivement les couleurs du site.", "Ils fournissent uniquement le texte du contenu.", "Ils remplacent les graphiques finaux sur le site.", "Ils sont créés en dernier après la conception graphique.", "Ils indiquent exactement où placer les images.", "Ils proposent les logos nécessaires pour le site web.", "Ils permettent d'ajuster uniquement la navigation visuelle.", "Ils représentent essentiellement l'esthétique finale du site.", "Ils s'occupent de la gestion du back-end du projet."], "feedback": "Les wireframes servent de base pour la conception des maquettes web en organisant les éléments et la navigation du site. Ils ne déterminent pas exclusivement l'esthétique finale du site, mais sont plutôt un guide pour respecter les fonctionnalités souhaitées par le client et le budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'utilité des wireframes dans le processus de création web, ce qui est un concept clé abordé dans la référence concernant les outils et techniques de conception. Bien que la question soit pertinente et liée à la cartographie fonctionnelle du système d'information (SI), elle pourrait être améliorée en intégrant davantage d'éléments sur l'organisation hiérarchique et l'arborescence, ainsi que sur leur impact sur la navigation et l'accès aux données. Néanmoins, il teste efficacement une compétence essentielle pour concevoir un SI adapté aux besoins du client."}, {"exercise": {"id": "d98bc70a159f4f99ada0181438d991b5", "query": "Le wireframe se concentre principalement sur <blank>, sans s'occuper de l'aspect visuel ou du graphisme.", "answers": ["l'organisation des éléments et des formes"], "distractors": [["la création des images et vidéos finales", "la mise en forme graphique", "la palette de couleurs et typographie", "la réalisation des animations interactives", "l'optimisation des performances", "le développement du code fonctionnel"]], "feedback": "La bonne réponse est 'l'organisation des éléments et des formes' car le wireframe a pour but de déterminer la disposition structurelle des blocs comme les textes, images, ou vidéos, tout en ne tenant pas compte des détails graphiques qui seront travaillés ultérieurement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un concept clé lié à la conception du système d'information, en particulier l'utilisation du wireframing. Il est pertinent car il se concentre sur l'organisation des éléments dans un wireframe, ce qui est directement lié à la cartographie fonctionnelle du SI. Cependant, bien que cela soit important, l'exercice pourrait être amélioré en intégrant des aspects supplémentaires de la conception et de l'architecture du SI pour couvrir plus largement les objectifs d'apprentissage mentionnés dans la référence."}, {"exercise": {"id": "a9e39306cb3b4f74b096fd9dd4b2697a", "statement": "Le wireframe consiste à définir l'organisation des éléments et des formes tout en travaillant l'aspect visuel.", "veracity": false, "feedback": "Le wireframe se concentre sur l'organisation des éléments comme les images, textes ou vidéos sans travailler l'aspect visuel. Le graphisme n'intervient qu'à une étape ultérieure du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un outil clé dans la conception de l'architecture d'un système d'information (SI). La question teste la capacité de l'apprenant à distinguer entre les différentes phases de conception, en particulier en ce qui concerne le rôle du wireframe par rapport à l'aspect visuel. Bien que l'exercice soit pertinent et touche un aspect important de la cartographie fonctionnelle, il pourrait être amélioré en intégrant des éléments supplémentaires liés à l'analyse des besoins ou à la gestion de projet pour couvrir plus largement les objectifs d'apprentissage associés à la référence."}, {"exercise": {"id": "df6d8e1ef0c24891972ea92c71fd1f92", "statement": "Le contenu utilisé dans le wireframe peut être fictif si les informations finales ne sont pas encore disponibles.", "veracity": true, "feedback": "Il est mentionné que les informations finales ne sont pas toujours connues à ce stade du projet, donc un contenu fictif peut être utilisé pour organiser le wireframe.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception du système d'information, en particulier l'utilisation de wireframes. Il est pertinent car il aborde un aspect fondamental de la phase de conception, où le contenu fictif peut être utilisé pour créer des maquettes avant que les informations finales ne soient disponibles. Cependant, bien qu'il soit en lien avec le sujet, l'exercice pourrait être amélioré en intégrant des questions qui explorent davantage les autres dimensions mentionnées dans la synthèse, comme l'organisation hiérarchique ou la gestion de projet."}, {"exercise": {"id": "dc3a6dfc15ca475496a486da3bde2aa8", "statement": "Les outils mentionnés servent uniquement à créer des documents internes pour l'équipe de projet.", "veracity": false, "feedback": "Ces outils ne sont pas utilisés uniquement en interne, mais plutôt pour communiquer et aligner les idées avec les clients ou les parties prenantes. Leur objectif est de faciliter la compréhension mutuelle du résultat attendu entre différentes parties prenantes extérieures à l'équipe de projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1cc8dc888f674583a957f2a782085892", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les deux outils sont utilisés pour communiquer et aligner les idées avec les clients ou les parties prenantes concernées. Cependant, le Stylescape va plus loin en offrant une représentation plus complète et immersive de l'expérience visuelle attendue, ce qui facilite la compréhension et la visualisation du résultat final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "088d4c7f46de40f0986cfa0cc08bc0bc", "prev_id": "ec3a9e230f6943ae8c0b2d363898bc4d", "associated_block_ids": [], "first_page": 19, "last_page": 19, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des outils et techniques de conception, en particulier leur rôle dans la communication avec les parties prenantes, ce qui est un aspect clé de la référence. Bien que l'affirmation porte sur une utilisation spécifique des outils, elle permet d'aborder le concept plus large de leur fonction dans le processus de conception du système d'information. Cependant, l'exercice pourrait être amélioré en incluant des questions qui touchent davantage à la cartographie fonctionnelle ou à l'organisation hiérarchique du SI."}, {"exercise": {"id": "7a9bfae2718c4ec894908d42d69a0337", "question": "Quel est l'objectif principal d'un design system ?", "answers": ["Créer un système standardisé englobant tous les éléments graphiques et visuels"], "distractors": ["Faciliter uniquement la communication entre développeurs sans autres éléments.", "Améliorer la sécurité des données en développement produit.", "Se concentrer sur le développement du backend d'un produit.", "Optimiser exclusivement la performance technique des produits numériques.", "Gérer les bugs et correctifs de manière centralisée.", "Automatiser entièrement le processus de développement logiciel.", "Organiser tous les tests de performance pour un projet donné.", "Encourager l’utilisation des frameworks open-source dans le produit.", "Développer des environnements virtuels pour les phases de tests."], "feedback": "L'objectif principal d'un design system est de regrouper tous les éléments visuels et graphiques, ainsi que les règles, le branding et le ton dans un système standardisé pour faciliter le processus de développement et assurer cohérence et efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de systèmes d'information, en particulier le design system, qui est mentionné dans la synthèse. Bien que l'exercice ne couvre pas tous les aspects de la cartographie fonctionnelle du SI, il aborde un élément essentiel qui contribue à l'organisation et à la cohérence visuelle des interfaces utilisateur. La question permet de tester si l'apprenant comprend bien le rôle d'un design system dans le cadre plus large de la conception d'un système. Cependant, une note légèrement inférieure est attribuée car l'exercice pourrait être enrichi par des questions portant sur d'autres concepts abordés dans la synthèse, comme l'analyse des besoins ou les KPI."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé mentionné dans la référence, à savoir le design system, qui est un outil essentiel pour concevoir l'architecture d'un système. La question cible directement l'objectif de standardisation des éléments graphiques, ce qui est pertinent pour la conception d'une cartographie fonctionnelle du SI. Cependant, bien que cela soit en lien avec la conception et l'organisation du système, l'exercice pourrait être amélioré en intégrant des questions sur d'autres aspects comme l'analyse des besoins ou la gestion de projet, afin de couvrir plus largement les compétences nécessaires à la conception de systèmes. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "e11c2ad84ac74e07a8f72c3b516e8280", "statement": "Un design system ne concerne que les éléments graphiques d'un produit.", "veracity": false, "feedback": "Un design system englobe non seulement les éléments graphiques, mais aussi des aspects comme les règles, le branding et le ton, afin de créer un système standardisé réunissant tous les points de contact entre les acteurs du développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception du système d'information, en particulier le design system. Bien que l'affirmation porte spécifiquement sur les éléments graphiques, elle touche également à des aspects plus larges de la conception qui sont mentionnés dans la synthèse, tels que la cohérence visuelle et l'organisation des informations. Cependant, l'exercice pourrait être amélioré en intégrant des questions qui abordent directement d'autres concepts importants comme l'analyse des besoins ou la gestion de projet, afin de couvrir une gamme plus large des compétences nécessaires pour concevoir une cartographie fonctionnelle du SI."}, {"exercise": {"id": "8f28a9f88d34427b97ac8306108b18b3", "statement": "Le but principal d'un design system est de standardiser les éléments liés au développement d'un produit pour garantir la cohérence.", "veracity": true, "feedback": "Le but d'un design system est effectivement de regrouper graphiques, règles, branding, ton, etc. en un seul système, assurant ainsi une cohérence dans le contact avec les différents acteurs participant au développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de systèmes d'information, en particulier l'importance d'un design system pour assurer la cohérence visuelle et fonctionnelle. Bien que l'exercice ne couvre pas tous les aspects de la cartographie fonctionnelle du SI, il aborde un élément essentiel qui contribue à une bonne architecture et organisation des informations au sein du système. La réponse correcte et l'explication fournie montrent une bonne maîtrise de ce concept, mais il aurait été bénéfique d'inclure des éléments supplémentaires sur l'analyse des besoins ou la gestion de projet pour obtenir une note parfaite."}, {"exercise": {"id": "93e7ef85a293427fa476fcf9bd39ab01", "question": "Quelle étape précède généralement la réalisation du zoning lors d’un projet web ?", "answers": ["La création de l’arborescence"], "distractors": ["La définition du cahier des charges", "Le développement de la base de données", "La mise en place des tests utilisateurs", "L’optimisation de la vitesse de chargement", "La proposition de maquettes aux parties prenantes", "La sélection des outils de gestion de projet", "L’écriture du contenu rédactionnel", "La validation finale du client", "La configuration des serveurs"], "feedback": "Avant de procéder au zoning, il est nécessaire de définir la structure du site à travers une arborescence. Cela permet d'avoir une vision globale de l'organisation des pages et des contenus. Ainsi, le zoning peut être réalisé en parallèle de la création de l'arborescence.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'organisation hiérarchique et de l'arborescence, qui sont des éléments clés dans la conception d'un système d'information (SI) selon la référence. La question sur l'étape précédant le zoning est pertinente car elle touche à la planification et à la structuration nécessaires avant de concevoir une cartographie fonctionnelle. Cependant, bien que cela soit lié aux concepts abordés, l'exercice pourrait être amélioré en intégrant des aspects plus larges de la conception du SI, comme l'analyse des besoins ou les outils de conception mentionnés dans la synthèse. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "9ffa467f37084a368ad722d16d9aebc8", "query": "Le zoning permet de définir l'organisation générale des pages après la création de <blank>.", "answers": ["l'arborescence"], "distractors": [["les wireframes", "la charte graphique", "le prototype", "les maquettes", "l'interface", "le contenu"]], "feedback": "La bonne réponse est 'l'arborescence', car le zoning intervient généralement après que l'arborescence a été créée. L'arborescence correspond à la structure hiérarchique du site, tandis que le zoning s'intéresse à la répartition des blocs de contenu sur les pages. Les autres réponses sont incorrectes car elles concernent des étapes ou éléments distincts dans le processus de conception web (wireframes, maquettes, etc.).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension de l'arborescence, qui est un concept clé dans la conception d'un système d'information (SI) et est mentionné dans la synthèse. Cependant, il se concentre uniquement sur un aspect spécifique du processus de conception (le zoning) sans aborder d'autres éléments importants comme l'analyse des besoins ou les outils de conception. Bien qu'il soit pertinent, il ne couvre pas entièrement la portée de la référence qui inclut plusieurs dimensions de la cartographie fonctionnelle du SI."}, {"exercise": {"id": "4c03f6a0173c41d68cc1d8eb88688d21", "question": "Qu'englobe généralement un design system dans le processus de création d'un produit ?", "answers": ["Les éléments graphiques, visuels, règles, ton, branding, etc"], "distractors": ["Les fonctionnalités techniques, algorithmes et optimisation de performances.", "Les vecteurs de sécurité et protocoles cryptographiques pour le produit.", "Le suivi exclusif des tests utilisateurs et retours clients.", "La gestion complète des bases de données et serveurs.", "Les diagrammes UML et documentation interne sur l’architecture produit.", "La conception des interfaces hardware et leurs connectiques.", "Les outils de déploiement cloud et gestion continue du produit.", "La rédaction de contrats juridiques et gestion de licences.", "L'analyse des statistiques de vente et tendances du marché."], "feedback": "Un design system englobe généralement tous les éléments liés à l'apparence et l'identité d'un produit, tels que les graphiques, les règles de style, le ton et le branding. Cela permet une création plus cohérente et efficace du produit, en assurant une identité visuelle unifiée et identifiable par les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception du système d'information, en particulier le design system, qui est mentionné dans la synthèse. Bien que l'exercice ne couvre pas directement tous les aspects de la cartographie fonctionnelle du SI, il aborde un élément important de la conception (la cohérence visuelle) qui contribue à l'efficacité globale du système. Cependant, il aurait pu être plus pertinent s'il avait inclus des éléments spécifiques sur l'organisation hiérarchique ou l'analyse des besoins du client, qui sont également cruciaux pour concevoir une cartographie fonctionnelle efficace."}, {"exercise": {"id": "388525c44d4749319aec5fc378adefa3", "statement": "Un design system se limite uniquement aux éléments graphiques et visuels d'un produit.", "veracity": false, "feedback": "Un design system ne se limite pas uniquement aux éléments graphiques et visuels. Il inclut également des règles, des éléments de branding, le ton, et d'autres points de contact relatifs au produit, afin de créer un système cohérent et standardisé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception du système d'information, en particulier le design system. Bien que l'affirmation porte sur un aspect spécifique de la conception, elle est pertinente car elle touche à la nécessité d'une approche cohérente dans la création d'un SI. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à la cartographie fonctionnelle ou à l'organisation hiérarchique du SI, qui sont également des aspects cruciaux mentionnés dans la référence."}, {"exercise": {"id": "fcf86d429da24f679769741afa7e8165", "question": "À quoi sert principalement le zoning dans le processus de création d'une page web ?", "answers": ["À schématiser la disposition du contenu et des fonctionnalités"], "distractors": ["À détailler le design final de la page", "À définir la palette de couleurs utilisée", "À créer une carte des utilisateurs", "À programmer les différentes fonctionnalités", "À choisir les outils graphiques à utiliser", "À écrire le contenu de la page", "À optimiser le SEO de la page web", "À définir les standards de performance", "À tester la compatibilité sur différents navigateurs"], "feedback": "Le zoning sert principalement à schématiser la disposition du contenu et des fonctionnalités sur une page web, en utilisant des blocs pour représenter les différents éléments. Il intervient généralement après la création de l'arborescence, qui définit l'organisation globale du site, et permet ainsi de valider ou ajuster les grandes lignes avant de passer aux étapes suivantes de conception.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur le zoning dans la création d'une page web, ce qui est pertinent pour la conception d'interfaces et s'inscrit dans le cadre des outils et techniques de conception mentionnés dans la référence. Cependant, il ne traite pas directement de la cartographie fonctionnelle du système d'information (SI) ni de l'architecture réseau, qui sont des aspects centraux de la référence. Bien que l'exercice évalue une compétence liée à l'organisation et à la structure, il manque un lien direct avec les exigences spécifiques de la cartographie fonctionnelle du SI. C'est pourquoi il obtient une note intermédiaire."}, {"exercise": {"id": "da35feb49e864dec9be4a552fb20bd03", "query": "Les wireframes servent de base aux web designers pour <blank>, tout en respectant les souhaits et contraintes validés par le client.", "answers": ["la conception des maquettes"], "distractors": [["la gestion du budget", "le développement des fonctionnalités", "la maintenance du site", "la création du contenu", "l'organisation des réunions", "l'élaboration de scripts"]], "feedback": "Les wireframes sont des schémas représentant la structure d'une page web. Ils guident les web designers dans la phase créative appelée 'conception des maquettes', qui consiste à traduire ces schémas en une interface visuelle définitive. Les autres options, comme la maintenance du site ou la gestion du budget, relèvent de processus différents qui n’interviennent pas directement dans cette phase.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept clé lié à la conception du système d'information, en particulier l'utilisation des wireframes dans le processus de création. Cependant, bien qu'il soit pertinent pour le sujet de la cartographie fonctionnelle et de l'architecture du système, il ne couvre pas directement tous les aspects mentionnés dans la référence, tels que l'analyse des besoins ou l'organisation hiérarchique. L'exercice pourrait être amélioré en intégrant des éléments qui évaluent également la compréhension des exigences clients ou de l'arborescence dans le contexte de la conception du SI."}, {"exercise": {"id": "a286d7d9d1844bed865e42b39a918f65", "statement": "Les wireframes valides sont immuables et ne peuvent en aucun cas être modifiés par les créatifs.", "veracity": false, "feedback": "Bien que les wireframes valides constituent la base du travail, ils ne sont pas immuables. Les web designers peuvent ajuster l'organisation des éléments et le système de navigation, tant qu'ils respectent les fonctionnalités validées par le client et restent dans les limites du budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des wireframes, qui sont un outil de conception mentionné dans la synthèse. Cependant, il ne couvre pas directement la cartographie fonctionnelle du système d'information (SI) ni l'architecture du réseau, qui sont les éléments centraux de la référence. Bien que pertinent pour le processus de conception, l'exercice pourrait être amélioré en intégrant des questions plus directement liées à la création et à l'organisation de la cartographie fonctionnelle elle-même."}, {"exercise": {"id": "f3dc4db503a64d7696628bc1bc7eeb26", "question": "Quels éléments sont inclus dans un design system ?", "answers": ["Les règles visuelles, graphiques, de branding et de ton"], "distractors": ["Uniquement des animations interactives de prototype", "Exclusivement des directives de sécurité informatique", "Des instructions relatives à l'expérience utilisateur", "Le suivi des communications internes à l'entreprise", "La gestion des équipes et des plannings", "Plans détaillés pour la stratégie publicitaire", "Une charte définissant les différents KPI", "Le modèle économique de l'entreprise", "La liste des formats de fichier utilisés"], "feedback": "Un design system regroupe tous les éléments nécessaires pour guider la création des produits et services d'une entreprise, tels que les règles visuelles, graphiques, de branding et de ton. Cela permet de maintenir une cohésion et une identité forte pour la marque.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'un concept clé lié à la conception du système d'information, en particulier le design system, qui est mentionné dans la synthèse. Cependant, bien que cela soit pertinent, l'exercice ne couvre pas directement la cartographie fonctionnelle du SI ni les étapes préliminaires comme l'analyse des besoins ou le diagnostic. Il se concentre sur un aspect spécifique (le design system) sans évaluer de manière plus globale la compréhension des processus nécessaires pour concevoir une architecture de système. Par conséquent, il obtient une note intermédiaire car il est pertinent mais pas entièrement aligné avec l'ensemble des objectifs d'apprentissage."}], "sources": [{"document": {"id": 13691, "label": "Sequence 4_choix entre stylescape ou moodboard", "authors": [], "title": "Stylescape et Moodboard : Outils de Design Visuel", "content": [], "mime_type": "application/pdf", "short_summary": "Le Stylescape est une approche créative qui présente visuellement l'identité d'un projet de design, tandis que le moodboard sert à rassembler des inspirations. Le Stylescape se concentre sur une composition intentionnelle et précise, offrant une vision immersive du projet final.", "long_summary": "- Le Stylescape est utilisé dans le design graphique et l'identité visuelle.\n- Il met l'accent sur l'ambiance générale plutôt que sur les détails spécifiques.\n- Combine typographie, couleurs, images et éléments graphiques pour créer une représentation cohérente.\n- Aide à communiquer efficacement avec les clients sur la vision du projet.\n- Comprendre le brief est essentiel pour refléter fidèlement la vision du client.\n- Rassemblez des inspirations variées provenant de différentes sources.\n- Sélectionnez les éléments visuels qui capturent l'essence du projet.\n- Utilisez des logiciels comme Photoshop ou Illustrator pour composer le Stylescape.\n- Racontez une histoire visuelle cohérente avec les éléments choisis.\n- Présentez le Stylescape aux clients en expliquant vos choix et intentions.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/0D0xJo5p6o8h3dJ8/documents/6a13b24_sequence-4_choix-entre-stylescape-ou-moodboard.pdf", "external_url": null, "path": null, "corpus_id": 639, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Big data for private business. Welcome to the bleeding edge of business technology.\n\n- business lens\n===\n\n  - ## Big data for small business.\n", "number_of_pages": 22, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}, "is_teacher": null}, "score": 4.8, "top_pages": [22, 13], "top_minutes": []}]}