{"introduction": "La conception d'une application web implique une multitude de disciplines et de processus qui visent à créer un produit numérique fonctionnel et attrayant. Ce cours explore les concepts clés nécessaires pour développer efficacement un logiciel ou un système d'information, en mettant l'accent sur l'expérience utilisateur, le design, la gestion de projet et les meilleures pratiques techniques.", "synthesis": "Le développement d'un projet web commence par une compréhension claire des activités liées à sa création. Cela inclut la conception d'expérience utilisateur (UX), qui se concentre sur l'optimisation des interactions entre les utilisateurs et le produit numérique. Les designers UX et UI jouent un rôle crucial dans ce processus en s'assurant que les interfaces sont intuitives et esthétiques, répondant ainsi aux besoins des utilisateurs.\n\nLa conception et le design web englobent également l'esthétique et la fonctionnalité des interfaces numériques. L'utilisation de méthodes comme l'Atomic Design permet de décomposer ces interfaces en composants réutilisables, favorisant ainsi une construction modulaire. Parallèlement, le Design Thinking offre une approche centrée sur l'utilisateur pour résoudre des problèmes complexes à travers différentes phases telles que l'empathie et le prototypage.\n\nLe wireframing est essentiel pour visualiser la structure d'une interface avant son développement final, facilitant la communication entre les membres de l'équipe. En outre, le design digital intègre divers éléments visuels qui influencent non seulement l'expérience utilisateur mais aussi le marketing moderne.\n\nPour garantir la cohérence dans le développement d'applications, un design system standardisé peut être mis en place. Cela inclut des éléments graphiques réutilisables qui assurent une expérience homogène à travers différents produits. La mise en page joue également un rôle clé dans la clarté du message transmis par une interface.\n\nLa gestion de projet est indispensable pour planifier et superviser toutes ces étapes tout en respectant les contraintes budgétaires. Des outils tels que le suivi et mise à jour permettent d'ajuster continuellement le plan selon les imprévus rencontrés durant le développement.\n\nEnfin, il est crucial d'analyser les besoins du client afin de fournir des solutions adaptées tout en intégrant des bonnes pratiques UI pour optimiser l'interaction avec les utilisateurs. Le SEO (Search Engine Optimization) vient compléter cette démarche en améliorant la visibilité du site sur les moteurs de recherche grâce à des techniques spécifiques visant à attirer un trafic organique accru.", "concepts": [{"concept": {"id": "b7526477-65bb-452f-a068-5d83bd100ed1", "label": "Projet web", "definition": "Ensemble des activités liées à la création et au développement d'un site internet ou d'une application en ligne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le projet web est directement lié à la création et au développement d'une application en ligne, ce qui en fait un concept central pour concevoir une application web."}, {"concept": {"id": "baebe016-d0cc-4e32-9346-f7e1124193a3", "label": "Conception d'Expérience Utilisateur (UX)", "definition": "La conception d'expérience utilisateur (UX) est une discipline centrée sur l'optimisation des interactions entre les utilisateurs et les produits ou services numériques. Elle vise à améliorer la satisfaction et l'efficacité de l'utilisation en créant des interfaces utilisateur intuitives et attrayantes, tout en tenant compte des comportements, besoins cognitifs et préférences des utilisateurs finaux. Ce processus englobe à la fois l'esthétique et la fonctionnalité, influençant ainsi l'expérience globale par des choix visuels et structurels. Les professionnels tels que les designers UX et UI travaillent à établir des interactions significatives, simplifiant l'interaction utilisateur tout en gérant la complexité sous-jacente du système.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13609, 13709], "aliases": ["dbb0eb49-384a-4835-8a27-f3df10e75759", "91010b14-36ae-419d-bf38-a846de1275f6", "574e83b8-4354-48fa-850e-93c5120ebc83", "ecf19b49-88ec-4c4c-a1b6-95ffa690e97f", "25934ed3-33c1-4498-8e65-074291667094", "796f5e0a-7a74-4541-adfb-b2193ad73b61", "a23c6da5-a4ab-4891-991e-7b937aa0abdc", "37ee1509-2635-464b-9584-a9b0c9d9c8ad", "c00973e6-b1c9-4905-942b-5be484cb15c3", "d4bcea8d-2203-4129-9886-2b5a3d013def", "10afcc11-a32f-4ff7-b2c9-b91fd8f41279", "bfa65925-0083-4475-bf52-1b49b880a8ef", "172c8581-4218-4949-9879-3623e9c81b76", "84c2a388-034d-4adb-8881-3d024eed3a5c", "54158781-d4d4-4026-a63f-e0e8693a8902", "9f681d3a-0c7c-4485-9bcf-e52381ff9719", "da83989a-f0e2-4e84-b8e1-dbb6cfe0e312"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "La conception d'expérience utilisateur (UX) est fondamentale pour créer une application web efficace et attrayante, influençant directement la satisfaction des utilisateurs."}, {"concept": {"id": "681bd960-0547-4e06-81c7-c87e899af05b", "label": "Conception et design web", "definition": "La conception et le design web désignent le processus de création d'interfaces numériques qui allient esthétique et fonctionnalité pour optimiser l'expérience utilisateur. Cela inclut la conception de l'interface utilisateur, l'intégration des éléments du site de manière accessible et fonctionnelle, ainsi que la prise en compte des palettes de couleurs et des tendances modernes telles que la commande vocale et le mode sombre. L'objectif est de rendre les sites non seulement attrayants mais aussi faciles à naviguer, répondant ainsi aux besoins contemporains des utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13692], "aliases": ["408a71e5-2328-4efc-b763-2f6ddd50204c", "b73e3b1f-6972-406b-82f8-69acf4925e52", "e970bfbc-ec61-4fbe-a66a-e65a0ad0ba8c", "4384a27b-4e99-442c-bbc8-dfa1980e56fe", "dec0a245-63b1-4b4c-bce7-12be12f6d362"], "wikientity": {"label": "Conception de site web", "definition": "La conception  et la création site web ou web design est la conception de l'interface web : l’architecture interactionnelle, l’organisation des pages, l’arborescence et la navigation dans un site web. La conception d'un design web tient compte des contraintes spécifiques du support Internet, notamment en matière d’ergonomie, d’utilisabilité et d’accessibilité.\nLe web design réclame donc des compétences en programmation, en ergonomie et en interactivité, ainsi qu'une bonne connaissance des contraintes techniques liées à ce domaine.", "page_id": "807249", "wikidata_id": "Q190637", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La conception et design web sont fondamentaux pour créer une interface numérique attrayante et fonctionnelle, ce qui est essentiel dans le contexte de concevoir une application web."}, {"concept": {"id": "428549b4-6b1b-49f2-afdf-65890ef5cd30", "label": "Atomic Design", "definition": "L'atomic design est une méthode systématique de conception d'interface qui décompose les interfaces en composants plus petits et réutilisables, permettant ainsi une construction modulaire, évolutive et favorisant une meilleure cohérence visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13680], "aliases": ["0164746b-3388-423b-a975-eb1cb6dcd3b7"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "L'Atomic Design est une méthode clé pour structurer et concevoir des interfaces modulaires et réutilisables dans le cadre du développement d'applications web."}, {"concept": {"id": "46f98aa1-718b-4130-a429-5e0c698e2f72", "label": "Design Thinking", "definition": "Méthodologie centrée sur l'utilisateur visant à résoudre des problèmes complexes par l'empathie, la définition, l'idéation, le prototypage et le test.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680], "aliases": [], "wikientity": {"label": "Démarche design", "definition": "Une démarche design ou conception créative (en anglais : design thinking) est une méthode de gestion de l'innovation élaborée à l'université Stanford aux États-Unis dans les années 1980 par Rolf Faste.\nCette méthode, qui se veut une synthèse entre pensée analytique et pensée intuitive, relève du design collaboratif, pratique du design qui implique les usagers dans un processus de co-créativité.", "page_id": "7876435", "wikidata_id": "Q1200670", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le Design Thinking est central à la conception d'applications car il met l'accent sur l'empathie et l'utilisateur final, ce qui est essentiel pour créer des solutions efficaces et adaptées aux besoins des utilisateurs."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le wireframing est central à la conception d'applications web car il permet de visualiser et clarifier la structure de l'interface utilisateur avant le développement."}, {"concept": {"id": "dadb4cae-ecdd-4562-ad1c-c4f863b80368", "label": "Design digital", "definition": "Discipline qui englobe la création d'éléments visuels et de contenus numériques, incluant l'interface utilisateur (UI) et l'expérience utilisateur (UX), intégrant esthétique et fonctionnalité tout en influençant l'expérience utilisateur et le marketing moderne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696, 13699, 13701], "aliases": ["37366e80-dc38-4858-88b6-e28fcdd1db5d", "b664875f-3175-4572-8451-a28607cf63e8", "a1e23201-bb06-4457-b988-61590e500cb9"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le Design digital est central à la création d'applications web, englobant tous les aspects visuels et fonctionnels nécessaires pour une expérience utilisateur réussie."}, {"concept": {"id": "6207abd4-149c-401e-b794-d375c7f214f8", "label": "Design graphique", "definition": "Le design graphique est une discipline créative qui combine texte et images pour communiquer des idées et des messages visuellement. Elle est essentielle dans le développement d'interfaces attrayantes et dans la création de supports visuels variés, utilisant des éléments visuels à travers divers médias.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13691], "aliases": ["61b1a5ce-d40d-40d4-a0a8-2362ba6ce773", "34c6adf3-adf6-473a-8f5b-849c07a9f700"], "wikientity": {"label": "Graphisme", "definition": "Le graphisme est une discipline qui consiste à créer, choisir et utiliser des éléments graphiques (dessins, caractères typographiques, photos, couleurs, etc.) pour élaborer un objet de communication et/ou de culture. Chacun des éléments est symbolique et signifiant dans la conception du projet, selon les axes définis éventuellement avec d'autres intervenants du domaine de la communication (un directeur artistique par exemple), dans le but de promouvoir, d'informer ou d'instruire.\nSelon Annick Lantenois, docteur en histoire de l'art, « le design graphique peut être défini comme le traitement formel des informations et des savoirs.", "page_id": "129200", "wikidata_id": "Q185925", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "'Le design graphique est fondamental pour concevoir une application web attrayante et fonctionnelle, intégrant texte et images pour communiquer efficacement avec les utilisateurs.'"}, {"concept": {"id": "e3db3cdb-5474-48f7-833c-0bdae33ed61a", "label": "Dossier d'Exécution", "definition": "Document technique détaillant les spécifications et les éléments nécessaires à la réalisation d'un projet, crucial pour assurer sa bonne mise en œuvre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": {"label": "Dossier des ouvrages exécutés", "definition": "Le dossier des ouvrages exécutés, ou DOE, est un document contractuel de la construction immobilière en France.", "page_id": "3606988", "wikidata_id": "Q3037354", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le dossier d'exécution est crucial pour la mise en œuvre réussie d'une application web, car il contient toutes les spécifications nécessaires au développement."}, {"concept": {"id": "46418a35-4388-41fc-a035-551226221ba5", "label": "Développement des idées", "definition": "Le développement des idées est la phase où les concepts sélectionnés sont approfondis et affinés grâce à la recherche, aux croquis et aux prototypes. Cette étape implique une exploration détaillée des meilleures idées en collaboration avec l'équipe pour assurer leur concrétisation effective.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": ["1c71f943-b98f-4d1d-bb3e-3703897438d0"], "wikientity": null, "wordnetentity": {"label": "Développement", "definition": "something grown or growing", "name": "growth.n.07", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "Le développement des idées est crucial lors de la phase de conception d'une application web, car il permet d'affiner les concepts avant leur mise en œuvre."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'expérience utilisateur et client est très pertinente car elle englobe les interactions avec l'application, ce qui est essentiel pour son succès sur le marché."}, {"concept": {"id": "1ef72a7e-5e74-4275-8671-d3b08e7e6482", "label": "Design System", "definition": "Un design system est une bibliothèque standardisée d'éléments graphiques, de composants réutilisables et de règles de branding unifiées, qui assurent la cohérence visuelle et fonctionnelle dans le développement de produits, sites ou applications. Il vise à standardiser le développement et à garantir une expérience utilisateur homogène à travers plusieurs produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13700], "aliases": ["9dbaffae-3852-4454-b66b-2adfc8c61863", "959c321e-cd66-4ef2-beec-74a58976030e"], "wikientity": {"label": "Système de design", "definition": "Un système de design, un système de conception ou un design system est un ensemble de composants réutilisables et de normes claires qui peuvent être assemblés pour créer un nombre illimité d'applications. Les systèmes de design aident à la conception de produits numériques et au développement de produits tels que des applications mobiles ou des sites Web. Ils peuvent contenir, sans toutefois s'y limiter, des bibliothèques de modèles/composants, des dictionnaires de conception, des guides de style (police, couleur, espacement, placement), des composants codés, des langages de marque et de la documentation.", "page_id": "16328891", "wikidata_id": "Q81875083", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le Design System est essentiel pour garantir la cohérence visuelle et fonctionnelle d'une application web, ce qui en fait un concept très pertinent dans le contexte de la conception d'applications."}, {"concept": {"id": "e4ae9c09-4ec8-4a59-9314-2e4c0c931e9b", "label": "Mise en page", "definition": "La mise en page (ou MEP) désigne le processus d'arrangement visuel des éléments graphiques et textuels sur une page, qu'elle soit imprimée ou numérique. Elle est essentielle pour l'expérience utilisateur sur un site web et dans d'autres supports visuels, car elle influence la lisibilité, l'esthétique, l'impact visuel et la clarté du message transmis ainsi que l'interaction avec le contenu. La MEP assure également une présentation cohérente et esthétique des documents.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13684, 13687, 13689], "aliases": ["2820af73-3b5d-4571-87ad-2c8b3b35023a", "d1811778-06d3-4715-acd2-6d6f55007f2b", "529c12dc-31c1-4106-b66d-787089356057", "1de5e449-7a2f-4249-a3c9-00fca42a6ccb"], "wikientity": {"label": "Mise en page", "definition": "La mise en page, ou mise en pages, est l'opération de disposition graphique d'un contenu informationnel dans un espace donné (feuille de papier, planche de bande dessinée, pages web, etc.).\nElle succède au travail de collecte et de composition du contenu (composition de texte « au kilomètre », collection des composants) et précède souvent le travail d'impression. Elle peut le précéder dans la mesure où elle est prédéfinie (dimensions des colonnes, styles du texte, placement des illustrations, etc.).", "page_id": "400658", "wikidata_id": "Q868954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La Mise en page est fondamentale pour l'expérience utilisateur sur une application web, influençant directement l'interaction et la clarté du contenu présenté."}, {"concept": {"id": "44ac33ba-9d4f-4b84-b241-38468732b7e0", "label": "Suivi et mise à jour", "definition": "Le suivi et la mise à jour consistent à surveiller régulièrement l'avancement du projet et ajuster le plan en fonction des imprévus.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le suivi et mise à jour sont cruciaux dans le cadre du développement logiciel pour s'assurer que le projet reste sur la bonne voie face aux imprévus."}, {"concept": {"id": "655c070c-0589-43a7-853a-0696f4560dfa", "label": "Recherche", "definition": "Phase initiale du processus créatif où des informations sont collectées pour informer le développement du projet graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13690], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La Recherche est cruciale dans le processus créatif pour collecter des informations qui guideront le développement de l'application web."}, {"concept": {"id": "e4515c79-13fd-4349-a049-bb81e6878488", "label": "Ressources nécessaires", "definition": "Les ressources nécessaires incluent tout ce qui est requis pour réaliser un projet, comme le personnel, le matériel et le budget.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les Ressources nécessaires sont essentielles pour réaliser tout projet, y compris une application web, car elles déterminent sa faisabilité et son succès."}, {"concept": {"id": "4c7bd337-41a5-4fa5-be76-8ba4d625aba3", "label": "Dépendances", "definition": "Les dépendances désignent les relations entre différentes tâches dans un projet, où certaines doivent être complétées avant que d'autres puissent commencer. Elles incluent également les bibliothèques, modules ou packages externes nécessaires au bon fonctionnement d'un logiciel, gérées par des outils comme Composer ou d'autres gestionnaires de paquets pour éviter les conflits et assurer une intégration harmonieuse. La gestion des dépendances est cruciale lors de la construction d'images Docker, garantissant que toutes les ressources nécessaires sont disponibles et correctement configurées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13616, 13682, 13629, 13646], "aliases": ["9bea9086-d32a-43ce-9c7b-b43fa8ca722f", "5b3faef6-87f6-4964-b875-afcd1b03f286", "73db64f4-c345-4052-964e-c6f9e45c0b54"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La gestion des dépendances est cruciale lors du développement logiciel, car elle assure que toutes les ressources nécessaires sont disponibles pour construire une application fonctionnelle."}, {"concept": {"id": "ae467590-b74a-463a-8b8f-0d480a17c50a", "label": "Gestion de projet", "definition": "La gestion de projet est une discipline qui consiste à appliquer des connaissances, compétences et techniques pour planifier, exécuter et superviser des projets afin d'atteindre des objectifs spécifiques dans un cadre temporel défini. Elle implique l'organisation et la planification des ressources tout en respectant les contraintes budgétaires, et elle est particulièrement cruciale dans divers domaines, y compris le domaine créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13698, 13682, 13701], "aliases": ["232cece6-e141-4a95-9074-9c0f3fa70420", "4e6d523f-1898-42bd-8663-8d1982f44771", "14b98af1-6aaa-43a4-b8a5-8b6c40a54ef9"], "wikientity": {"label": "Gestion de projet", "definition": "La gestion de projet, est l'ensemble des activités visant à organiser le bon déroulement d’un projet et à en atteindre les objectifs en temps et en heures selon les objectifs visés. Elle consiste à appliquer les méthodes, techniques, et outils de gestion spécifiques aux différentes étapes du projet, de l'évaluation de l'opportunité jusqu'à l'achèvement du projet.\nCette activité porte également le nom de conduite de projet, pilotage de projet, ingénierie de projet, ou encore management de projet.", "page_id": "27967", "wikidata_id": "Q179012", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La gestion de projet est essentielle pour concevoir une application web, car elle permet de planifier et d'exécuter le développement tout en respectant les délais et les budgets."}, {"concept": {"id": "c83fda3f-b946-456b-8e65-2181318355e1", "label": "Étapes principales", "definition": "Les étapes principales sont les jalons clés identifiés dans un projet qui permettent de structurer le travail et suivre les progrès vers l'objectif final.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les étapes principales sont cruciales pour structurer un projet de développement et suivre les progrès vers l'objectif final, ce qui en fait un concept très pertinent."}, {"concept": {"id": "97c1106c-5131-4aa4-9d16-3c011ff568d9", "label": "Processus créatif", "definition": "Le processus créatif est une approche méthodique et dynamique du développement d'idées, comprenant une série d'étapes structurées telles que la préparation, la recherche, l'idéation, le développement et l'évaluation. Ce processus itératif permet aux étapes de se chevaucher et d'évoluer en fonction des découvertes faites au cours du projet, facilitant ainsi la génération d'idées novatrices et le développement de solutions créatives.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13672, 13697], "aliases": ["50c8043f-0483-4af8-a576-c31144853b08", "3195a1b9-a156-4317-93ec-c26492835045"], "wikientity": {"label": "Processus créatif", "definition": "Un processus créatif est un processus psychologique ou psycho-sociologique, volitif (conatif) et cognitif qui aboutit à une production jugée créative, innovante ou inventive.\nCe processus peut être vu comme :\n\nune succession d'étapes (p. ex.", "page_id": "1437451", "wikidata_id": "Q3406380", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le processus créatif est fondamental pour concevoir une application web, car il guide le développement d'idées et de solutions tout au long du projet."}, {"concept": {"id": "a99118f8-3d0e-4517-88a1-b6e4a98947bc", "label": "Collaboration dans le développement logiciel", "definition": "La collaboration dans le développement logiciel désigne le processus par lequel plusieurs individus ou équipes, y compris les équipes de développement et d'exploitation, interagissent étroitement pour atteindre des objectifs communs. Ce partenariat actif favorise une responsabilité partagée pour les livraisons logicielles et améliore la compréhension mutuelle, permettant ainsi de résoudre rapidement les problèmes. La collaboration implique un échange d'idées enrichissant, facilitée par des outils numériques, qui transforme les relations traditionnelles en un environnement d'innovation et de partage. Elle se caractérise également par une interaction continue entre membres d'une équipe, favorisant le partage de code et la résolution rapide des conflits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697, 13698, 13639, 13609, 13642, 13644, 13679], "aliases": ["6b2d0d61-bbc2-483a-9010-65679e414f4e", "67c9c2cc-8f9b-438a-9473-51116617429e", "baeae1c8-e8b7-4df0-a247-1b2fbcc50f47", "fa6521ce-6e4a-4aa4-b28b-2b80db1c075a", "795c3c40-5626-4e38-93f5-187486671c03", "300b92cd-5329-4dda-8ecb-d8f1026344e4", "552493e2-b80a-4ed6-a462-ffd54ddeb69a", "0a19e2ae-f21e-40e1-93a8-51f1b84ba106"], "wikientity": {"label": "Collaboration", "definition": "La collaboration est l'acte de travailler ou de réfléchir ensemble pour atteindre un objectif. \nDans son sens commun, la collaboration est un processus par lequel deux ou plusieurs personnes ou organisations s’associent pour effectuer un travail  intellectuel suivant des objectifs communs.\nDes méthodes structurées de collaboration encouragent l'introspection de comportements et communication.", "page_id": "1104659", "wikidata_id": "Q1145523", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Collaboration", "definition": "a cooperative relationship between people or groups who agree to share responsibility for achieving some specific goal", "name": "partnership.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La collaboration dans le développement logiciel est essentielle pour concevoir une application web, car elle favorise l'interaction entre les équipes et améliore la qualité du produit final."}, {"concept": {"id": "4ea86225-9e30-4861-95f0-0ae6616673ad", "label": "Bonnes pratiques UI", "definition": "Des recommandations pour optimiser l'utilisation des couleurs et autres éléments graphiques afin d'améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les bonnes pratiques UI sont essentielles pour optimiser l'interface utilisateur d'une application web, contribuant ainsi à une meilleure expérience globale."}, {"concept": {"id": "94ceb899-3421-42f7-a5b0-f97af5b3441a", "label": "UI KIT", "definition": "Un ensemble d'éléments graphiques standardisés pour assurer la cohérence visuelle d'un site web, facilitant l'évolution de l'identité visuelle existante.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un UI KIT est crucial pour assurer une cohérence visuelle dans le développement d'une application web, ce qui en fait un concept hautement pertinent."}, {"concept": {"id": "9c7cbcbd-6820-4fcd-bd00-88a36b11fe80", "label": "Analyse des Besoins du Client", "definition": "Processus d'évaluation des exigences explicites et implicites d'un client afin de fournir des solutions adaptées à ses attentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'analyse des besoins du client est cruciale pour s'assurer que l'application répond aux attentes des utilisateurs finaux."}, {"concept": {"id": "6d35ed94-c063-4944-b49e-ccf41ccc7ff8", "label": "SEO (Search Engine Optimization)", "definition": "Le SEO (Search Engine Optimization ou Optimisation pour les moteurs de recherche) et le référencement désignent la même pratique, qui consiste en un ensemble de techniques et de stratégies visant à optimiser le contenu, la structure et l'accessibilité des sites web afin d'améliorer leur classement et leur visibilité organique dans les résultats naturels des moteurs de recherche. Cela inclut des pratiques telles que l'optimisation pour les appareils mobiles, l'utilisation de mots-clés pertinents, l'amélioration de l'expérience utilisateur, la création de liens entrants, ainsi que d'autres méthodes permettant d'attirer un trafic organique accru sans recourir à des paiements directs. Le référencement naturel est essentiel pour rendre un site plus pertinent tant pour les utilisateurs que pour les moteurs de recherche, et il joue un rôle crucial dans la stratégie marketing numérique globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13666, 13677, 13705, 13707, 13710], "aliases": ["a26e73e6-05cd-407b-85f2-d57252b5dd90", "9b9214b2-cf98-456d-8434-e0b1f4bedc62", "3e30de4e-0d07-43e3-b4a9-7939e4eb124e", "0ddaedd3-4ef2-4f08-be35-453e171dde16", "3d536f63-e476-49eb-8c0c-74318db9da65", "3a53afc0-dd36-4a0c-b075-050dba40c3ca", "65f579a3-8c4e-40dd-96ab-6c512ccf5f0f", "b992c66b-0b98-4618-a3bb-abf0d268b03a", "932a7b1a-958a-41be-9061-52a61ca3215f", "fbc6c4de-4399-4a67-98d2-b6082b8fa636", "1a1b7d2a-c9e0-42e8-a50b-472a956dc805", "80e7484e-1d7e-43aa-8d8d-fc8c21b067b2", "cec3f243-9824-43a4-b8b9-9c18c9b22222", "90ca5ae8-1cf0-4e26-8054-d186a38040bc", "973ce59f-2513-4b99-b8db-b582b9c16fe4", "62c7e555-81f2-43aa-b329-10a346db9f36"], "wikientity": {"label": "Optimisation pour les moteurs de recherche", "definition": "L'optimisation pour les moteurs de recherche, aussi connue sous le nom de référencement naturel et le sigle SEO (de l'anglais « Search Engine Optimization »), inclut l'ensemble des techniques qui visent à améliorer le positionnement d'une page, d'un site ou d'une application web dans la page de résultats d'un moteur de recherche.\nCes techniques cherchent à améliorer la compréhension et la prise en compte de la thématique et du contenu d'une ou de l'ensemble des pages d'un site web par l'algorithme de classement des moteurs de recherche.", "page_id": "468524", "wikidata_id": "Q180711", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le SEO est crucial pour toute application web visant à atteindre un public large et à améliorer sa visibilité en ligne, ce qui en fait un concept très pertinent dans le contexte de la conception d'applications."}, {"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Éléments graphiques' sont essentiels pour construire l'interface utilisateur d'une application web et influencent fortement son efficacité visuelle et son interaction avec les utilisateurs."}, {"concept": {"id": "a8a00071-1e94-47d4-ae1f-c4d1d56d0f25", "label": "Suivi de projet", "definition": "Processus de gestion permettant de surveiller l'avancement des tâches et d'ajuster les délais en fonction des besoins.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le suivi de projet est essentiel pour concevoir une application web, car il permet de gérer l'avancement des tâches et d'ajuster les délais, ce qui est crucial dans le développement logiciel."}, {"concept": {"id": "102dfa0e-173c-46f8-be1b-509002d830fa", "label": "Raccourcis clavier", "definition": "Les raccourcis clavier, ou raccourcis clavier, sont des combinaisons de touches qui permettent d'exécuter rapidement des actions ou d'accéder à certaines fonctions et éléments sur une interface utilisateur sans utiliser la souris. Ils améliorent le flux de travail et l'efficacité, tout en étant essentiels pour l'accessibilité et le contrôle par l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13687, 13708], "aliases": ["538bfe42-25e3-45e3-940c-17fd7c0a4a4b", "73945f1d-92e1-4d3e-8bc1-f352f68da12e", "62be84a7-681e-496d-9ecc-104bc40bac0c"], "wikientity": {"label": "Raccourci clavier", "definition": "Un raccourci clavier est une combinaison de touches qui une fois enfoncée permet d'exécuter un programme, une fonction ou une commande d'un programme. Les raccourcis clavier peuvent être composés d'une ou de plusieurs touches, on parle aussi de combinaison de touches dans le second cas. Pour demander à l'ordinateur d'exécuter des instructions, l'utilisateur peut avoir recours à un interpréteur de commandes ou à une interface graphique.", "page_id": "736859", "wikidata_id": "Q118470", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les Raccourcis clavier sont très pertinents pour améliorer l'efficacité lors du développement d'applications web, facilitant ainsi le flux de travail des développeurs."}, {"concept": {"id": "5792c744-4854-454e-8f87-ec4f5ccf2582", "label": "Éco-conception", "definition": "L'éco-conception est une approche de design qui intègre des considérations écologiques et les enjeux environnementaux dans la conception de produits ou services, y compris le développement durable dans la création de sites web. Elle vise à minimiser l'impact environnemental tout au long du cycle de vie des produits ou services, en équilibrant durabilité, faisabilité technique et performance visuelle et économique, tout en cherchant spécifiquement à réduire l'empreinte écologique des plateformes numériques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689, 13705, 13707, 13710], "aliases": ["38fcc5fa-1e9a-4c59-aae0-84056f944879", "609f9dc6-35e8-4391-930d-0357b9e53ae7", "dfc96dcc-97c8-4069-b1a1-dfbb8ca41f8a", "05a8aba3-d572-485a-b33a-17449f7e81db", "4e4dabed-3dd1-4b7f-a965-da4f5c53ce5d"], "wikientity": {"label": "Écoconception", "definition": "L’écoconception est la volonté de concevoir des produits respectant les principes du développement durable et de l'environnement, en — selon l'Ademe — recourant « aussi peu que possible aux ressources non renouvelables en leur préférant l'utilisation de ressources renouvelables, exploitées en respectant leur taux de renouvellement et associées à une valorisation des déchets qui favorise le réemploi, la réparation et le recyclage », dans un contexte qui évoluerait alors vers une économie circulaire.\nLa définition officielle qui fait foi pour l'ADEME est la suivante : « C’est une démarche préventive et innovante qui permet de réduire les impacts négatifs du produit, service ou bâtiment sur l’environnement sur l’ensemble de son cycle de vie (ACV), tout en conservant ses qualités d’usage. »\nÀ partir de celle-ci, on peut en effet décliner d'autres formulations ou déclinaisons.", "page_id": "3967563", "wikidata_id": "Q795082", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'éco-conception est très pertinente car elle aborde des considérations écologiques qui peuvent influencer la manière dont une application web est conçue et développée."}, {"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'esthétique est cruciale dans la conception d'applications web, car elle influence l'expérience utilisateur et l'engagement avec l'interface."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La lisibilité est essentielle pour garantir une bonne expérience utilisateur sur une application web, rendant ce concept très pertinent."}, {"concept": {"id": "3c0fff2a-064d-4ce2-803c-abb4d7b1c5ed", "label": "dossier de présentation", "definition": "Document structuré présentant un projet ou une entreprise, essentiel pour communiquer des idées et convaincre des clients potentiels.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13683], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un dossier de présentation est essentiel pour communiquer efficacement sur une application web et convaincre les parties prenantes de son utilité et de sa valeur."}, {"concept": {"id": "0e2b76bd-fa95-4a2e-9aa6-621ca5664d4c", "label": "Évaluation", "definition": "Processus d'analyse des idées développées selon des critères spécifiques pour affiner et améliorer les propositions.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'évaluation des idées développées est importante pour affiner les propositions lors de la conception d'une application, bien que cela soit plus général."}, {"concept": {"id": "99c4272d-b04d-46f9-8678-16107829dbb3", "label": "Arborescence", "definition": "Structure hiérarchique permettant d'organiser des fichiers ou informations, facilitant la navigation et l'accès aux données dans un projet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": {"label": "Arborescence", "definition": "En mathématiques, plus précisément dans la théorie des graphes : une arborescence est un arbre comportant un sommet particulier \n  \n    \n      \n        r\n      \n    \n    {\\displaystyle r}\n  \n, nommé racine de l'arborescence, à partir duquel il existe un chemin unique vers tous les autres sommets.\n\nEn informatique, cette notion désigne souvent celle d'arbre de la théorie des graphes. Une arborescence désigne alors généralement une organisation des données en mémoire, de manière logique et hiérarchisée, utilisant une structure algorithmique d'arbre.", "page_id": "76749", "wikidata_id": "Q2067937", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'Arborescence est essentielle pour organiser les informations et faciliter la navigation dans une application web, ce qui en fait un concept important lors de sa conception."}, {"concept": {"id": "0ef5f1c2-24c9-4318-b6c7-96d7d23396d4", "label": "Hiérarchisation des informations", "definition": "La hiérarchisation des informations est un processus stratégique d'organisation et de structuration des éléments visuels et des données sur une affiche, visant à optimiser la clarté, l'impact visuel et la compréhension pour le public.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": ["24340f97-ef74-4ff2-b4c0-46ec91fe3c1b"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La Hiérarchisation des informations aide à structurer les données présentées dans une application web, améliorant ainsi la compréhension et l'expérience utilisateur."}, {"concept": {"id": "ee30828b-7fba-4b6e-90a1-a6d3db62341e", "label": "Adaptation au format", "definition": "Ajustement des éléments graphiques pour assurer leur efficacité sur différents supports et formats.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'adaptation au format est importante lors de la conception d'une application web pour s'assurer que les éléments graphiques fonctionnent bien sur différents appareils et résolutions."}, {"concept": {"id": "296f12ab-03eb-495e-a89c-a642b60fb59f", "label": "Stylescape", "definition": "Un stylescape est un outil de conception visuelle élaboré qui représente l'identité d'une marque en regroupant typographie, couleurs, images et éléments graphiques. Il définit une direction esthétique et communique l'essence d'un projet ou d'une marque en illustrant une vision créative. Enrichissant la présentation des propositions, il transmet également l'identité ainsi que l'expérience globale souhaitées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679, 13691, 13701], "aliases": ["00177c06-47fd-4e59-aaf0-40bae219397f", "9b293c40-def0-4671-adf0-4548e76ec630", "3be7bd57-bfea-4bcb-8f2c-3043b5337341", "1adbfe40-1617-4b38-97bc-4d3517ae959b", "b1f8fe5b-f9f7-4dbb-8b77-60dfa36ab7c0"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le Stylescape est pertinent car il aide à définir l'identité visuelle d'une application web, ce qui est essentiel dans le processus de conception."}, {"concept": {"id": "1484d9ca-97e7-4cf4-8225-34669582bc2f", "label": "Neumorphisme", "definition": "Style de design qui utilise des ombres douces pour créer un effet de relief sur les éléments d'interface, donnant une apparence tactile.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": {"label": "Neumorphisme", "definition": "Le néomorphisme ou neumorphisme est un style de design d'interface graphique caractérisé par son souhait de donner un effet de relief. Ce style apparaît après le skeuomorphisme et le flat design dont il tente de faire la synthèse.", "page_id": "13648854", "wikidata_id": "Q102244095", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le neumorphisme est un style de design pertinent pour l'interface utilisateur d'une application web, influençant son apparence et son ergonomie."}, {"concept": {"id": "649b9e0a-1d5a-4e90-adf3-d037c915dfd0", "label": "Organisation hiérarchique", "definition": "Méthode de structuration des idées par niveaux d'importance, permettant une meilleure clarté et compréhension des relations entre les concepts.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'organisation hiérarchique aide à structurer les idées et fonctionnalités lors du processus de conception d'une application web, facilitant ainsi sa planification."}, {"concept": {"id": "2414d865-830b-4ca5-a094-d8217f6b09f0", "label": "Human Problems", "definition": "Défis ou besoins rencontrés par les individus que les entreprises cherchent à résoudre grâce à des solutions technologiques innovantes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les human problems sont très pertinents car ils motivent souvent le besoin de développer des applications qui répondent aux besoins des utilisateurs."}, {"concept": {"id": "5de70e87-5ec8-41e0-bed3-9c9a885ac069", "label": "Produit", "definition": "Bien ou service conçu pour répondre aux besoins spécifiques des consommateurs, essentiel dans le mix marketing pour assurer la satisfaction et la fidélité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13676], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Produit", "definition": "items for sale to the individual consumer", "name": "merchandise.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "Le concept de produit est central dans le développement logiciel car il définit ce qui doit être créé pour répondre aux besoins des utilisateurs."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "Les images jouent un rôle important dans l'interface utilisateur et l'expérience utilisateur des applications web, influençant leur efficacité visuelle."}], "exercises": [{"exercise": {"id": "b17e37191d8e4ee096cbcba422cbd719", "question": "Quelle est la méthode qui découpe le design d'une interface en composants ?", "answers": ["L'atomic design"], "distractors": ["Le responsive design", "Le flat design", "Le skeuomorphisme", "Le material design", "Le wireframing", "Le design génératif", "Le minimalisme", "La méthode OOCSS", "Le visual design"], "feedback": "L'atomic design est une méthode de découpe du design d'une interface en plusieurs composants, permettant ainsi une meilleure organisation et une plus grande flexibilité dans la création de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 10, "justification": "L'exercice évalue directement la compréhension d'un concept clé mentionné dans la référence, à savoir l'Atomic Design, qui est une méthode essentielle pour décomposer les interfaces en composants réutilisables. La question cible spécifiquement cette méthode, et la réponse correcte démontre une maîtrise du sujet abordé dans le contexte de la conception d'applications web. Ainsi, cet exercice est parfaitement aligné avec les objectifs d'apprentissage liés à la conception et au développement d'une application web."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé de la référence, à savoir l'importance de l'expérience utilisateur (UX) dans la conception d'une application web. La question posée cible spécifiquement ce point, et la réponse correcte souligne bien que l'expérience utilisateur est primordiale pour un design efficace. Les distracteurs proposés sont pertinents car ils représentent des éléments qui peuvent influencer le design mais ne sont pas aussi centraux que l'expérience utilisateur. Cependant, une légère amélioration pourrait être apportée en incluant des aspects tels que le Design Thinking ou le wireframing dans les options proposées, ce qui aurait permis de tester encore plus en profondeur la compréhension des concepts liés à la conception d'applications web."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension du concept de wireframe, qui est un élément clé dans le processus de conception d'une application web. La question cible spécifiquement l'objectif principal du wireframe, ce qui est pertinent par rapport à la référence sur la conception d'applications web. La réponse correcte souligne l'importance de structurer les éléments sans se concentrer sur l'aspect visuel, ce qui reflète bien les informations fournies dans la synthèse. Cependant, une légère amélioration pourrait être apportée en incluant des questions supplémentaires sur d'autres aspects de la conception UX/UI pour couvrir plus largement le sujet abordé dans la référence."}, {"exercise": {"id": "fcf86d429da24f679769741afa7e8165", "question": "À quoi sert principalement le zoning dans le processus de création d'une page web ?", "answers": ["À schématiser la disposition du contenu et des fonctionnalités"], "distractors": ["À détailler le design final de la page", "À définir la palette de couleurs utilisée", "À créer une carte des utilisateurs", "À programmer les différentes fonctionnalités", "À choisir les outils graphiques à utiliser", "À écrire le contenu de la page", "À optimiser le SEO de la page web", "À définir les standards de performance", "À tester la compatibilité sur différents navigateurs"], "feedback": "Le zoning sert principalement à schématiser la disposition du contenu et des fonctionnalités sur une page web, en utilisant des blocs pour représenter les différents éléments. Il intervient généralement après la création de l'arborescence, qui définit l'organisation globale du site, et permet ainsi de valider ou ajuster les grandes lignes avant de passer aux étapes suivantes de conception.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé lié à la conception d'une application web, en l'occurrence le zoning. Ce dernier est essentiel pour visualiser la disposition du contenu et des fonctionnalités, ce qui est en adéquation avec les objectifs de conception UX et UI mentionnés dans la référence. La question permet de tester si l'apprenant saisit bien l'importance de cette étape dans le processus global de création d'une page web. Cependant, une légère amélioration pourrait être apportée en intégrant davantage d'aspects liés à l'interaction utilisateur ou à la gestion de projet, mais cela n'enlève pas à la pertinence globale de l'exercice."}, {"exercise": {"id": "cfb5a24978ac4fb2bf3fa2db59ed0ebe", "question": "Quelle est l'utilité des wireframes dans le processus de création web?", "answers": ["Ils servent de base à la conception des maquettes web"], "distractors": ["Ils déterminent exclusivement les couleurs du site.", "Ils fournissent uniquement le texte du contenu.", "Ils remplacent les graphiques finaux sur le site.", "Ils sont créés en dernier après la conception graphique.", "Ils indiquent exactement où placer les images.", "Ils proposent les logos nécessaires pour le site web.", "Ils permettent d'ajuster uniquement la navigation visuelle.", "Ils représentent essentiellement l'esthétique finale du site.", "Ils s'occupent de la gestion du back-end du projet."], "feedback": "Les wireframes servent de base pour la conception des maquettes web en organisant les éléments et la navigation du site. Ils ne déterminent pas exclusivement l'esthétique finale du site, mais sont plutôt un guide pour respecter les fonctionnalités souhaitées par le client et le budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension de l'utilité des wireframes dans le processus de création web, ce qui est un concept clé mentionné dans la référence. Les wireframes sont présentés comme un outil essentiel pour visualiser la structure d'une interface avant son développement final, facilitant ainsi la communication et l'organisation des éléments du site. La question posée permet à l'apprenant de démontrer sa maîtrise de ce concept, et les distracteurs proposés renforcent cette évaluation en testant la connaissance précise des rôles que jouent les wireframes. Cependant, une légère amélioration pourrait être apportée en incluant une question plus large sur le rôle global des wireframes dans le design UX/UI."}, {"exercise": {"id": "f73b609c41224a5eb611f366c35d9a2a", "question": "Quel critère doit être respecté pour rendre une application intuitive ?", "answers": ["Son fonctionnement doit être familier aux utilisateurs"], "distractors": ["Elle doit offrir de nombreuses options uniques d'interface", "Elle doit suivre les dernières tendances du marché", "Elle doit être visuellement impressionnante", "Sa conception doit ignorer les habitudes des utilisateurs", "Elle doit inclure toutes les fonctionnalités demandées par les développeurs", "Elle doit intégrer au moins deux modes de navigation", "Son design doit être avant-gardiste et innovant", "Son utilisation doit être complexe mais enrichissante", "Elle doit simuler des défis d’apprentissage pour les utilisateurs"], "feedback": "Respecter les habitudes des utilisateurs permet de rendre l'application intuitive car les utilisateurs seront familiers avec son fonctionnement et pourront l'utiliser facilement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un aspect clé de la conception d'applications web, à savoir l'importance de rendre une application intuitive pour les utilisateurs. La question cible spécifiquement un critère fondamental en UX design, qui est que le fonctionnement de l'application doit être familier aux utilisateurs. La réponse fournie par l'apprenant démontre une bonne compréhension des principes de base du design centré sur l'utilisateur, ce qui est en adéquation avec les concepts abordés dans la synthèse. Les distracteurs proposés sont également pertinents car ils représentent des idées fausses ou moins prioritaires dans le contexte de la création d'une application intuitive. Cependant, pour obtenir un score parfait, l'exercice aurait pu inclure davantage d'éléments liés à d'autres aspects mentionnés dans la synthèse, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "7a9bfae2718c4ec894908d42d69a0337", "question": "Quel est l'objectif principal d'un design system ?", "answers": ["Créer un système standardisé englobant tous les éléments graphiques et visuels"], "distractors": ["Faciliter uniquement la communication entre développeurs sans autres éléments.", "Améliorer la sécurité des données en développement produit.", "Se concentrer sur le développement du backend d'un produit.", "Optimiser exclusivement la performance technique des produits numériques.", "Gérer les bugs et correctifs de manière centralisée.", "Automatiser entièrement le processus de développement logiciel.", "Organiser tous les tests de performance pour un projet donné.", "Encourager l’utilisation des frameworks open-source dans le produit.", "Développer des environnements virtuels pour les phases de tests."], "feedback": "L'objectif principal d'un design system est de regrouper tous les éléments visuels et graphiques, ainsi que les règles, le branding et le ton dans un système standardisé pour faciliter le processus de développement et assurer cohérence et efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé lié à la conception d'applications web, en particulier le design system. La question cible un aspect fondamental de la création d'une application, qui est l'importance de la standardisation des éléments graphiques pour assurer une expérience utilisateur cohérente. La réponse correcte reflète bien les informations fournies dans la synthèse, notamment sur le rôle du design system dans le développement d'interfaces numériques. Cependant, il aurait été bénéfique d'inclure des questions supplémentaires sur d'autres concepts abordés dans la synthèse pour une évaluation plus complète des compétences liées à la conception d'applications web."}, {"exercise": {"id": "4c03f6a0173c41d68cc1d8eb88688d21", "question": "Qu'englobe généralement un design system dans le processus de création d'un produit ?", "answers": ["Les éléments graphiques, visuels, règles, ton, branding, etc"], "distractors": ["Les fonctionnalités techniques, algorithmes et optimisation de performances.", "Les vecteurs de sécurité et protocoles cryptographiques pour le produit.", "Le suivi exclusif des tests utilisateurs et retours clients.", "La gestion complète des bases de données et serveurs.", "Les diagrammes UML et documentation interne sur l’architecture produit.", "La conception des interfaces hardware et leurs connectiques.", "Les outils de déploiement cloud et gestion continue du produit.", "La rédaction de contrats juridiques et gestion de licences.", "L'analyse des statistiques de vente et tendances du marché."], "feedback": "Un design system englobe généralement tous les éléments liés à l'apparence et l'identité d'un produit, tels que les graphiques, les règles de style, le ton et le branding. Cela permet une création plus cohérente et efficace du produit, en assurant une identité visuelle unifiée et identifiable par les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé lié à la conception d'une application web, en se concentrant sur le design system. La question demande spécifiquement ce que comprend un design system, ce qui est pertinent par rapport à la référence qui aborde la conception et le design web. La réponse fournie couvre les éléments essentiels du design system, tels que les éléments graphiques et visuels, ainsi que les règles de style et le branding. Cependant, une légère amélioration pourrait être apportée en incluant des aspects liés à l'expérience utilisateur ou à l'interaction avec le produit pour atteindre une note parfaite."}, {"exercise": {"id": "a979f369544e4c46b0a02f5ae402fb4c", "question": "Quelle implication découle de l'application de la loi de Fitts en matière d'interface ?", "answers": ["Les fonctions clés doivent être plus visibles pour l'utilisateur"], "distractors": ["Toutes les fonctions ont la même importance dans une interface", "Le nombre de boutons doit être réduit au minimum", "Le positionnement des fonctions n’impacte pas l’expérience utilisateur", "Seules les fonctions secondaires doivent être mises en avant", "Une interface doit limiter les interactions à deux clics maximum", "Un design fluide est plus important que la hiérarchie des fonctions", "Le choix des couleurs prime sur la taille des éléments", "Les fonctions non-essentielles doivent être masquées", "Le texte explicatif améliore toujours l'expérience utilisateur"], "feedback": "La loi de Fitts met en avant l'importance de rendre les fonctions clés plus visibles pour l'utilisateur en les représentant de manière plus impactante. Les distracteurs proposés sont soit inexistants, soit contradictoires avec cette implication.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé en design d'interface, à savoir la loi de Fitts, qui est directement liée à l'optimisation de l'expérience utilisateur (UX). La question posée permet de tester si l'apprenant saisit l'importance de rendre les fonctions clés visibles pour améliorer l'interaction avec l'utilisateur. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, comme le wireframing ou le Design Thinking. Il se concentre sur un seul aspect du design d'interface sans aborder les autres éléments cruciaux du développement d'une application web. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "0ad7750deb404ae5be380e32742f44eb", "question": "Quelle erreur courante est commise par les concepteurs lors du développement d'applications ?", "answers": ["Ajouter des fonctionnalités sans valeur ajoutée"], "distractors": ["Oublier l'optimisation SEO", "Ignorer la vitesse de chargement", "Concevoir uniquement pour le bureau", "Ne pas tester sur tous navigateurs", "Négliger le design visuel", "Utiliser trop d'images de fond", "Développer uniquement pour iOS", "Prioriser la publicité", "Ne pas intégrer le HTTPS"], "feedback": "La bonne réponse souligne une erreur courante chez les concepteurs lors du développement d'applications, qui consiste à ajouter des fonctionnalités qui n'apportent pas de valeur ajoutée pour l'utilisateur. Les distracteurs proposent différentes erreurs courantes mais ne font pas référence à l'ajout de fonctionnalités sans valeur ajoutée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des erreurs courantes dans le développement d'applications, ce qui est pertinent pour la conception d'une application web. La réponse correcte met en lumière un aspect crucial de l'expérience utilisateur (UX), à savoir l'importance de ne pas surcharger une application avec des fonctionnalités inutiles. Cela s'inscrit bien dans le contexte de la conception centrée sur l'utilisateur et du Design Thinking mentionnés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques liés à la gestion de projet ou aux méthodes de design comme le wireframing ou les design systems, qui sont également abordés dans la synthèse."}, {"exercise": {"id": "87c2b33f5503487ebf5bb50b8dbb6746", "question": "Quel concept permet à l'utilisateur de comprendre comment utiliser un objet avant utilisation ?", "answers": ["L'affordance offre une compréhension intuitive d'un objet avant son utilisation"], "distractors": ["L'utilisabilité repose sur la compréhension immédiate de l'objet", "Le feedback permet d’interagir avec l’objet après l’avoir utilisé", "L’ergonomie se focalise uniquement sur l'aspect esthétique de l'objet", "La signalisation guide l'utilisation mais implique une lecture préalable", "La redondance renforce l'accessibilité des objets via répétition", "La ludification transforme l’interaction en jeu pour meilleure accessibilité", "L'anthropomorphisme associe des caractéristiques humaines aux objets", "L'accessibilité concerne uniquement les personnes à mobilité réduite dans le design", "La modularité permet de personnaliser un objet selon les besoins spécifiques"], "feedback": "L'affordance est un concept qui permet à l'utilisateur de comprendre intuitivement comment utiliser un objet avant même de l'avoir utilisé. Cela se fait par le biais de signes et de stimuli visuels, tels que la forme d'un objet ou les actions qu'il inspire, qui suggèrent à l'utilisateur comment interagir avec l'objet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé en design d'interface, à savoir l'affordance, qui est essentiel pour optimiser l'expérience utilisateur (UX) dans le cadre de la conception d'applications web. Bien que la question ne couvre pas tous les aspects mentionnés dans la référence, elle touche un point fondamental de la conception UX, ce qui en fait un exercice pertinent. Cependant, il aurait pu être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts comme le wireframing ou le Design Thinking pour une évaluation plus complète."}, {"exercise": {"id": "da35feb49e864dec9be4a552fb20bd03", "query": "Les wireframes servent de base aux web designers pour <blank>, tout en respectant les souhaits et contraintes validés par le client.", "answers": ["la conception des maquettes"], "distractors": [["la gestion du budget", "le développement des fonctionnalités", "la maintenance du site", "la création du contenu", "l'organisation des réunions", "l'élaboration de scripts"]], "feedback": "Les wireframes sont des schémas représentant la structure d'une page web. Ils guident les web designers dans la phase créative appelée 'conception des maquettes', qui consiste à traduire ces schémas en une interface visuelle définitive. Les autres options, comme la maintenance du site ou la gestion du budget, relèvent de processus différents qui n’interviennent pas directement dans cette phase.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des wireframes, qui sont un élément clé dans le processus de conception d'une application web. En demandant aux apprenants de compléter une phrase sur l'utilisation des wireframes, il teste leur connaissance sur la phase de conception et leur capacité à relier cette notion aux attentes du client. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant d'autres concepts mentionnés dans la synthèse, comme l'expérience utilisateur ou le design system, pour couvrir davantage d'aspects du développement d'applications web."}, {"exercise": {"id": "48ef62b02b0148eeb79dd1d5e0017254", "query": "L'atomic design est une méthode qui consiste à <blank> en différents composants le design d'une interface.", "answers": ["découper"], "distractors": [["assembler", "simplifier", "fusionner", "compliquer", "agrandir", "réarranger"]], "feedback": "La bonne réponse est 'découper', car l'atomic design fait référence à la décomposition de l'interface en éléments plus petits et réutilisables, permettant ainsi une conception modulaire. Les autres propositions ne correspondent pas à cette idée de fragmentation en composants plus petits.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'applications web, en particulier l'Atomic Design, qui est mentionné dans la synthèse. En demandant aux apprenants de compléter une phrase sur le découpage du design en composants, il teste leur connaissance d'une méthode essentielle pour créer des interfaces modulaires. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects de la référence concernant la conception d'une application web, comme l'expérience utilisateur ou le wireframing. C'est pourquoi il obtient un score élevé mais pas parfait."}, {"exercise": {"id": "a286d7d9d1844bed865e42b39a918f65", "statement": "Les wireframes valides sont immuables et ne peuvent en aucun cas être modifiés par les créatifs.", "veracity": false, "feedback": "Bien que les wireframes valides constituent la base du travail, ils ne sont pas immuables. Les web designers peuvent ajuster l'organisation des éléments et le système de navigation, tant qu'ils respectent les fonctionnalités validées par le client et restent dans les limites du budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension des wireframes, qui sont un élément clé de la conception d'applications web. La référence mentionne l'importance du wireframing pour visualiser la structure d'une interface et faciliter la communication au sein de l'équipe. L'affirmation proposée dans l'exercice aborde directement le concept de flexibilité des wireframes, ce qui est pertinent pour évaluer si l'apprenant comprend que ces outils ne sont pas figés et peuvent être modifiés en fonction des besoins du projet. Cependant, l'exercice aurait pu être encore plus pertinent s'il avait inclus une question sur les étapes spécifiques du processus de conception ou sur d'autres concepts comme le Design Thinking ou l'Atomic Design."}, {"exercise": {"id": "98e4f3c03bf2473e8f0a24285dd8a96e", "statement": "Les web designers doivent respecter à la fois les fonctionnalités souhaitées par le client et le budget prévu pour le projet.", "veracity": true, "feedback": "Les créatifs doivent effectivement respecter les fonctionnalités validées par le client ainsi que le budget alloué au projet, tout en ayant une certaine flexibilité sur l'organisation des éléments et le système de navigation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des contraintes de développement d'une application web, notamment en ce qui concerne les fonctionnalités demandées par le client et le respect du budget. Cela est pertinent par rapport à la référence qui aborde la gestion de projet dans le cadre de la conception d'applications web. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à l'expérience utilisateur ou aux méthodes de design mentionnées dans la synthèse."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface utilisateur, en particulier l'importance de rendre les fonctions clés plus visibles pour améliorer l'expérience utilisateur. Cela est directement lié aux concepts abordés dans la référence, notamment la conception UX et l'optimisation des interactions. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects mentionnés dans la synthèse, comme le wireframing ou le Design Thinking, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "2e8282503d8d465cb75918606843cf30", "statement": "Un bouton d'appel à l'action trop grand peut nuire à la hiérarchie visuelle d'une mise en page.", "veracity": true, "feedback": "Un bouton trop grand peut effectivement perturber la composition visuelle et altérer la hiérarchie de la mise en page, ce qui rendrait l'interface utilisateur moins harmonieuse et ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de design d'interface utilisateur, en particulier la hiérarchie visuelle, qui est un concept clé dans la conception d'applications web. L'affirmation sur le bouton d'appel à l'action et son impact sur la mise en page est pertinente par rapport aux notions de design UX/UI abordées dans la synthèse. Cependant, bien que cela touche un aspect important du design, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts mentionnés dans la référence, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "47cef18f7e6c47dcb2baaf060b4257b4", "statement": "L'affordance permet à l'utilisateur de comprendre comment utiliser un objet avant même qu'il n'ait besoin de l'essayer.", "veracity": true, "feedback": "C'est exact. L'affordance décrit la capacité d'un objet ou d'une interface à communiquer visuellement ou intuitivement comment elle doit être utilisée, sans que l'utilisateur ait besoin de tâtonner ou d'expérimenter auparavant.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept d'affordance, qui est un élément clé de l'expérience utilisateur (UX) et du design d'interface. Cela correspond bien à la référence sur la conception d'applications web, car une bonne affordance contribue à optimiser les interactions entre les utilisateurs et le produit numérique. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus larges liés à la conception web, comme le wireframing ou le Design Thinking, pour couvrir davantage de concepts mentionnés dans la synthèse."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la clarté et de la cohérence dans une interface utilisateur, ce qui est un aspect clé du développement d'applications web mentionné dans la référence. La réponse correcte (Vrai) et l'explication fournie soulignent bien comment ces normes influencent l'expérience utilisateur, en lien avec les concepts de design UX et UI abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur d'autres aspects du développement d'une application web, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le design d'une application web, ce qui est un concept clé mentionné dans la référence. L'affirmation souligne que le design doit inclure l'expérience utilisateur pour être efficace, ce qui est en accord avec les éléments abordés dans la synthèse concernant le rôle crucial des designers UX et UI. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des aspects supplémentaires tels que le wireframing ou le Design Thinking pour une évaluation plus complète des compétences liées à la conception d'applications web."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du terme 'design' dans le contexte de la conception d'applications web, ce qui est pertinent par rapport à la référence. Il souligne l'importance de la conception en tant que processus global qui inclut non seulement l'aspect visuel mais aussi l'organisation et l'expérience utilisateur. Cependant, il pourrait être amélioré en intégrant des éléments supplémentaires sur les méthodes de design ou les outils utilisés dans le développement d'applications web pour couvrir plus largement les concepts clés mentionnés dans la synthèse."}, {"exercise": {"id": "c403d64ca6434b3dafa2d9505f75f7a4", "statement": "L'atomic design est une méthode qui consiste à diviser le design d'une interface en éléments individuels.", "veracity": true, "feedback": "L'atomic design vise à découper une interface en composants distincts, ce qui permet d'aborder le design de manière modulaire et réutilisable. Cette approche facilite la gestion et l'évolution des interfaces complexes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'applications web, en particulier l'Atomic Design, qui est mentionné dans la synthèse. En demandant à l'apprenant de valider une affirmation sur cette méthode, l'exercice teste sa capacité à saisir des notions fondamentales du design web. Cependant, bien que pertinent, il ne couvre pas tous les aspects de la référence concernant la conception d'une application web dans son ensemble, comme l'expérience utilisateur ou le wireframing. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "1ed8a8f2d0e246f3badf5d8e09a749e2", "statement": "Les nouvelles méthodes utilisées par les Designers incluent l'Atomic Design et le Design Thinking.", "veracity": true, "feedback": "L'Atomic Design et le Design Thinking sont effectivement des méthodes qui ont été adoptées dans le domaine du design ces dernières années. Elles aident à structurer la création et résolution de problèmes en design, avec des approches centrées sur le produit ou l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c3856ee582864d13a2fe35045e21346f", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Le métier de Designer a beaucoup évolué ces dernières années avec l'apparition de différentes spécialités ( UX Designer, UIDesigner, Product Designer, ... ) denouvelles méthodes (Atomic Design, Design Thinking, ... ) et de nouveaux outils (Sketch, Figma, Adobe XD, ... )", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef9ea6dd9a1c4597a041e212a02fc1e7", "next_id": null, "prev_id": "bd60d99870b747389a3bbc7e9ecb73ee", "associated_block_ids": [], "first_page": 3, "last_page": 3, "start_time": null, "end_time": null, "doc_id": 13680, "doc_label": "Sequence 7_créativité et originalité", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la connaissance des méthodes de design, en particulier l'Atomic Design et le Design Thinking, qui sont des concepts clés mentionnés dans la synthèse. Ces méthodes sont essentielles pour concevoir une application web efficace et centrée sur l'utilisateur. Cependant, bien que pertinent, l'exercice ne couvre pas d'autres aspects importants tels que la gestion de projet ou le wireframing, ce qui limite légèrement sa portée par rapport à l'ensemble des compétences nécessaires pour concevoir une application web."}, {"exercise": {"id": "93e7ef85a293427fa476fcf9bd39ab01", "question": "Quelle étape précède généralement la réalisation du zoning lors d’un projet web ?", "answers": ["La création de l’arborescence"], "distractors": ["La définition du cahier des charges", "Le développement de la base de données", "La mise en place des tests utilisateurs", "L’optimisation de la vitesse de chargement", "La proposition de maquettes aux parties prenantes", "La sélection des outils de gestion de projet", "L’écriture du contenu rédactionnel", "La validation finale du client", "La configuration des serveurs"], "feedback": "Avant de procéder au zoning, il est nécessaire de définir la structure du site à travers une arborescence. Cela permet d'avoir une vision globale de l'organisation des pages et des contenus. Ainsi, le zoning peut être réalisé en parallèle de la création de l'arborescence.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des étapes préliminaires dans le développement d'un projet web, en particulier la création de l'arborescence qui est essentielle avant le zoning. Cela correspond bien aux concepts de conception et de gestion de projet mentionnés dans la référence. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments directement liés à l'expérience utilisateur ou à des méthodes spécifiques comme le wireframing ou le Design Thinking, qui sont également abordés dans la synthèse."}, {"exercise": {"id": "d98bc70a159f4f99ada0181438d991b5", "query": "Le wireframe se concentre principalement sur <blank>, sans s'occuper de l'aspect visuel ou du graphisme.", "answers": ["l'organisation des éléments et des formes"], "distractors": [["la création des images et vidéos finales", "la mise en forme graphique", "la palette de couleurs et typographie", "la réalisation des animations interactives", "l'optimisation des performances", "le développement du code fonctionnel"]], "feedback": "La bonne réponse est 'l'organisation des éléments et des formes' car le wireframe a pour but de déterminer la disposition structurelle des blocs comme les textes, images, ou vidéos, tout en ne tenant pas compte des détails graphiques qui seront travaillés ultérieurement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un élément clé dans la conception d'une application web. Il teste spécifiquement la capacité de l'apprenant à distinguer entre les aspects structurels et visuels du design, ce qui est en ligne avec les objectifs d'apprentissage liés à la conception UX mentionnés dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur le processus global de conception ou sur d'autres méthodes comme le Design Thinking pour une évaluation plus complète des compétences liées à la conception d'applications web."}, {"exercise": {"id": "a9e39306cb3b4f74b096fd9dd4b2697a", "statement": "Le wireframe consiste à définir l'organisation des éléments et des formes tout en travaillant l'aspect visuel.", "veracity": false, "feedback": "Le wireframe se concentre sur l'organisation des éléments comme les images, textes ou vidéos sans travailler l'aspect visuel. Le graphisme n'intervient qu'à une étape ultérieure du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un élément clé dans la conception d'une application web. La référence mentionne que le wireframing est essentiel pour visualiser la structure d'une interface avant son développement final, ce qui correspond à l'affirmation donnée. L'exercice teste si l'apprenant sait distinguer entre l'organisation des éléments et l'aspect visuel, ce qui est pertinent pour comprendre le processus de conception. Cependant, il aurait pu être amélioré en demandant à l'apprenant d'expliquer davantage pourquoi cette distinction est importante dans le cadre du développement d'une application web."}, {"exercise": {"id": "df6d8e1ef0c24891972ea92c71fd1f92", "statement": "Le contenu utilisé dans le wireframe peut être fictif si les informations finales ne sont pas encore disponibles.", "veracity": true, "feedback": "Il est mentionné que les informations finales ne sont pas toujours connues à ce stade du projet, donc un contenu fictif peut être utilisé pour organiser le wireframe.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de wireframing, qui est un élément clé dans la conception d'une application web. Il aborde la possibilité d'utiliser un contenu fictif dans le wireframe, ce qui est pertinent car cela reflète une pratique courante lors des phases initiales de développement où les informations finales ne sont pas encore disponibles. Cependant, l'exercice pourrait être amélioré en demandant à l'apprenant d'expliquer davantage comment le wireframing s'intègre dans le processus global de conception et de développement d'une application web, afin de tester une compréhension plus approfondie des concepts liés à la conception UX/UI."}, {"exercise": {"id": "71bf5ddcb822486fa3600aadc42c02eb", "question": "Quelle est une utilisation clé d'un Stylescape dans la communication avec un client ?", "answers": ["Donner une idée claire de l'apparence du projet final"], "distractors": ["Vérifier la compatibilité des logiciels utilisés.", "Comparer différents prototypes techniques.", "Organiser des réunions internes régulières.", "Expliquer le concept stratégique derrière la campagne.", "Approuver le budget global du projet.", "Finaliser les aspects techniques du projet.", "Analyser les retours utilisateurs post-lancement.", "Optimiser les aspects fonctionnels et ergonomiques.", "Résoudre les problèmes logistiques du projet."], "feedback": "L'une des utilisation clé d'un Stylescape dans la communication avec un client est de leur donner une idée claire de l'apparence du projet final, afin qu'ils puissent se projeter et comprendre le résultat attendu. Les autres propositions ne sont pas correctes car elles ne sont pas directement liées à la communication avec le client ou ne font pas référence à l'apparence du projet final.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'une application web, en particulier l'utilisation d'un Stylescape pour communiquer avec un client. Cela est pertinent car la communication visuelle et la présentation des idées sont essentielles dans le processus de conception UX/UI. Cependant, bien que cela touche à un aspect important de la conception, l'exercice pourrait être amélioré en intégrant davantage de concepts liés à l'ensemble du processus de développement d'une application web, comme le wireframing ou le Design Thinking. Néanmoins, il reste très pertinent par rapport à la référence."}, {"exercise": {"id": "52606c0f2a784a0f8bab387798a3f493", "query": "Le Stylescape permet de communiquer efficacement avec les clients en leur donnant une idée claire de <blank> du projet final.", "answers": ["l'apparence et de la sensation"], "distractors": [["la rentabilité et de l'ergonomie", "le public cible et des délais", "les étapes de production et de l'esthétique", "les contraintes techniques et de l'interface", "la palette de couleurs et des typographies", "les technologies utilisées et des coûts"]], "feedback": "Le Stylescape communique aux clients une vision globale du projet, notamment en ce qui concerne 'l'apparence et la sensation', car cela reflète l'émotion et l'ambiance que le projet de design doit transmettre. Les autres options ne mentionnent pas directement cet aspect visuel et émotionnel clé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension d'un concept clé lié à la conception d'une application web, en particulier l'importance de la communication visuelle avec les clients à travers le Stylescape. Cela fait écho aux éléments abordés dans la synthèse, tels que l'esthétique et la fonctionnalité des interfaces numériques. Cependant, bien que pertinent, l'exercice ne couvre pas directement tous les aspects du développement d'une application web mentionnés dans la référence, comme l'expérience utilisateur ou le design system. Il aurait pu être amélioré en intégrant des éléments supplémentaires liés à ces concepts pour obtenir une note parfaite."}, {"exercise": {"id": "d26ff603d732470c83c52a9b3dec2af2", "statement": "Les idées développées peuvent faire l'objet de plusieurs itérations pour s'assurer qu'elles remplissent les critères du projet.", "veracity": true, "feedback": "Cette affirmation est correcte. Les idées sont explorées à travers différentes variations et itérations, et elles subissent des ajustements nécessaires pour répondre aux objectifs et contraintes du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du processus itératif dans le développement d'un projet web, ce qui est en lien avec des concepts clés tels que le Design Thinking et l'importance de l'empathie et du prototypage. Bien qu'il ne couvre pas tous les aspects de la conception d'une application web, il aborde un élément essentiel de la gestion de projet et du développement UX/UI. La réponse correcte souligne également l'importance des ajustements nécessaires pour répondre aux objectifs du projet, ce qui est pertinent par rapport à la référence."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'étude des usagers dans le cadre d'un référentiel ergonomique, ce qui est un aspect clé de la conception d'une application web. La référence mentionne explicitement la conception d'expérience utilisateur (UX) et l'optimisation des interactions entre les utilisateurs et le produit numérique, ce qui est directement lié à l'analyse des besoins des usagers. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des questions sur d'autres concepts abordés dans la synthèse, tels que le wireframing ou le Design Thinking, pour couvrir une plus large gamme de compétences liées à la conception d'applications web."}, {"exercise": {"id": "e846ef0159d94e02a46b826e22c81e6b", "question": "Pour améliorer la compréhension d'une interface, que faut-il respecter principalement ?", "answers": ["La hiérarchie visuelle et l'ordre de lecture de l'utilisateur"], "distractors": ["Les polices de caractères artistiques et les animations interactives.", "Les couleurs de fond claires avec des éléments graphiques complexes.", "L'intégration de plusieurs menus déroulants imbriqués.", "L'affichage direct de plusieurs options techniques avancées.", "La quantité maximale d'informations sur une seule ligne.", "L'utilisation d'icônes réduites pour chaque section.", "Le positionnement aléatoire des boutons d'action.", "L'ajout de contenu vidéo en arrière-plan.", "La mise en place d'un menu global en bas de page."], "feedback": "Pour améliorer la compréhension d'une interface, il est important de respecter la hiérarchie entre les éléments visuels et de suivre l'ordre de lecture de l'utilisateur. Cela permet une meilleure compréhension de l'action à effectuer et facilite ainsi son utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé de la conception d'interface, à savoir la hiérarchie visuelle et l'ordre de lecture, qui sont essentiels pour optimiser l'expérience utilisateur. Cela correspond bien aux objectifs de la référence concernant la conception d'applications web. Cependant, il aurait pu être encore plus pertinent en intégrant des éléments supplémentaires liés à d'autres aspects du design UX/UI mentionnés dans la synthèse, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "d4e9ab91b0d543e59d4284af6b4ebc5f", "question": "Pourquoi la taille de l'écran mobile peut poser problème lors de la conception ?", "answers": ["La taille restreinte complique la créativité et le webdesign"], "distractors": ["Les smartphones n'ont pas assez de performances pour un bon design.", "Les sites mobiles ne peuvent pas contenir de contenu multimédia.", "La navigation mobile impose toujours deux mains pour interagir.", "L'amélioration des visuels pour mobile est plus simple qu'avec un ordinateur.", "La taille d’écran mobile améliore toujours l'expérience utilisateur.", "Les écrans de téléphone n'affichent pas les images en haute qualité.", "Le responsive design supprime tout besoin de réflexion créative.", "Les couleurs doivent changer entre les versions mobile et desktop.", "Toutes les interfaces mobiles doivent être monochromes pour optimiser le design."], "feedback": "La taille de l'écran d'un terminal mobile peut poser problème pour les créateurs de sites web, car cela limite leur capacité à être créatif et à concevoir des designs complexes et esthétiques. La limitation de l'espace sur un petit écran peut également poser des problèmes pour l'optimisation de la navigation et de l'expérience utilisateur globale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des défis liés à la conception d'applications web, en particulier en ce qui concerne l'expérience utilisateur sur des écrans de taille réduite. La question posée aborde un aspect clé de la conception UX/UI, qui est essentiel pour concevoir une application web efficace. La réponse correcte souligne les limitations créatives imposées par la taille de l'écran mobile, ce qui est pertinent par rapport aux concepts discutés dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur les méthodes de design ou d'autres aspects du développement d'applications web mentionnés dans la synthèse."}, {"exercise": {"id": "4570d883513647c595941a5d33546fc8", "question": "Pourquoi est-il risqué de réinventer une icône connue par les utilisateurs ?", "answers": ["Cela peut désorienter l'utilisateur et nuire à son expérience"], "distractors": ["Cela permet d'améliorer l'expérience utilisateur immédiatement.", "Cela rend l'interface plus créative et intuitive.", "Cela aide l'utilisateur à mieux comprendre les nouvelles fonctionnalités.", "Cela garantit une meilleure interaction avec la technologie.", "Cela simplifie l'utilisation des options avancées pour les experts.", "Cela permet de se différencier de la concurrence.", "Cela assure une compatibilité optimale avec toutes les interfaces existantes.", "Cela accroît la flexibilité de conception dans les interfaces complexes.", "Cela améliore la lisibilité générale des informations présentées à l'écran."], "feedback": "Les icônes familières sont facilement reconnaissables par les utilisateurs et leur permettent de comprendre rapidement comment utiliser une fonctionnalité sans avoir à apprendre de nouvelles représentations visuelles. Modifier une icône peut donc désorienter l'utilisateur et nuire à son expérience.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des icônes familières dans le design d'interface, ce qui est un aspect clé de la conception d'expérience utilisateur (UX) mentionné dans la référence. La question aborde directement les risques associés à la réinvention d'icônes connues, soulignant l'impact sur l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts comme le wireframing ou le Design Thinking pour une évaluation plus complète des compétences en conception d'application web."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface utilisateur, en particulier l'importance de respecter les normes de référence pour éviter de perdre l'utilisateur. Cela est directement lié à la synthèse qui aborde la conception UX et UI, ainsi que l'importance d'une interface intuitive et cohérente. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des questions sur d'autres aspects clés mentionnés dans la synthèse, comme le wireframing ou le Design Thinking. Néanmoins, il teste efficacement un aspect essentiel du développement d'applications web."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'adaptation du contenu aux appareils mobiles, ce qui est un aspect clé de la conception d'expérience utilisateur (UX) mentionné dans la référence. En effet, une expérience utilisateur médiocre due à un mauvais design mobile peut avoir des conséquences négatives sur l'interaction des utilisateurs avec l'application. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant d'autres concepts comme le wireframing ou le Design Thinking pour couvrir davantage d'aspects liés à la conception d'une application web."}, {"exercise": {"id": "870f44252b3f466d91e4ffa414b5cdbe", "query": "La hiérarchie des éléments d'une interface guide l'utilisateur dans sa navigation. Il commence par lire le contenu, puis, s'il le juge nécessaire, effectue une action pour laquelle il devra trouver <blank>.", "answers": ["un call to action"], "distractors": [["un formulaire de contact", "une barre de recherche", "un menu déroulant", "une notification", "un footer", "une suggestion d'article"]], "feedback": "Le 'call to action' est une incitation à accomplir une action particulière, par exemple cliquer sur un bouton ou remplir un formulaire. C'est l'élément que l'utilisateur doit trouver après avoir parcouru le contenu, lorsqu'il décide d'interagir avec l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des éléments d'interface, en particulier le 'call to action', qui est crucial pour optimiser l'expérience utilisateur (UX). Cela correspond bien à la référence qui aborde la conception d'applications web et l'interaction entre utilisateurs et interfaces. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des aspects liés à la conception visuelle ou à des méthodes comme le wireframing ou le Design Thinking, qui sont également mentionnés dans la synthèse."}, {"exercise": {"id": "1e323418b9b0437f90ae3d1aa34b751e", "statement": "L'optimisation d'un système d'information est uniquement liée à l'expérience utilisateur (UX).", "veracity": false, "feedback": "L'optimisation d'un système d'information est un processus qui englobe plusieurs aspects, y compris l'expérience utilisateur (UX), mais aussi le code partagé et d'autres éléments techniques. Ce n'est donc pas uniquement associé à l'UX.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7ef1c347f92242c4a3ba9cd9ea3f5492", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "o Un web très concurrentiel (MARKETING) :unselected:o Un web de plus en plus exigent de la part des usagers (UX) :unselected:o Une obligation de visibilité (SEO) :unselected:o A la recherche d'une croissance ou de part de marché inexploitée (ACCESSIBILITE) :unselected: :unselected:o Sécurisation et productivité d'un système d'information (UX, CODE PARTAGE, OPTIMISATION) o Une problématique grandissante autour de la protection de la donnée personnelle (RGPD) :unselected:o Un devoir éthique autour l'accessibilité :unselected:o Un devoir éthique autour de l'éco responsabilité :unselected: :unselected:o ..", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3a04837d7dcd40d3aa0607e1b13a98da", "next_id": "20ea402f1e1c41a68ea9813f00d5df04", "prev_id": "3a04837d7dcd40d3aa0607e1b13a98da", "associated_block_ids": [], "first_page": 14, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension de l'importance de l'expérience utilisateur (UX) dans le développement d'une application web, ce qui est un concept clé abordé dans la référence. Bien que l'affirmation soit incorrecte en suggérant que l'optimisation est uniquement liée à l'UX, la réponse correcte souligne que d'autres éléments techniques sont également impliqués. Cela montre une bonne compréhension des divers aspects du développement d'un système d'information. Cependant, l'exercice aurait pu être encore plus pertinent s'il avait inclus des éléments spécifiques sur les méthodes de conception ou les outils mentionnés dans la synthèse."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'étude des usagers dans le choix des éléments ergonomiques, ce qui est un aspect clé de la conception d'expérience utilisateur (UX) mentionné dans la référence. L'affirmation et son explication soulignent bien que les décisions en matière d'ergonomie doivent être basées sur les besoins et attentes des utilisateurs, ce qui est fondamental pour concevoir une application web efficace. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à d'autres concepts abordés dans la synthèse, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "2f9b8c77092542f7b1b9ff425a63a1c1", "statement": "La hiérarchie entre les éléments d'une interface aide à mieux comprendre les actions à réaliser.", "veracity": true, "feedback": "Il est exact que la hiérarchie entre les différents éléments permet une meilleure compréhension des actions à entreprendre. Cette organisation guide l'utilisateur dans son parcours, rendant l'expérience plus fluide et intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'une application web, en particulier l'importance de la hiérarchie des éléments dans une interface utilisateur. Cela fait directement écho aux notions de design UX et UI mentionnées dans la synthèse, qui soulignent comment une bonne organisation des éléments peut améliorer l'expérience utilisateur. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects du développement d'une application web, comme le wireframing ou le Design Thinking. C'est pourquoi il obtient un score élevé mais pas maximal."}, {"exercise": {"id": "533c6a43d0bd4ceabcaebad8d3a979dc", "statement": "Le design system est appliqué sur plusieurs produits.", "veracity": true, "feedback": "Le design system est effectivement conçu pour être utilisé sur plusieurs produits, car il propose une bibliothèque de composants réutilisables pour garantir la cohérence entre ces différents produits.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'applications web, en particulier l'utilisation d'un design system pour assurer la cohérence entre différents produits. Cela correspond bien aux objectifs de la référence qui traite de la conception et du développement d'applications, ainsi que de l'importance des éléments graphiques réutilisables. Cependant, l'exercice pourrait être amélioré en intégrant des questions supplémentaires sur d'autres aspects du développement web mentionnés dans la synthèse, comme le wireframing ou l'expérience utilisateur."}, {"exercise": {"id": "aad4c1e48aa8491aa7583ee04f54f1c1", "statement": "Le client cherche uniquement une expérience d'achat rapide et sécurisée lorsqu'il achète un produit en ligne.", "veracity": false, "feedback": "Le client souhaite non seulement une expérience d'achat rapide et sécurisée, mais aussi un processus intuitif et de l'attention. Il ne s'agit pas simplement de rapidité et de sécurité, mais également de la qualité générale de l'expérience offerte par la marque ou le service.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4b31a1f15671469492e8fed3422642c0", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Votre stratégie digitale doit être optimisée. Aujourd'hui, qu'il achète un tee-shirt ou une maison, ce que veut le client est simple ; une expérience facile et rapide, un processus d'achat intuitif et sécurisé, mais aussi de l'attention. La journée de cette cible et découpé en plusieurs étapes. Les instant de connexions sont les plus important, car c'est quand l'utilisateur est sur son smartphone qu'il est le plus susceptible d'être intéressé par une offre, un service ou un produit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bd09de86292249b4b366c29892b4d01e", "next_id": "2a91cc8dc04845f9a588cc1cb57eb302", "prev_id": "38a2748c2b83431597eee992a4f91244", "associated_block_ids": [], "first_page": 208, "last_page": 215, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des attentes des utilisateurs en matière d'expérience utilisateur (UX), ce qui est un concept clé dans la conception d'applications web. Il souligne l'importance de ne pas se limiter à des aspects techniques comme la rapidité et la sécurité, mais aussi à l'intuitivité et à la qualité de l'expérience globale. Cela correspond bien aux objectifs de conception mentionnés dans la référence, notamment en ce qui concerne l'optimisation des interactions entre les utilisateurs et le produit numérique. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments spécifiques sur le design ou les méthodes comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "315cfc8b0c0a4c239408287509fd82a3", "statement": "L'ajout d'animations est utilisé uniquement pour rendre un site plus esthétique, sans impact sur l'expérience utilisateur.", "veracity": false, "feedback": "Bien que l'ajout d'animations puisse contribuer à l'esthétique d’un site Web, il ne se limite pas à cela. Les animations jouent également un rôle dans l'expérience utilisateur, en influençant potentiellement les émotions et les perceptions des utilisateurs dans les zones de conflit mentionnées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des concepts liés à l'expérience utilisateur (UX) et à l'esthétique dans le développement d'applications web, qui sont des éléments clés de la référence. En affirmant que les animations ont un impact sur l'expérience utilisateur et pas seulement sur l'esthétique, il souligne l'importance de concevoir des interfaces qui optimisent les interactions. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des aspects supplémentaires comme le wireframing ou le Design Thinking, mais il reste très pertinent par rapport aux objectifs d'apprentissage identifiés."}, {"exercise": {"id": "5e5e624e0c9749189df302e3a469edd0", "statement": "Une application intuitive fonctionne de manière proche des habitudes déjà acquises par les utilisateurs.", "veracity": true, "feedback": "L'énoncé est correct car il est recommandé de concevoir une application qui se rapproche du mode de fonctionnement auquel les utilisateurs sont déjà habitués, pour éviter des difficultés inutiles dans l'utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception d'applications web, à savoir l'importance de l'intuitivité et de l'adaptation aux habitudes des utilisateurs. Cela fait écho à la notion d'expérience utilisateur (UX) mentionnée dans la synthèse, qui souligne que les interfaces doivent être optimisées pour répondre aux besoins des utilisateurs. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur le processus de conception ou sur d'autres aspects comme le wireframing ou le Design Thinking pour une évaluation plus complète."}, {"exercise": {"id": "5c99b0872ad447488fc21208ec035890", "statement": "La constance dans l'utilisation d'icônes universelles permet d'améliorer l'intuitivité d'une interface.", "veracity": true, "feedback": "L'emploi d'icônes avec une signification établie, connue des utilisateurs, permet de maintenir une interface intuitive. Cela évite de réinventer sans raison des éléments qui ont déjà fait leurs preuves dans la compréhension utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'intuitivité dans la conception d'une interface, ce qui est un concept clé dans le développement d'applications web. L'affirmation sur l'utilisation d'icônes universelles est pertinente car elle touche à la conception UX et UI, qui sont essentielles pour optimiser les interactions entre les utilisateurs et le produit numérique. Cependant, bien que cela soit un aspect important, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts mentionnés dans la synthèse, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "f7db6816b25d40e7b88284be2d31d0ac", "statement": "Les utilisateurs préfèrent des icônes nouvelles et originales plutôt que celles établies pour mieux comprendre leur fonction.", "veracity": false, "feedback": "Au contraire, il est mentionné que les icônes ayant une signification établie sont déjà connues des utilisateurs et qu'il est risqué d'en créer de nouvelles. Le changement pourrait rendre l'interface moins intuitive et désorienter les utilisateurs, ce qui est à éviter pour ne pas les faire fuir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface utilisateur, en particulier l'importance de l'intuitivité et de la familiarité des éléments visuels comme les icônes. Cela est directement lié à la référence qui aborde la conception UX et UI, ainsi que l'optimisation des interactions entre utilisateurs et produit numérique. L'affirmation testée met en lumière un aspect clé du design centré sur l'utilisateur, ce qui justifie une note élevée. Cependant, il aurait été bénéfique d'inclure davantage d'aspects liés à la gestion de projet ou au wireframing pour couvrir plus largement le sujet."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de design system, qui est un élément clé dans la conception d'applications web. La question cible directement l'importance de standardiser les éléments graphiques et visuels, ce qui est en ligne avec les objectifs d'apprentissage liés à la conception UX/UI mentionnés dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des aspects supplémentaires comme l'impact sur l'expérience utilisateur ou le processus de développement global pour atteindre une note parfaite."}, {"exercise": {"id": "f3dc4db503a64d7696628bc1bc7eeb26", "question": "Quels éléments sont inclus dans un design system ?", "answers": ["Les règles visuelles, graphiques, de branding et de ton"], "distractors": ["Uniquement des animations interactives de prototype", "Exclusivement des directives de sécurité informatique", "Des instructions relatives à l'expérience utilisateur", "Le suivi des communications internes à l'entreprise", "La gestion des équipes et des plannings", "Plans détaillés pour la stratégie publicitaire", "Une charte définissant les différents KPI", "Le modèle économique de l'entreprise", "La liste des formats de fichier utilisés"], "feedback": "Un design system regroupe tous les éléments nécessaires pour guider la création des produits et services d'une entreprise, tels que les règles visuelles, graphiques, de branding et de ton. Cela permet de maintenir une cohésion et une identité forte pour la marque.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'une application web, en se concentrant sur les éléments d'un design system. Cela est pertinent car le design system est essentiel pour assurer une cohérence et une expérience utilisateur optimale dans le développement d'applications. Cependant, l'exercice pourrait être amélioré en incluant des questions qui abordent également d'autres aspects de la conception web mentionnés dans la synthèse, comme l'UX/UI ou le wireframing, afin de couvrir un éventail plus large des compétences nécessaires à la conception d'une application web."}, {"exercise": {"id": "e11c2ad84ac74e07a8f72c3b516e8280", "statement": "Un design system ne concerne que les éléments graphiques d'un produit.", "veracity": false, "feedback": "Un design system englobe non seulement les éléments graphiques, mais aussi des aspects comme les règles, le branding et le ton, afin de créer un système standardisé réunissant tous les points de contact entre les acteurs du développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'applications web, en particulier le design system. Bien que l'affirmation porte sur une définition partielle du design system, l'explication fournie clarifie son étendue et sa pertinence dans le contexte de la conception UX/UI. Cela montre que l'apprenant doit comprendre non seulement les éléments graphiques, mais aussi les autres aspects qui contribuent à une expérience utilisateur cohérente. Cependant, l'exercice pourrait être amélioré en intégrant des questions supplémentaires sur d'autres concepts abordés dans la synthèse, comme le wireframing ou le Design Thinking."}, {"exercise": {"id": "8f28a9f88d34427b97ac8306108b18b3", "statement": "Le but principal d'un design system est de standardiser les éléments liés au développement d'un produit pour garantir la cohérence.", "veracity": true, "feedback": "Le but d'un design system est effectivement de regrouper graphiques, règles, branding, ton, etc. en un seul système, assurant ainsi une cohérence dans le contact avec les différents acteurs participant au développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'applications web, en particulier l'importance d'un design system pour garantir la cohérence dans le développement d'un produit. Cela correspond bien aux éléments abordés dans la synthèse, notamment sur l'esthétique et la fonctionnalité des interfaces numériques ainsi que sur l'importance de la standardisation. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des aspects supplémentaires comme l'expérience utilisateur ou les méthodes de conception telles que le Design Thinking."}, {"exercise": {"id": "388525c44d4749319aec5fc378adefa3", "statement": "Un design system se limite uniquement aux éléments graphiques et visuels d'un produit.", "veracity": false, "feedback": "Un design system ne se limite pas uniquement aux éléments graphiques et visuels. Il inclut également des règles, des éléments de branding, le ton, et d'autres points de contact relatifs au produit, afin de créer un système cohérent et standardisé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'applications web, en particulier le design system. Bien que l'affirmation porte sur un aspect spécifique des design systems, elle touche à des éléments fondamentaux de la conception et du développement d'interfaces numériques, qui sont mentionnés dans la synthèse. L'explication fournie renforce cette compréhension en élargissant le concept au-delà des seuls éléments graphiques. Cependant, l'exercice pourrait être amélioré en intégrant davantage de concepts liés à l'expérience utilisateur ou à la gestion de projet pour obtenir une note parfaite."}, {"exercise": {"id": "9ffa467f37084a368ad722d16d9aebc8", "query": "Le zoning permet de définir l'organisation générale des pages après la création de <blank>.", "answers": ["l'arborescence"], "distractors": [["les wireframes", "la charte graphique", "le prototype", "les maquettes", "l'interface", "le contenu"]], "feedback": "La bonne réponse est 'l'arborescence', car le zoning intervient généralement après que l'arborescence a été créée. L'arborescence correspond à la structure hiérarchique du site, tandis que le zoning s'intéresse à la répartition des blocs de contenu sur les pages. Les autres réponses sont incorrectes car elles concernent des étapes ou éléments distincts dans le processus de conception web (wireframes, maquettes, etc.).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à la conception d'une application web, en l'occurrence le zoning et son lien avec l'arborescence. Cela fait écho à la synthèse qui aborde des éléments essentiels de la conception UX/UI et de la structure des interfaces. Cependant, bien que pertinent, cet exercice se concentre sur un aspect spécifique (l'arborescence) sans couvrir d'autres dimensions importantes mentionnées dans la référence, comme le wireframing ou le design system. Une note de 7 reflète donc une bonne pertinence tout en reconnaissant qu'il ne couvre pas entièrement tous les aspects du développement d'une application web."}, {"exercise": {"id": "76bdc1cfb02b421aa9ebecc7377c69b5", "query": "Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que <blank>.", "answers": ["vos utilisateurs ont l'habitude de côtoyer"], "distractors": [["les tendances du marché exigent", "les concepteurs jugent innovant", "vous voulez proposer", "la concurrence met en avant", "les experts considèrent optimal", "les nouveaux standards recommandent"]], "feedback": "L'application doit fonctionner en s'appuyant sur ce que les utilisateurs connaissent déjà ou ont l'habitude d'utiliser. Cela rend l'expérience plus fluide et intuitive, évitant des frustrations liées à un trop grand changement ou à des nouveautés inutiles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans la conception d'une application web, ce qui est un aspect clé de la référence. En demandant aux apprenants de compléter une phrase sur le fonctionnement intuitif d'une application, il les incite à réfléchir à la nécessité d'adapter le design aux habitudes des utilisateurs. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments spécifiques mentionnés dans la synthèse, tels que le wireframing ou le Design Thinking, pour tester plus largement les compétences liées à la conception et au développement d'applications web."}, {"exercise": {"id": "bf5b3d2280b34d15a072e6270eabfaca", "question": "Quel est l'avantage principal du Stylescape par rapport à d'autres outils similaires ?", "answers": ["Il offre une expérience visuelle plus complète et immersive"], "distractors": ["Il est moins coûteux à réaliser.", "Il nécessite moins de ressources de conception.", "Il est entièrement basé sur des données chiffrées.", "Il permet de travailler sans retour client.", "Il ne demande aucun ajustement après présentation.", "Il se concentre uniquement sur les aspects techniques.", "Il exclut toute visualisation graphique.", "Il se passe d'interactions avec les parties prenantes.", "Il est utilisé uniquement pour la communication interne."], "feedback": "Le Stylescape va plus loin en offrant une représentation plus complète et immersive de l'expérience visuelle attendue, ce qui facilite la compréhension et la visualisation du résultat final. Il permet ainsi d'aligner plus efficacement les idées avec les clients et les parties prenantes concernées. Cela le rend plus avantageux par rapport à d'autres outils similaires qui ne fournissent peut-être pas une telle expérience visuelle complète.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1cc8dc888f674583a957f2a782085892", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les deux outils sont utilisés pour communiquer et aligner les idées avec les clients ou les parties prenantes concernées. Cependant, le Stylescape va plus loin en offrant une représentation plus complète et immersive de l'expérience visuelle attendue, ce qui facilite la compréhension et la visualisation du résultat final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "088d4c7f46de40f0986cfa0cc08bc0bc", "prev_id": "ec3a9e230f6943ae8c0b2d363898bc4d", "associated_block_ids": [], "first_page": 19, "last_page": 19, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un outil spécifique (Stylescape) qui est pertinent dans le contexte de la conception d'applications web, notamment en ce qui concerne l'expérience utilisateur et la communication avec les parties prenantes. Bien que cela touche à des aspects importants de la conception UX/UI, l'exercice pourrait être amélioré en se concentrant davantage sur des concepts plus larges ou fondamentaux liés à la conception d'une application web, comme le wireframing ou le Design Thinking. Néanmoins, il reste pertinent car il aborde un outil utile dans le processus de conception."}, {"exercise": {"id": "4cc91b3570c44bd6b1da6c8f3f90d7d2", "question": "Que désigne le terme espace blanc en conception d'interface ?", "answers": ["Le vide autour ou à l'intérieur des éléments de la conception"], "distractors": ["La couleur utilisée pour les polices de texte", "Les bordures des fenêtres de dialogue", "La taille prédéfinie des sections", "Un affichage en mode plein écran", "Le contraste entre différents blocs", "La distance entre deux images", "La zone dédiée aux animations", "Un type spécifique de cadre dans l'interface", "La forme générale de l'interface"], "feedback": "L'espace blanc, également appelé espace négatif, désigne les vides autour ou à l'intérieur des éléments de la conception. Cet espace peut être utilisé de manière stratégique pour améliorer la lisibilité et la mise en valeur des différents éléments de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur le concept d'espace blanc en conception d'interface, qui est un aspect pertinent de la conception UX/UI. Bien que cela fasse partie des éléments à considérer lors de la création d'une application web, l'exercice ne couvre pas directement les compétences clés mentionnées dans la référence, telles que le design thinking, le wireframing ou l'utilisation de méthodes comme l'Atomic Design. Il teste une connaissance spécifique plutôt qu'une compréhension globale du processus de conception d'application web. Par conséquent, bien qu'il soit pertinent, il n'évalue pas pleinement les objectifs d'apprentissage liés à la conception d'une application web."}, {"exercise": {"id": "1543b5dc9b3042f19ae1aa3cf53e3451", "question": "Que se passe-t-il si le design d’un système est trop simplifié pour l’utilisateur ?", "answers": ["La complexité se déplace vers celui qui gère le système"], "distractors": ["La fonctionnalité devient intuitive pour tous les utilisateurs du système.", "La gestion visuelle devient plus complexe à traiter pour tous.", "Le système devient inutilisable à cause de sa simplicité excessive.", "L'utilisateur bénéficie d'un contrôle caché supplémentaire.", "Les fonctionnalités sous-jacentes sont complètement éliminées.", "Le transfert de difficulté se résout facilement par un algorithme simple.", "La gestion technique devient plus transparente et facile.", "La simplification n'a aucun impact sur la gestion.", "Un équilibre est trouvé entre simplicité et performance pour l’utilisateur."], "feedback": "Si le design d'un système est trop simplifié pour l'utilisateur, la complexité sera déplacée vers celui qui le gère. En d'autres termes, la fonctionnalité peut devenir plus complexe à traiter pour l'utilisateur, tandis que la gestion technique peut devenir plus transparente et facile pour celui qui gère le système. Cela souligne l'importance de trouver un équilibre entre simplicité et performance pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7c32d0385f2d45a5b516ab34f571167c", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Cet effet s'explique par le fait que les éléments présentés en premier seront plus facilement enregistrés dans le mémoire à long terme, et ceux vus en dernier le seront dans la mémoire à court terme. Le design ne peut être simplifié que jusqu'à un certain point. A partir de ce point, la complexité ne sera que déplacée. Si le système doit être simplifié pour l'utilisateur, il sera peut être complexifié pour celui qui le gère. Le transfert de difficulté pour être sur la surface (visuel) ou bien caché (fonctionnalité sous-jacente).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "59870c9a6e264b4c960482f7bf62dade", "next_id": "68231e4ebb044b039db929d78725c81c", "prev_id": "a224bc099e774bf69891cc063f65488d", "associated_block_ids": [], "first_page": 55, "last_page": 60, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de la simplification du design d'un système, ce qui est pertinent pour le développement d'applications web et la conception UX mentionnée dans la référence. Cependant, il se concentre principalement sur les conséquences d'une simplification excessive plutôt que sur les concepts clés tels que le wireframing, l'Atomic Design ou le Design Thinking. Bien qu'il teste une compréhension des implications du design, il ne couvre pas directement les compétences essentielles liées à la conception et au développement d'une application web. Par conséquent, bien qu'il soit pertinent, il ne touche pas suffisamment aux aspects fondamentaux de la référence."}, {"exercise": {"id": "58ea0ae414de45e78e0aaa0b8a416973", "question": "Quelle méthode fait partie des évolutions récentes du métier de Designer ?", "answers": ["Le Design Thinking"], "distractors": ["Le Lean Management", "La Gestion de l’innovation", "Le Growth Hacking", "L'Agile Scrum", "Le DevOps", "Le Marketing Automation", "La Méthode Kanban", "Le Product Management", "La Théorie des contraintes"], "feedback": "Le Design Thinking est une méthode très populaire dans le monde du design pour résoudre des problèmes complexes. Elle consiste à adopter une approche centrée sur l'utilisateur en utilisant des techniques créatives pour trouver des solutions innovantes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c3856ee582864d13a2fe35045e21346f", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Le métier de Designer a beaucoup évolué ces dernières années avec l'apparition de différentes spécialités ( UX Designer, UIDesigner, Product Designer, ... ) denouvelles méthodes (Atomic Design, Design Thinking, ... ) et de nouveaux outils (Sketch, Figma, Adobe XD, ... )", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef9ea6dd9a1c4597a041e212a02fc1e7", "next_id": null, "prev_id": "bd60d99870b747389a3bbc7e9ecb73ee", "associated_block_ids": [], "first_page": 3, "last_page": 3, "start_time": null, "end_time": null, "doc_id": 13680, "doc_label": "Sequence 7_créativité et originalité", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une méthode spécifique, le Design Thinking, qui est effectivement mentionnée dans la synthèse comme une approche centrée sur l'utilisateur pour résoudre des problèmes complexes. Cependant, bien que cela soit pertinent pour le contexte de la conception d'applications web, l'exercice ne couvre pas directement les autres aspects clés du développement d'une application web tels que l'UX/UI design, le wireframing ou la gestion de projet. Il aurait été plus pertinent de poser une question qui englobe plusieurs concepts liés à la conception d'application web plutôt qu'une seule méthode."}, {"exercise": {"id": "2b0b51b6c6f54f0f93556389a239ab78", "question": "Quel outil est utilisé par les Designers parmi ces propositions ?", "answers": ["Le figma"], "distractors": ["Trello", "Visual Studio Code", "Invision", "WordPress", "Canva", "Affinity Photo", "GitHub", "Blender", "Le jira"], "feedback": "Figma est un outil de conception d'interface utilisateur qui permet aux designers de collaborer sur des projets en temps réel et de créer des prototypes interactifs. Il est de plus en plus utilisé dans l'industrie du design pour sa facilité d'utilisation et ses fonctionnalités avancées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c3856ee582864d13a2fe35045e21346f", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Le métier de Designer a beaucoup évolué ces dernières années avec l'apparition de différentes spécialités ( UX Designer, UIDesigner, Product Designer, ... ) denouvelles méthodes (Atomic Design, Design Thinking, ... ) et de nouveaux outils (Sketch, Figma, Adobe XD, ... )", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef9ea6dd9a1c4597a041e212a02fc1e7", "next_id": null, "prev_id": "bd60d99870b747389a3bbc7e9ecb73ee", "associated_block_ids": [], "first_page": 3, "last_page": 3, "start_time": null, "end_time": null, "doc_id": 13680, "doc_label": "Sequence 7_créativité et originalité", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'un outil spécifique utilisé dans le design d'interface, ce qui est pertinent par rapport à la référence sur la conception d'applications web. Cependant, il ne couvre pas l'ensemble des concepts clés mentionnés dans la synthèse, tels que l'expérience utilisateur (UX), le wireframing ou les méthodes de design comme l'Atomic Design et le Design Thinking. Bien que Figma soit un outil important pour les designers UX/UI, l'exercice pourrait être amélioré en intégrant des questions qui évaluent une compréhension plus large des processus de conception et de développement d'applications web."}, {"exercise": {"id": "8a0090c63f2543fb9a56f60fd2dc163c", "question": "Comment est défini le terme design dans ce contexte spécifique ?", "answers": ["Il est synonyme de « conception »"], "distractors": ["Il se réfère aux illustrations", "Il s'agit de broderie numérique", "Il désigne des algorithmes", "Il décrit uniquement l'UX", "Il parle de graphisme pur", "Design signifie codage", "Il devient un synonyme de créativité", "Il est lié au marketing", "Il correspond à une interface"], "feedback": "Le terme design est souvent associé à la création visuelle, mais dans ce cas précis, il est utilisé comme synonyme de conception. Il s'agit donc d'une approche qui va au-delà de l'esthétique et qui inclut également la planification et la conception d'une expérience utilisateur optimale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du terme 'design' dans le contexte de la conception d'applications web, ce qui est pertinent par rapport à la référence. Cependant, il ne couvre pas directement les aspects clés tels que l'expérience utilisateur (UX), le wireframing ou les méthodes de design comme l'Atomic Design et le Design Thinking. Bien que la réponse correcte soit liée à la conception, l'exercice pourrait être amélioré en intégrant des questions qui évaluent plus spécifiquement les compétences et concepts mentionnés dans la synthèse."}, {"exercise": {"id": "58a83fde0a3348baaca5da731c2c0cf1", "query": "Dans le domaine du design d'expérience, le design ne se limite pas à <blank>, mais inclut également la prise en compte de l'expérience utilisateur.", "answers": ["la conception"], "distractors": [["le dessin", "la programmation", "le codage", "la visualisation", "la création d'interface", "les outils graphiques"]], "feedback": "La bonne réponse est 'la conception', car dans le cadre du design d'expérience, il est essentiel de comprendre que le terme « design » renvoie à la manière dont un produit est conçu, avec un accent particulier sur l'expérience utilisateur, et non simplement sur la création visuelle ou graphique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du concept de design dans le contexte de l'expérience utilisateur, ce qui est pertinent par rapport à la référence sur la conception d'une application web. Cependant, il se limite à un aspect très spécifique du design (la conception) sans aborder d'autres éléments clés mentionnés dans la synthèse, tels que le wireframing, l'Atomic Design ou le Design Thinking. Bien qu'il soit utile pour évaluer une partie de la compréhension des concepts liés au design, il ne couvre pas suffisamment les divers aspects nécessaires à la conception d'une application web complète."}, {"exercise": {"id": "2d74a52ca7074953a65510c6dc98ea28", "statement": "Le travail de l'UX designer repose uniquement sur des lois immuables de psychologie cognitive.", "veracity": false, "feedback": "Le travail de l'UX designer s'appuie sur des lois de psychologie cognitive, mais ces lois ne sont pas absolues. Elles doivent être interprétées en fonction des capacités individuelles de chaque utilisateur et avec le recul nécessaire.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b70f2375919f4b57aa7632211c993186", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Le travail de l'UX designer est souvent basé sur des « lois » de psychologie cognitive écrites dans les années 50 (étude scientifique des fonctions cognitives humaines : la mémoire, le langage, les perceptions, le raisonnement, la résolution d'un problème) qui conditionnent l'expérience utilisateur. Certaines de ces lois sont prendre avec le recul nécessaire, une loi de psychologie cognitive n'étant pas forcément une règle absolue et dépend par exemple des capacités de chaque utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": "31833da3392242a09c1942e245ee9bcc", "prev_id": "55ce7e9b2dc74cb3b6a9e70181055029", "associated_block_ids": [], "first_page": 2, "last_page": 2, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des principes de l'UX design, ce qui est pertinent par rapport à la référence sur la conception d'une application web. Cependant, il se concentre uniquement sur un aspect spécifique (les lois de la psychologie cognitive) sans aborder d'autres éléments clés tels que le wireframing, le Design Thinking ou l'importance de l'empathie dans le processus de conception. Bien qu'il teste une connaissance importante, il ne couvre pas suffisamment les divers aspects du développement d'une application web pour obtenir une note plus élevée."}, {"exercise": {"id": "a445f4b4019a4cff837aa3d8e9bba2c5", "statement": "Il n'est pas nécessaire de prendre en compte la personnalité du service lors de la création de CTA.", "veracity": false, "feedback": "Il est explicitement mentionné qu'il faut tenir compte de la personnalité que l'on souhaite transmettre via le produit ou service lorsqu'on décide du format de CTA à utiliser.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "adfd1b1bb75348adb19ed130d411fcb0", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut tout d'abord savoir qu'il existe différents types de CTA et qu'en fonction de l'importance que l'on souhaite donner à l'action, il faut choisir entre ces trois gabarits : Bien sûr il faut prendre en compte le type de service / produit et la personnalité qu'on souhaite transmettre mais c'est une donnée intéressante à garder en tête !", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "55f684c91106495595873b5ac0d2fdb1", "next_id": "f6522177a2774dce8b042a498e560196", "prev_id": "55f684c91106495595873b5ac0d2fdb1", "associated_block_ids": [], "first_page": 252, "last_page": 259, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect important de la conception d'une application web, à savoir l'importance de prendre en compte la personnalité du service lors de la création d'appels à l'action (CTA). Cela est pertinent pour le développement d'une expérience utilisateur optimisée. Cependant, bien que cela touche un point clé, l'exercice ne couvre pas directement des concepts plus larges tels que le design UX/UI ou les méthodes de conception comme le wireframing ou le Design Thinking. Il aurait pu être plus complet en intégrant des éléments liés à ces concepts clés."}, {"exercise": {"id": "5dfa078c93a7429e8dc56bddb5e73e9f", "statement": "Le mobile représente plus de 52% du trafic en ligne, ce qui rend le responsive design essentiel.", "veracity": true, "feedback": "Il est correct que le mobile représente plus de la moitié du trafic en ligne. Dans ce contexte, il est crucial de concevoir des sites ou applications compatibles avec divers appareils, notamment mobiles, d'où l'importance du responsive design pour offrir une bonne expérience utilisateur sur tous types de supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'applications web, à savoir le responsive design, qui est lié à l'expérience utilisateur (UX). Cependant, il ne couvre pas directement les concepts clés mentionnés dans la référence, tels que le wireframing, le Design Thinking ou l'utilisation de méthodes comme l'Atomic Design. Bien qu'il soit pertinent pour la compréhension des besoins des utilisateurs sur différents appareils, il ne teste pas suffisamment les compétences liées à la conception et au développement d'une application web dans son ensemble."}, {"exercise": {"id": "74b93688d1464fd6b672785d4597f8ec", "statement": "Les concepteurs apportent systématiquement de la valeur ajoutée à leurs applications en ajoutant plus de fonctionnalités.", "veracity": false, "feedback": "En réalité, les concepteurs introduisent parfois des fonctionnalités supplémentaires qui complexifient le développement de l'application, sans forcément apporter de valeur ajoutée. Cela peut nuire à l'efficacité et à la simplicité de l'application.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de la valeur ajoutée des fonctionnalités dans le développement d'applications, ce qui est pertinent pour la conception d'une application web. Il met en lumière un aspect important de l'expérience utilisateur et du design, à savoir que l'ajout de fonctionnalités ne garantit pas toujours une amélioration de l'application. Cependant, l'exercice pourrait être plus directement lié aux concepts clés tels que le wireframing, le Design Thinking ou les méthodes UX/UI mentionnées dans la synthèse. En somme, bien qu'il soit pertinent, il ne couvre pas entièrement les éléments essentiels liés à la conception d'une application web."}, {"exercise": {"id": "579083e002ab467293b4fd8202dffcdc", "statement": "Une innovation trop en avance sur son temps peut provoquer un manque d'affordance chez les utilisateurs.", "veracity": true, "feedback": "Si un produit est trop innovant, il risque de ne pas être immédiatement compréhensible ou utilisable pour les utilisateurs, ce qui génère un manque d'affordance, c'est-à-dire que les utilisateurs ne comprendront pas instinctivement comment interagir avec le produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1abac8ad73f44a138292a5f722370ee8", "order": 11.0, "image_url": null, "origin_type": "document_content", "text": "Il y a des acquis en design, vous ne voudriez pas revenir en arrière : aujourd'hui, on touche son smartphone pour naviguer. C'était peut-être un peu déroutant au départ, mais maintenant ça y est, tout le monde y est habitué, et sait parfaitement les gestes à accomplir pour déclencher telle ou telle action sur un smartphone. Si une nouvelle innovation prend le pas et s'inspire de la base d'une précédente innovation (que tout le monde a eu le temps de prendre en main), ça passe ... et cela ne demande qu'un léger temps d'adaptation. Par ailleurs, si un nouveau produit est trop innovant, trop en avance sur son temps, il va générer un manque d'affordance :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "82b1e976385f48f3b791d3d9ba972f6d", "next_id": "dbbb3cfdbcff4c9b8cef0496b22991a9", "prev_id": "b2826cf8aa734b6cb0713a0ecd09a49a", "associated_block_ids": [], "first_page": 166, "last_page": 167, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept d'affordance, qui est pertinent dans le contexte de la conception d'expérience utilisateur (UX) et du design d'interfaces. Bien que cela soit lié à la compréhension des interactions entre les utilisateurs et un produit numérique, l'exercice ne couvre pas directement les aspects clés mentionnés dans la référence, tels que le processus de conception, le wireframing ou l'utilisation de méthodes comme l'Atomic Design. Il teste une notion importante mais ne permet pas d'évaluer pleinement la maîtrise des compétences nécessaires pour concevoir une application web."}, {"exercise": {"id": "2c1395cb073e47e99fb0a0ec65707d09", "statement": "Les affordances concernent uniquement l'interaction physique avec des objets, comme appuyer sur une poignée de porte ou tirer une chaise.", "veracity": false, "feedback": "Cela est incorrect, car les affordances couvrent un spectre large d'interactions, y compris celles avec des interfaces numériques. Elles ne se limitent pas à des actions physiques ; par exemple, cliquer ou tapoter sur des éléments d'une interface graphique sont également des affordances utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept des affordances, qui est pertinent dans le contexte de la conception d'expérience utilisateur (UX) et des interactions avec les interfaces numériques. Bien que l'affirmation soit incorrecte, elle touche à un aspect clé de la référence concernant l'optimisation des interactions entre utilisateurs et produits numériques. Cependant, l'exercice ne couvre pas directement d'autres éléments cruciaux mentionnés dans la synthèse, tels que le wireframing, le design system ou les méthodes comme l'Atomic Design. Par conséquent, bien qu'il soit pertinent, il ne teste pas de manière exhaustive tous les concepts clés liés à la conception d'une application web."}, {"exercise": {"id": "0404cd7946624d6ea2cefbd59a30a15e", "statement": "Un Stylescape est utilisé pour mieux communiquer avec les clients ou les parties prenantes.", "veracity": true, "feedback": "Un des objectifs clés d'un Stylescape est en effet de faciliter la communication en fournissant une vision claire du résultat attendu à toutes les personnes impliquées, y compris les clients ou autres parties prenantes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un concept lié à la communication dans le cadre de la conception d'une application web, ce qui est pertinent pour le développement d'un projet web. Cependant, il ne couvre pas directement les aspects clés tels que l'expérience utilisateur (UX), le design UI ou les méthodes de conception comme l'Atomic Design et le Design Thinking mentionnées dans la synthèse. Bien qu'il soit utile, il ne teste pas en profondeur les compétences essentielles liées à la conception et au développement d'applications web."}, {"exercise": {"id": "a4211a89a66041cea75d9f65c5dd02c6", "query": "Lors du développement d'une idée, des ajustements et révisions sont effectués en fonction des <blank> pour l'améliorer.", "answers": ["commentaires reçus"], "distractors": [["besoins initiaux", "prototypes inutilisés", "étapes antérieures", "médias choisis", "croquis finaux", "variations imaginées"]], "feedback": "Les ajustements et révisions sont basés sur les commentaires reçus, car ceux-ci permettent de prendre en compte les retours pertinents et d'affiner l'idée. Les autres options mentionnent des éléments qui interviennent dans le processus, mais qui ne déclenchent pas directement les révisions.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé teste la compréhension des ajustements et révisions dans le processus de développement d'une application web, ce qui est pertinent par rapport à la référence sur la conception d'une application. Cependant, il se concentre principalement sur un aspect spécifique (les commentaires reçus) sans aborder directement les concepts clés tels que l'expérience utilisateur, le wireframing ou le Design Thinking mentionnés dans la synthèse. Bien qu'il soit lié au processus de développement, il ne couvre pas suffisamment les éléments essentiels de la conception d'application web pour obtenir une note plus élevée."}, {"exercise": {"id": "24806f82dc0549589c867864cdf1dead", "statement": "Une fois les idées sélectionnées, elles sont immédiatement mises en œuvre sans être testées ou ajustées.", "veracity": false, "feedback": "L'énoncé est incorrect car les idées développées passent par un processus d'évaluation. Elles sont testées, des feedbacks sont recueillis, et des révisions sont effectuées en fonction des commentaires afin de les améliorer avant leur mise en œuvre finale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension du processus de développement d'une application web, en particulier l'importance de tester et d'ajuster les idées avant leur mise en œuvre. Cela fait référence à des concepts clés tels que le Design Thinking et le prototypage mentionnés dans la synthèse. Cependant, l'exercice ne couvre pas directement d'autres aspects importants comme la conception UX/UI ou le wireframing, ce qui limite sa portée. Il est pertinent mais pas exhaustif par rapport à tous les éléments abordés dans la référence."}, {"exercise": {"id": "f2c383430cc64c0da4db75976569aee8", "question": "Combien d'options de navigation est-il recommandé de maximiser dans un menu ?", "answers": ["7 maximum"], "distractors": ["8 maximum", "10 maximum", "9 maximum", "3 maximum", "5 maximum", "12 maximum", "6 maximum", "11 maximum", "4 maximum"], "feedback": "Le cerveau humain a une capacité limitée à traiter l'information. Pour faciliter sa compréhension, il est conseillé de limiter le nombre d'options dans un menu à 7 maximum. Cela permet aux utilisateurs de mieux s'orienter et de ne pas être submergés par trop d'informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5dbc8b0bd3404789aa35b91256382f16", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "En web, on proclame que 20% du contenu permet de satisfaire 80% des recherches. Ce qui revient à dire qu'une « bonne » architecture doit servir en priorité « seulement » 20% des contenus les plus importants quitte à éventuellement délaisser le reste. Le cerveau humain étant limité dans sa capacité à traiter l'information, celui-ci aborde la complexité en traitant l'information par blocs. Ce fait est souvent utilisé comme un argument pour limiter le nombre d'options de navigation d'un menu à 7 maximum.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d7449175be5f4d5abb6a02e0a986fa0e", "next_id": "786f9d6e532046c6a6395a4085cce92f", "prev_id": "49495f581f1a4c16a156717fde22db5e", "associated_block_ids": [], "first_page": 12, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une bonne pratique en matière de conception d'interface utilisateur, ce qui est pertinent pour le développement d'applications web. Cependant, il se concentre uniquement sur un aspect spécifique (le nombre d'options de navigation dans un menu) et ne couvre pas l'ensemble des concepts clés mentionnés dans la référence, tels que l'expérience utilisateur globale, le wireframing ou le design system. Bien qu'il soit utile, il ne permet pas une évaluation complète de la compréhension des processus de conception d'application web."}, {"exercise": {"id": "66ce7b152de44607970d26f764001f4b", "statement": "Améliorer l'accessibilité d'un site web permet d'augmenter son trafic et ses conversions.", "veracity": true, "feedback": "Cette affirmation est correcte. Il est explicitement mentionné que l'amélioration de l'accessibilité web permet de toucher un public plus large, ce qui a pour conséquence potentielle d'augmenter le trafic ainsi que les conversions sur le site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'une application web, à savoir l'accessibilité, qui est liée à l'expérience utilisateur (UX) et peut influencer le trafic et les conversions. Cependant, il ne couvre pas directement d'autres concepts clés mentionnés dans la référence, tels que le design UI, le wireframing ou les méthodes de développement comme l'Atomic Design. Bien qu'il soit pertinent pour une partie des objectifs d'apprentissage liés à la conception d'applications web, il ne teste pas suffisamment la compréhension globale des processus de développement et de conception évoqués dans la synthèse."}, {"exercise": {"id": "9262137caa5f4edd953268a1a20329a8", "statement": "Le temps d'attente idéal pour qu'une réponse système apparaisse est strictement de 2 secondes.", "veracity": false, "feedback": "Bien que 2 secondes soit un repère souvent utilisé, il s'agit d'un ordre de grandeur arbitraire. L'important est que le délai reste dans une durée raisonnable pour ne pas affecter l'expérience utilisateur, mais ce n'est pas un chiffre strict.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'applications web, à savoir l'expérience utilisateur (UX) et le temps de réponse du système. Bien qu'il ne couvre pas tous les concepts clés mentionnés dans la référence, il touche à une notion essentielle qui est la réactivité des interfaces, ce qui est crucial pour optimiser l'interaction utilisateur. Cependant, l'exercice pourrait être amélioré en intégrant d'autres éléments tels que le wireframing ou le design system pour une évaluation plus complète des compétences liées à la conception d'une application web."}, {"exercise": {"id": "a7a4e17d20c843f0bc5686d8e5efabf2", "statement": "La taille réduite de l'écran sur un terminal mobile peut poser des défis en termes de créativité et de conception web.", "veracity": true, "feedback": "Effectivement, la taille réduite de l'écran sur un appareil mobile rend la conception plus difficile en raison de contraintes créatives et en termes de webdesign, comparativement à des écrans plus grands.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent de la conception d'applications web, en soulignant les défis liés à la taille des écrans mobiles. Cela fait écho aux concepts de design UX et UI mentionnés dans la référence, qui traitent de l'optimisation des interactions utilisateur et de l'esthétique des interfaces. Cependant, bien que cela soit un point important, l'exercice ne couvre pas d'autres éléments clés tels que le wireframing, le Design Thinking ou la gestion de projet. Par conséquent, il est pertinent mais pas exhaustif par rapport à l'ensemble des compétences et concepts abordés dans la référence."}, {"exercise": {"id": "148c4b83bbf346118ad01ba1e1886404", "statement": "Les fonctionnalités comme le menu, les liens internes, et le pied de page sont considérées comme des zones où l'utilisateur peut ressentir différentes émotions.", "veracity": true, "feedback": "Ces éléments techniques comme le menu, les liens internes ou le pied de page sont vus dans le contexte décrit comme des endroits où les utilisateurs peuvent vivre des émotions variées telles que succès, échec, intérêt, confiance ou suspicion. C'est une approche qui va au-delà d'une simple analyse fonctionnelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde des éléments clés de la conception d'expérience utilisateur (UX) en mentionnant comment les fonctionnalités d'une application web peuvent influencer les émotions des utilisateurs. Cela est pertinent par rapport à la référence qui souligne l'importance de l'optimisation des interactions entre les utilisateurs et le produit numérique. Cependant, l'exercice pourrait être amélioré en intégrant davantage de concepts liés à la conception et au design web, comme le wireframing ou le Design Thinking, pour une évaluation plus complète des compétences liées à la conception d'applications web."}, {"exercise": {"id": "9658d6c80b9f4df48c99d7f3db50b327", "statement": "Les tendances dans la conception d'applications doivent toujours être suivies pour garantir une meilleure expérience utilisateur.", "veracity": false, "feedback": "Il est spécifiquement mentionné que les tendances ne doivent pas dicter la conception. Ce qui compte, c'est de créer une solution intuitive basée sur ce à quoi les utilisateurs sont habitués, afin de prévenir la frustration.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'applications web, à savoir l'expérience utilisateur (UX) et la nécessité de ne pas se laisser uniquement guider par les tendances. Cependant, il ne couvre pas directement d'autres concepts clés mentionnés dans la référence, tels que le wireframing, le design system ou le Design Thinking. Bien qu'il teste une compréhension pertinente des principes UX, il pourrait être amélioré en intégrant des éléments plus variés liés à la conception d'applications web."}, {"exercise": {"id": "d76809cc290945e78447dc42776005c7", "statement": "Les animations présentes sur le site de Studio Brot jouent un rôle important dans l'expérience utilisateur en maintenant son attention.", "veracity": true, "feedback": "Les diverses animations présentes sur le site Web de Studio Brot sont conçues pour garder l'utilisateur engagé, en le surprenant et en suscitant la curiosité sur ce qui va suivre.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5406f7d079a64abf9cf0b94a61af4904", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Studio Brot est une agence de design qui se concentre sur la publicité et l'image de marque. Leurs services sont décomposés et simplifiés, présentés à l'utilisateur sous la forme d'une métaphore de la cuisson du pain (Brot - pain en allemand). Nous sommes tombés amoureux de leurs techniques de navigation et des diverses animations sur le site Web qui vous gardent toujours à l'affût, vous faisant vous demander à quoi vous attendre ensuite.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "f6090b0ed92f42daa23ee91e9a69ea73", "prev_id": "e1fb6be712cb4084b479d027f2ab6e53", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance des animations dans l'expérience utilisateur, ce qui est un aspect clé de la conception d'application web. Cependant, il se concentre uniquement sur un élément spécifique (les animations) sans aborder d'autres concepts essentiels mentionnés dans la référence, tels que le wireframing, le design system ou les méthodes comme le Design Thinking. Bien qu'il soit pertinent, il ne couvre pas suffisamment la portée globale de la conception d'une application web."}, {"exercise": {"id": "6e6772c68ba74d0f875c0cfbec11ddb3", "query": "Un design system regroupe tous les éléments graphiques ainsi que ceux liés aux règles <blank> dans un seul système standardisé.", "answers": ["de branding"], "distractors": [["de développement", "de codage", "de fonctionnalité", "de performance", "de navigation", "d'architecture"]], "feedback": "Le branding fait référence à l'identité visuelle et aux éléments qui définissent l'image d'une marque, donc il est directement lié aux aspects graphiques et de ton d'un produit. Un design system inclut cet aspect, afin de garder une cohérence visuelle et narrative dans tout le produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept clé lié à la conception d'applications web, en particulier l'importance du design system et son lien avec le branding. Cependant, bien qu'il soit pertinent, il ne couvre pas de manière exhaustive les autres aspects essentiels mentionnés dans la référence, tels que l'expérience utilisateur (UX), le wireframing ou le Design Thinking. L'exercice pourrait être amélioré en intégrant des éléments qui évaluent également ces autres compétences et concepts clés."}, {"exercise": {"id": "fe4bdd02dd44424eb169f80a0ba62dcf", "statement": "L'objectif principal de cette étape est de générer un maximum d'idées sans se soucier d'évaluer leur pertinence immédiate.", "veracity": true, "feedback": "Cette affirmation est correcte. L'étape décrite met clairement l'accent sur la génération d'un grand nombre d'idées, sans jugement ni évaluation de leur qualité à ce stade, afin de favoriser la créativité et la diversité des propositions.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "67fdbe4693c44dc0b365739538de5681", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade. C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "7b247f5a093543c99523d6dbff408ebd", "prev_id": "5b1cde7d85cf49db99d962eaff61fd45", "associated_block_ids": [], "first_page": 4, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'une étape du processus de conception, en particulier celle liée à la génération d'idées dans le cadre du Design Thinking. Bien que cela soit pertinent pour la conception d'une application web, l'exercice ne couvre pas directement les aspects techniques ou pratiques de la création d'une application, tels que l'UX/UI design, le wireframing ou l'utilisation de design systems. Il aborde un concept clé mais reste trop général par rapport aux objectifs spécifiques de développement d'applications web mentionnés dans la référence."}, {"exercise": {"id": "7d7015341c634c6eaa4de6df8fa72e34", "question": "Quel est le rôle principal d'un Stylescape dans un projet de design ?", "answers": ["Communiquer l'émotion et l'ambiance souhaitées"], "distractors": ["Définir la palette de couleurs finale.", "Décrire les aspects techniques du projet.", "Contrôler la progression du planning.", "Valider les choix esthétiques avec l'équipe interne.", "Analyser les performances du produit fini.", "Estimer les coûts de production.", "Gérer la relation entre les parties prenantes.", "Superviser les processus créatifs en cours.", "Prévoir les ajustements graphiques post-lancement."], "feedback": "Le rôle principal d'un Stylescape est de communiquer l'émotion et l'ambiance souhaitées pour un projet de design, en donnant une vision claire à toutes les parties prenantes. Les autres propositions ne sont pas pertinentes car elles ne reflètent pas le but premier d'un Stylescape.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un concept spécifique lié à la conception d'une application web, en l'occurrence le rôle d'un Stylescape dans un projet de design. Bien que cela soit pertinent pour le développement d'une interface utilisateur et qu'il touche à des aspects de l'expérience utilisateur (UX), il ne couvre pas directement les éléments clés mentionnés dans la référence, tels que le wireframing, le Design Thinking ou la gestion de projet. L'exercice pourrait être amélioré en intégrant des questions qui abordent plus largement les différentes étapes et méthodes du processus de conception d'application web."}, {"exercise": {"id": "0df4b17da3fe4f64bb9904c291af286b", "statement": "Le Stylescape se concentre sur des éléments concrets qui représentent l'identité du projet.", "veracity": true, "feedback": "Le Stylescape est effectivement plus précis que le moodboard et se concentre sur des éléments clés et concrets qui reflètent l'identité et l'atmosphère du projet, donnant ainsi une vision plus claire de l'apparence finale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3114978bee814521a435aad18ed70c89", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le moodboard est souvent utilisé au début du processus créatif pour explorer différentes directions et rassembler des influences visuelles. Il est plus large et ouvert, permettant d'explorer diverses options. Le Stylescape, en revanche, est plus précis et spécifique. Il se concentre sur les éléments clés qui représentent l'identité et l'atmosphère du projet, en utilisant des éléments plus concrets et en donnant une idée plus précise de l'apparence finale.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "da98e60ed8304ac9972d483d953bebef", "prev_id": "cc80a773dfd44d73a0652219668ed7df", "associated_block_ids": [], "first_page": 18, "last_page": 18, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un concept lié à la conception d'expérience utilisateur (UX) et au design, en se concentrant sur le Stylescape. Bien que cela soit pertinent pour le développement d'une application web, l'exercice ne couvre pas directement les aspects clés mentionnés dans la référence, tels que le wireframing, le Design Thinking ou l'utilisation de méthodes comme l'Atomic Design. Il teste une connaissance spécifique qui est utile mais qui ne représente qu'une partie des compétences nécessaires pour concevoir une application web complète."}, {"exercise": {"id": "a0733f4df0a4419a9590bc72e176fd8e", "statement": "Le Stylescape se limite à rassembler des éléments visuels pour présenter une ambiance générale.", "veracity": false, "feedback": "Le Stylescape ne se limite pas uniquement à la collecte d'éléments visuels comme le moodboard. Il va plus loin en créant une composition visuelle qui capture l'identité, l'atmosphère et l'expérience globale d'un projet de manière plus immersive et articulée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bd42cab0c42544a2b7e4b57dd58c7556", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le Stylescape et le moodboard sont deux approches différentes utilisées dans le processus créatif pour visualiser et communiquer des idées de design. Le moodboard est principalement utilisé pour rassembler et présenter une collection d'inspirations visuelles, d'éléments graphiques, de textures, de couleurs, etc. C'est une représentation visuelle de l'ambiance et de l'esthétique générale d'un projet. Le Stylescape, quant à lui, va au-delà de la simple collection d'éléments visuels en cherchant à créer une composition visuelle qui représente l'identité, l'atmosphère et l'expérience globale d'un projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "a425d9d448e14f39b2bf4a181b709422", "prev_id": "4c6943198f4f442e8c6e608955fd85f1", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un concept lié à la conception d'expérience utilisateur (UX) et au design visuel, qui sont des éléments clés dans le développement d'une application web. Bien que le Stylescape soit un outil pertinent pour la phase de conception, l'exercice ne couvre pas directement tous les aspects mentionnés dans la référence, comme le wireframing ou le Design Thinking. Cependant, il aborde un aspect important du design visuel qui contribue à l'optimisation de l'interface utilisateur. La note est donc positive mais pas maximale car il manque une connexion plus directe avec les autres concepts clés de la référence."}], "sources": [{"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}, "is_teacher": null}, "score": 11.8, "top_pages": [273, 274], "top_minutes": []}]}