{"introduction": "Dans le cadre de la conception de supports de communication et d'image, le traitement des images numériques est un aspect fondamental qui englobe divers éléments tels que la colorimétrie, le cadrage et l'accessibilité. Cette synthèse explore les concepts clés liés à l'utilisation efficace des images dans un environnement numérique, en mettant l'accent sur leur impact visuel et leur rôle dans la communication accessible.", "synthesis": "La première section aborde les types d'images numériques, notamment les images bitmap et vectorielles. Les images bitmap, composées de pixels, sont couramment utilisées dans des formats comme JPEG ou PNG pour représenter des informations visuelles sur le web. En revanche, les formats vectoriels permettent une mise à l'échelle sans perte de qualité grâce à leur création basée sur des formules mathématiques. Ces deux types d'images jouent un rôle crucial dans la conception graphique en influençant la perception du spectateur.\n\nEnsuite, nous examinons le contraste visuel et son importance pour garantir l'accessibilité des contenus numériques. Le contraste entre les éléments graphiques est essentiel pour assurer une lisibilité adéquate, surtout pour les utilisateurs ayant des déficiences visuelles. Les propriétés CSS de couleur sont également fondamentales pour définir ces contrastes sur une page web. La conformité aux normes telles que Conformité AA assure que ces critères sont respectés.\n\nL'accessibilité des contenus visuels est un thème central qui se décline en plusieurs concepts tels que l'utilisation d'alternatives textuelles pour décrire les images porteuses d'information et les éléments graphiques non porteurs d'information. Ces descriptions permettent aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, d'accéder au contenu visuel lorsque celui-ci ne peut pas être affiché. Les critères 1.3 et 1.8 des WCAG soulignent l'importance de fournir des alternatives textuelles pertinentes pour améliorer cette accessibilité.\n\nEnfin, nous abordons l'esthétique et la lisibilité dans le design graphique. L'esthétique influence non seulement l'apparence mais aussi l'engagement utilisateur avec le contenu numérique. La lisibilité dépend de divers facteurs tels que la taille de police et le contraste des couleurs, ce qui est essentiel pour une communication efficace. De plus, le principe selon lequel l'information ne doit pas être transmise uniquement par la couleur garantit que tous les utilisateurs peuvent accéder à l'information sans confusion.\n\nEn conclusion, traiter efficacement des images numériques implique une compréhension approfondie de leur nature technique ainsi qu'une attention particulière portée à leur accessibilité et leur impact esthétique dans la conception de supports de communication.", "concepts": [{"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "Le concept d'image lui-même est fondamental au sujet du traitement des images numériques, étant au cœur même de toute communication visuelle."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "La description détaillée enrichit la compréhension des contenus visuels et est essentielle pour garantir une accessibilité optimale dans le cadre du traitement d'images numériques."}, {"concept": {"id": "177152a3-de8d-477c-8620-09091c578791", "label": "Technique(s) suffisante(s) WCAG 2.1", "definition": "Méthodes validées par les WCAG permettant de satisfaire aux critères d'accessibilité établis.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Technique(s) suffisante(s) WCAG 2.1' est hautement pertinente car elle fournit des méthodes spécifiques pour garantir que les supports visuels respectent les critères d'accessibilité essentiels lors du traitement des images numériques."}, {"concept": {"id": "49cfc2c6-bf96-4192-8004-86d1ace1d976", "label": "Image bitmap", "definition": "Représentation graphique numérique composée de pixels, utilisée dans divers formats tels que JPEG ou PNG, ainsi que dans les balises <canvas> pour afficher des informations visuelles sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["3b69cc8b-032e-4ab9-a522-6a5cf578c980"], "wikientity": {"label": "Image matricielle", "definition": "Une image matricielle, ou « carte de points » (de l'anglais bitmap), est une image constituée d'un pavage carré dont chaque élément, appelé point ou pixel, est coloré selon un code enregistré dans un tableau à deux dimensions.\nDans les domaines de l'imagerie numérique et de l'infographie, on parle d'image matricielle par opposition avec l'image vectorielle.", "page_id": "70340", "wikidata_id": "Q182270", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'image bitmap est essentielle pour le traitement des images numériques, car elle représente la base de nombreux formats d'images utilisés dans la conception graphique et les supports de communication."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le format vectoriel est hautement pertinent car il permet une flexibilité et une qualité optimale dans le design graphique, essentiel pour concevoir des supports visuels variés."}, {"concept": {"id": "9afb0643-e273-456d-8fd2-4ab13b0d8236", "label": "Contraste visuel", "definition": "Le contraste visuel, ou ratio de contraste, désigne la mesure de l'opposition entre la luminosité ou la couleur d'un élément de premier plan et celle d'un arrière-plan. Ce contraste est essentiel pour garantir la lisibilité et l'accessibilité des contenus numériques sur les pages web et les interfaces visuelles, en particulier pour les utilisateurs ayant des déficiences visuelles. Il joue un rôle crucial dans l'expérience utilisateur en assurant que le contenu soit facilement discernable par tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707, 13710, 13708], "aliases": ["5c481e4e-e436-4bb7-a7e9-53bc0830e306", "b12c3286-f79e-4321-a6d3-db4c95e9c849", "650d5354-ed61-4940-8878-706a15f07f6f", "1c2f3e20-96e3-4275-8631-9e9564ed2ed1", "c4dddffe-8da9-4405-8b54-28eb0959e6dd", "7141a9bd-f2a9-4685-95e3-5e81f87d7c9a", "cd3ee3d7-bb6f-4084-9226-a941f6eb43b9"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Contraste visuel' est crucial pour assurer la lisibilité et l'accessibilité des contenus visuels, faisant partie intégrante du traitement d’images numériques."}, {"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les éléments graphiques sont fondamentaux dans le design numérique et jouent un rôle clé dans la communication visuelle, rendant ce concept très pertinent pour traiter des images numériques."}, {"concept": {"id": "3f7470d7-442d-4922-9f23-70be2de8c8c8", "label": "Accessibilité des contenus visuels", "definition": "L'accessibilité des contenus visuels se réfère à la fourniture de descriptions textuelles pour les images et éléments graphiques, permettant aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, de comprendre le contenu visuel lorsque celui-ci ne peut pas être affiché. Cela inclut l'utilisation d'attributs alternatifs en HTML qui décrivent ces images, ainsi que la mise à disposition de contenu ou fonctionnalités équivalentes lorsque certaines conditions ne sont pas remplies, garantissant ainsi une accessibilité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7f9d95fb-80ae-4ce9-b4ad-ed8ff0eab829", "104cae17-0a9a-49b6-9395-a7a4af1f4c39", "963fcb43-959a-46ac-8a0e-df703abd85f0", "88400249-4250-499f-b98d-a5cb498ee7cc", "5b26344a-b71c-4c0f-b03c-af99333bff27"], "wikientity": {"label": "Alternative textuelle", "definition": "L'alternative textuelle est un texte que l'on associe à un contenu graphique comme une image, une zone cliquable dans une image ou un élément de formulaire de type image, dans un site web ou dans un document produit par un logiciel d'une suite bureautique, pour que l'utilisateur qui ne peut visualiser l'image puisse être informé de ce qu'elle représente et signifie. L'alternative textuelle est restituée à la place de l'image quand celle-ci n'est pas consultable.\nL'alternative textuelle, dont l'emploi est obligatoire dans le cadre de l'accessibilité du web, concerne tant les personnes qui utilisent un navigateur textuel ou un lecteur d'écran, que celles qui, par choix ou à cause d'un problème technique, ne peuvent visualiser l'image.", "page_id": "7715605", "wikidata_id": "Q1067764", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'accessibilité des contenus visuels est directement liée à la manière dont les images numériques sont traitées pour être compréhensibles par tous, ce qui est essentiel dans la conception de supports de communication."}, {"concept": {"id": "80e30b2c-8c54-4cf7-9d24-f6cb8033c6d0", "label": "Lecteur d'écran", "definition": "Logiciel qui vocalise le contenu affiché à l'écran, permettant aux utilisateurs aveugles d'accéder à un environnement graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": {"label": "Lecteur d'écran", "definition": "Un lecteur d'écran (également appelé revue d'écran) est un logiciel d’assistance technique destiné aux personnes « empêchées de lire » (aveugles, fortement malvoyantes, dyslexiques, dyspraxiques…) : il retranscrit par synthèse vocale et/ou sur un afficheur braille ce qui est affiché sur l'écran d'un ordinateur tant en termes de contenu que de structure et permet d'interagir avec le système d’exploitation et les logiciels applications.", "page_id": "379778", "wikidata_id": "Q1328864", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "'Lecteur d'écran' est très pertinent car il souligne l'importance de rendre les contenus visuels accessibles aux utilisateurs aveugles, ce qui fait partie intégrante du traitement des images."}, {"concept": {"id": "d5b519d8-4769-473a-b5be-3f99566d96c4", "label": "Propriétés CSS de couleur", "definition": "Propriétés telles que color et background-color utilisées pour définir les couleurs des éléments dans une page web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les propriétés CSS de couleur sont essentielles pour le traitement des images numériques, car elles déterminent comment les couleurs sont appliquées et perçues dans un design graphique."}, {"concept": {"id": "0bce8743-1869-49b7-adb6-b369073f5580", "label": "critère 1.8", "definition": "Le critère 1.8 stipule que chaque image texte porteuse d'information doit être remplacée par du texte stylé si aucun mécanisme de remplacement n'est disponible.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Critère 1.8' est très pertinent car il aborde directement le remplacement nécessaire pour assurer l'accessibilité et la compréhension des informations contenues dans les images textuelles."}, {"concept": {"id": "11723149-c36a-4793-bec4-052fc856d45b", "label": "Focus visible", "definition": "Le focus visible est un indicateur visuel qui montre quel élément d'une interface utilisateur ou d'une page web est actuellement sélectionné ou actif. Il représente l'état d'un élément qui reçoit l'attention de l'utilisateur, permettant ainsi l'interaction via dispositifs de pointage ou raccourcis clavier. Ce mécanisme est crucial pour les interactions clavier et l'accessibilité, car il aide les utilisateurs à comprendre facilement où se trouve leur attention dans l'interface, facilitant la navigation et l'interaction avec les éléments interactifs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["394b0a02-f858-421b-85a0-540ba39c364f", "71670944-41a5-4691-aaee-2bdeb718d6e7", "ffcaa1f6-724e-4337-99db-6d8a09701358"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le focus visible est très pertinent car il améliore l'accessibilité et l'interaction avec les éléments graphiques dans un contexte numérique, ce qui inclut les images."}, {"concept": {"id": "0d0b20be-ccf6-49b9-a7e0-9dc32735d235", "label": "Élément graphique non porteur d'information", "definition": "Image ou partie d'image qui n'apporte pas d'informations supplémentaires, utilisée uniquement pour l'esthétique ou la mise en page dans un contenu numérique, et qui peut avoir une alternative textuelle, réduisant ainsi le besoin d'interprétation visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["add57e72-0da0-492a-a31c-335dad56348b"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'élément graphique non porteur d'information est très pertinent car il traite directement de l'utilisation esthétique des images dans un contenu numérique tout en considérant leur accessibilité."}, {"concept": {"id": "570fcd8e-c646-4c66-bff4-f3c2b5ba4d72", "label": "BSRGB", "definition": "Valeur normalisée des composants bleus en RGB, nécessaire pour évaluer la luminance relative dans les calculs de contraste.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "BSRGB est pertinent car il concerne la colorimétrie, un aspect clé du traitement des images numériques, en particulier pour évaluer le contraste et la luminance."}, {"concept": {"id": "2df01bbf-5077-4ae7-898f-a21965922590", "label": "Conformité AA", "definition": "Le niveau de conformité AA est considéré comme la norme industrielle pour l'accessibilité, garantissant un contraste de couleur adéquat et d'autres critères.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La conformité AA est très pertinente car elle garantit que les éléments visuels respectent les normes d'accessibilité, ce qui est crucial lors du traitement des images pour une communication efficace."}, {"concept": {"id": "cdab07c0-6def-4fea-b8a8-d10119ba592f", "label": "RSRGB", "definition": "Valeur normalisée des composants rouges en RGB, utilisée pour déterminer la luminance relative dans le calcul du contraste.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'RSRGB' est directement lié à la colorimétrie et au calcul du contraste, ce qui est essentiel pour traiter des images numériques et garantir leur qualité visuelle."}, {"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Esthétique' joue un rôle fondamental dans la conception visuelle et l'engagement utilisateur, étant donc très pertinent pour le sujet traité."}, {"concept": {"id": "10e25043-8d13-409f-8733-b679690ed7e3", "label": "GSRGB", "definition": "Valeur normalisée des composants verts en RGB, essentielle pour le calcul de la luminance relative et du contraste.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'GSRGB', similaire à RSRGB, est essentiel pour comprendre la luminance relative et le contraste dans les images numériques."}, {"concept": {"id": "9063ef01-8369-4bd6-89af-11353700ccf4", "label": "image porteuse d'information", "definition": "Image essentielle à la compréhension du contenu, fournissant des informations critiques et souvent liée à des liens ou boutons.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Une image porteuse d'information est cruciale pour la compréhension du contenu visuel, ce qui en fait un concept central au traitement des images numériques."}, {"concept": {"id": "cce5562d-95bb-4f89-bdce-9de30ef6c8da", "label": "Luminance", "definition": "Mesure de la quantité de lumière émise ou réfléchie par une surface, cruciale pour le calcul du contraste dans les normes d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Luminance", "definition": "La luminance est une grandeur correspondant à la sensation visuelle de luminosité d'une surface.\nLa luminance est la puissance de la lumière visible passant ou étant émise en un élément de surface dans une direction donnée, par unité de surface et par unité d'angle solide. Quand la visibilité ou non du rayonnement électromagnétique importe peu, on parle de luminance énergétique ou radiance.", "page_id": "40888", "wikidata_id": "Q355386", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Luminance", "definition": "the quality of being luminous; emitting or reflecting light", "name": "luminosity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "'Luminance' est essentielle pour comprendre comment les couleurs interagissent sur une image et affectent son apparence, ce qui en fait un concept important dans le cadre du traitement d'images."}, {"concept": {"id": "8fb9860b-e730-4be1-9331-f6ad9021b86e", "label": "critère 1.3", "definition": "Critère de la WCAG concernant la pertinence de l'alternative textuelle pour les images porteuses d'information.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le critère 1.3 de la WCAG est pertinent car il traite spécifiquement de l'importance des alternatives textuelles pour les images, un aspect crucial du traitement d'images numériques."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La lisibilité joue un rôle clé dans la communication visuelle et affecte comment les images sont perçues et comprises par les utilisateurs, ce qui en fait un concept pertinent."}, {"concept": {"id": "7fcc9498-9b97-4289-a01d-189889aa59c3", "label": "Couleur comme information", "definition": "Principe selon lequel l'information ne doit pas être transmise uniquement par la couleur ou l'utilisation de couleurs, afin d'assurer l'accessibilité pour tous les utilisateurs et éviter toute confusion pour ceux qui peuvent avoir des difficultés à percevoir les couleurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["1cccf89a-d717-4d5a-8956-63d3432cb9ee"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le concept de couleur comme information est très pertinent pour traiter des images numériques, car il aborde l'importance de l'utilisation appropriée des couleurs dans la communication visuelle."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "'Simplicité' en design favorise une approche esthétique qui peut grandement améliorer la présentation et l'efficacité des supports de communication visuelle."}, {"concept": {"id": "a1be02e7-3ebb-4e47-b321-ff67b13706b9", "label": "<embed>", "definition": "La balise <embed> est une balise HTML utilisée pour intégrer des contenus multimédias externes, tels que des images ou des vidéos, dans une page web. Elle nécessite souvent une description adéquate pour garantir l'accessibilité, car elle peut être utilisée sans alternative textuelle, ce qui pose des défis pour les utilisateurs ayant des besoins d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["301bc082-9f69-441e-86c6-34d6be648193"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "<embed> est pertinent car il concerne l'intégration d'images et de vidéos dans une page web, ce qui est central au traitement des images numériques."}, {"concept": {"id": "6a4da468-d753-43b3-89e0-8277f19d8a36", "label": "Critère d'accessibilité", "definition": "Un critère d'accessibilité est une condition ou exigence qui doit être remplie pour qu'une page soit considérée comme conforme aux normes d'accessibilité. Un critère est dit validé lorsque toutes les pages concernées satisfont aux exigences nécessaires lors des tests effectués. Par exemple, le Critère 3.3 des WCAG 2.1 stipule que les couleurs doivent avoir un contraste suffisant pour garantir la compréhension du contenu graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["cec3fb45-5ed2-412b-8227-6b6106529cca", "6e84b853-8e93-47fa-962c-b3d7a70d28ad"], "wikientity": null, "wordnetentity": {"label": "Critère", "definition": "a standard by which something can be measured or judged", "name": "benchmark.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Le critère d'accessibilité est pertinent car il aborde des exigences liées à la colorimétrie, ce qui est essentiel pour garantir que les images sont accessibles et compréhensibles par tous."}, {"concept": {"id": "086f5abc-b2a8-4ca0-b00a-caa301ddb7f0", "label": "Audiodescription synchronisée", "definition": "L'audiodescription est une narration audio intégrée dans un contenu vidéo ou média temporel qui décrit les éléments visuels importants en temps réel, facilitant l'accès aux utilisateurs malvoyants en fournissant des informations contextuelles et descriptives synchronisées avec le contenu visuel et audio pour améliorer l'accessibilité. L'audiodescription synchronisée est une forme spécifique d'audiodescription où la narration est parfaitement alignée avec les événements visuels du média.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["6700eb09-a0ce-496a-8663-5b77a73a794b", "1194c11c-2292-4586-997f-8e0877cbbcf1", "84057e5e-a425-4da6-bed3-39483b35fc59", "194dd35a-eef7-411f-a29b-1631ab120eef"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Audiodescription synchronisée' est pertinente car elle aide à rendre les contenus visuels accessibles aux personnes malvoyantes, ce qui fait partie intégrante du design inclusif en matière d'image."}, {"concept": {"id": "b5030c9d-54f4-4aab-bd56-a2a4cc97d1f5", "label": "Test de contraste", "definition": "Évaluations spécifiques pour mesurer si le rapport de contraste entre le texte et l'arrière-plan respecte les normes d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le test de contraste est crucial pour s'assurer que les éléments visuels respectent les normes d'accessibilité, ce qui est très pertinent dans le contexte du traitement des images numériques."}, {"concept": {"id": "ff356c21-a6a9-4643-9b85-5ea63c1962d7", "label": "Composants d'Interface Utilisateur", "definition": "Les composants d'interface utilisateur sont des unités graphiques indépendantes et réutilisables, telles que des boutons, des liens ou des cartes, qui encapsulent la logique et le rendu d'une partie de l'interface. Ils permettent aux utilisateurs d'interagir avec le contenu et les fonctionnalités sur une page web. Dans des outils comme Figma, ces éléments aident les designers à maintenir une cohérence visuelle tout en facilitant les mises à jour, s'assemblant pour former des structures plus complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13668, 13708], "aliases": ["aa4065a5-c93e-4843-8784-987b3fb4a95b", "a52293d6-e08a-4666-9aa0-34c8daaf1426", "c177b8d1-7c43-4e1e-8b3d-ae5c9e7b3057"], "wikientity": {"label": "Composant logiciel", "definition": "En architecture logicielle, un composant logiciel est un élément constitutif d'un logiciel destiné à être incorporé en tant que pièce détachée dans des applications. Les paquets, les bibliothèques logicielles, les exécutables, les fichiers, les bases de données ou encore des éléments de configuration (paramètres, scripts, fichiers de commandes) sont des composants logiciels. \nLes composants logiciels sont développés par des professionnels de l'informatique en vue d'être réutilisés dans leurs propres logiciels, ou en vue d'être mis sur le marché et incorporés dans des logiciels tiers.", "page_id": "1824031", "wikidata_id": "Q17176533", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "'Composants d'Interface Utilisateur' sont essentiels pour créer des interfaces graphiques attrayantes et fonctionnelles, directement liées à la présentation visuelle des images numériques."}, {"concept": {"id": "35731d03-1f0f-45f7-9e26-a44b29a90f40", "label": "Légende d'image", "definition": "Texte associé à une image, fournissant des informations complémentaires ou contextuelles, essentiel pour l'accessibilité et la compréhension visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La légende d'image joue un rôle important dans la compréhension des images et leur accessibilité, ce qui est essentiel dans le cadre de supports de communication visuelle."}, {"concept": {"id": "3729ea27-3a3c-49b2-ad05-8e85dc125032", "label": "Orientation de l'écran", "definition": "Disposition physique de l'affichage d'un appareil, soit en mode portrait (vertical) ou paysage (horizontal), influençant la consultation du contenu.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Orientation de l'écran' influence comment les images sont perçues et utilisées sur différents appareils, ce qui a une pertinence modérée dans le contexte du traitement d’images numériques."}, {"concept": {"id": "fe3431e6-f552-40bf-9acf-a8dc64fff9bb", "label": "Couleur contiguë", "definition": "Couleur touchant directement une autre couleur dans un design graphique, importante pour le contraste et la lisibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La couleur contiguë est importante pour le contraste et la lisibilité dans le design graphique, ce qui est pertinent pour traiter des images numériques."}, {"concept": {"id": "8c04c17e-d29b-4db5-b0d2-1700f11a2c84", "label": "Changement brusque de luminosité", "definition": "Variations rapides de luminance dans le contenu visuel pouvant provoquer des réactions indésirables chez certains utilisateurs sensibles, notamment des crises chez ceux réagissant à des fréquences spécifiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["fb57803d-4843-4a6a-839c-d0feab5848c3"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le changement brusque de luminosité peut affecter l'expérience utilisateur lors du traitement d'images numériques, en particulier pour ceux sensibles aux variations lumineuses."}, {"concept": {"id": "9ba6d9dc-239e-4df4-94b7-30ac2d36afc3", "label": "longdesc", "definition": "Attribut HTML permettant de fournir une URL vers une description détaillée d'un élément, souvent utilisé pour améliorer l'accessibilité des contenus visuels. Bien qu'il soit crucial pour l'accessibilité, son utilisation a diminué en raison du manque de support dans certains navigateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["6779a975-b58e-450d-a096-e966ee0f3829", "4435e73d-8963-4ac1-aabe-bcd70efac845"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'longdesc' améliore l'accessibilité des contenus visuels, ce qui est pertinent pour le traitement d'images numériques, bien qu'il soit moins utilisé aujourd'hui."}, {"concept": {"id": "adeae403-e261-4e4e-9de1-f885ca1eacfa", "label": "Gabarits de pages", "definition": "Modèles préétablis utilisés pour créer des pages web uniformes tout en respectant les principes d'ergonomie.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Gabarit (mise en page)", "definition": "Un gabarit, souvent nommé template ou layout, est un patron de mise en page où l'on place images et textes. \nAussi, il est souvent utilisé de manière répétitive pour créer des documents présentant une même structure. \nOn parle aussi de patron comme en couture ou bien, parfois, de grille.", "page_id": "117934", "wikidata_id": "Q25397911", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Les gabarits de pages peuvent être pertinents pour le cadrage et la présentation des images dans un contexte web, ce qui les rend assez liés à l'objectif pédagogique."}, {"concept": {"id": "b8eb492b-2d1a-4d22-a216-f93b31d3dad5", "label": "Agrandissement", "definition": "Technique utilisée par les malvoyants pour agrandir l'affichage à l'écran, facilitant la lecture et l'interaction avec le contenu numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Agrandissement", "definition": "the act of expanding something in apparent size", "name": "magnification.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "L'agrandissement est une technique utile pour améliorer l'accès aux contenus visuels, y compris les images, ce qui en fait un concept relativement pertinent."}, {"concept": {"id": "7f68a084-10a3-4266-90e0-653c0f007cfd", "label": "Design-first", "definition": "Approche de conception priorisant l'esthétique et l'expérience utilisateur dès le début du processus de développement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'approche Design-first est pertinente car elle met l'accent sur l'esthétique et l'expérience utilisateur, qui sont cruciaux lors de la conception d'images et de supports visuels."}, {"concept": {"id": "65a2d925-96a7-48d0-94eb-7917f284ca13", "label": "Navigation", "definition": "La navigation, ou système de navigation, désigne le processus et les systèmes utilisés pour se déplacer efficacement et intuitivement à travers les différentes sections ou pages d'une interface web ou d'une application. Cela inclut l'utilisation de menus, de tables des matières, de plans du site et d'autres méthodes qui contribuent à une expérience fluide, à l'ergonomie, à la compréhension du site et à l'accessibilité. Les systèmes de navigation facilitent également la recherche d'informations via des moteurs de recherche intégrés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13666, 13708], "aliases": ["5f336d11-a83e-4c09-b404-30caf3494f2e", "c7ba75e2-9acf-40e4-b21f-c85f713d24b5", "79990658-2b4b-49e2-890e-ea7343e190ce", "886ea679-2ba8-4a0b-885b-281920a96a5e", "810c55c8-6be9-4b80-9b41-622b41ddf2e9"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La navigation est importante pour une bonne expérience utilisateur dans un support visuel, bien qu'elle ne soit pas directement liée au traitement d'images elles-mêmes."}, {"concept": {"id": "9754bb31-5e9b-4416-a55e-6681c4d1c9fa", "label": "Mesures correctives", "definition": "Actions prises pour remédier aux non-conformités identifiées dans les évaluations de l'accessibilité numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Action corrective", "definition": "Une action corrective est une action visant à éliminer une faiblesse détectée dans le système ou la cause d'une Non-conformité afin d'en empêcher la réapparition.\nUne non-conformité pouvant avoir plusieurs causes, il est parfois nécessaire de combiner plusieurs actions afin d'éliminer la source d'erreur.\nOn distingue une action corrective des actions suivantes :\n\nL'action préventive (empêcher l'occurrence de la non-conformité).", "page_id": "4182103", "wikidata_id": "Q1130839", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Les mesures correctives peuvent être appliquées pour améliorer l'accessibilité des supports visuels, ce qui a une certaine pertinence dans le cadre du traitement d'images numériques."}, {"concept": {"id": "aebca6b2-bc8c-4b19-89ce-ec44144d2ae7", "label": "Légende", "definition": "Texte descriptif associé à un groupe de champs, fournissant un contexte ou une instruction sur leur utilisation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Légende", "definition": "brief description accompanying an illustration", "name": "caption.n.03", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "'Légende' fournit un contexte important pour les images et peut aider à leur compréhension, ce qui en fait un concept pertinent dans le cadre du traitement d’images numériques."}], "exercises": [{"exercise": {"id": "f1f4e80cb280417598d14efa8b949f6e", "question": "Quelle est la longueur maximale recommandée pour une alternative textuelle accessible ?", "answers": ["80 caractères au maximum sont fortement recommandés"], "distractors": ["100 caractères au maximum sont fortement recommandés", "120 caractères au maximum sont fortement recommandés", "40 caractères au maximum sont fortement recommandés", "70 caractères au maximum sont fortement recommandés", "90 caractères au maximum sont fortement recommandés", "50 caractères au maximum sont fortement recommandés", "130 caractères au maximum sont fortement recommandés", "110 caractères au maximum sont fortement recommandés", "60 caractères au maximum sont fortement recommandés"], "feedback": "Une longueur maximale de 80 caractères est fortement recommandée pour que les utilisateurs de plages braille ou de loupes d'écran puissent lire l'alternative sans avoir à effectuer plusieurs manipulations. Cela garantit une meilleure accessibilité pour ces utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un aspect clé de l'accessibilité des contenus visuels, en particulier concernant les alternatives textuelles pour les images. La question sur la longueur maximale recommandée pour une alternative textuelle est pertinente et liée à l'objectif pédagogique de traiter des images numériques dans un contexte d'accessibilité. L'explication fournie renforce cette pertinence en soulignant l'importance de cette recommandation pour les utilisateurs ayant des besoins spécifiques. Cependant, il aurait été encore plus pertinent d'inclure une question sur le contraste visuel ou sur les types d'images numériques, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "aa56f61857f44205a2ba7fef386130a4", "question": "Pourquoi faut-il lier une légende à son image par une relation de structure ?", "answers": ["Pour un traitement unifié par les technologies d'assistance"], "distractors": ["Pour faciliter le téléchargement de l'image", "Pour permettre l'impression de la légende seule", "Afin de rendre l'image plus rapide à charger", "Pour garantir que l'image soit centrée sur la page", "Pour éviter les erreurs dans le code CSS", "Pour accroître la visibilité du texte alternatif", "Pour réduire la taille du fichier HTML", "Pour assurer une mise en page responsive", "Pour améliorer le référencement dans les moteurs de recherche"], "feedback": "Lier la légende d'une image à l'image elle-même permet de traiter l'image et sa légende comme un ensemble unique, facilitant ainsi le traitement par les technologies d'assistance. Cela garantit également que l'image et sa légende soient présentées ensemble et évite tout risque de confusion pour les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension de l'importance d'associer une légende à une image, ce qui est en lien avec les concepts d'accessibilité et de traitement des images numériques abordés dans la référence. La réponse correcte souligne le rôle des technologies d'assistance, un aspect central du contenu synthétisé. Les distracteurs sont pertinents car ils représentent des idées fausses qui pourraient être confondues avec le concept clé, renforçant ainsi l'évaluation de la compréhension. Cependant, il aurait été bénéfique d'inclure davantage d'éléments relatifs à la colorimétrie ou au cadrage pour couvrir plus largement tous les aspects mentionnés dans la référence."}, {"exercise": {"id": "8e0704032c5145a4b8a08d720994221a", "question": "Quel attribut contient l'alternative textuelle pour une image accompagnée d'une description détaillée?", "answers": ["L'attribut WAI-ARIA aria-label"], "distractors": ["L'attribut img-label-description", "L'attribut data-accessibility-text", "Un élément de balise desc", "L'attribut caption-alt", "L'attribut alt-describe", "Une balise HTML aria-img-desc", "Un identifiant aria-text-support", "Une classe CSS dédié à l'accessibilité", "Un élément de légende"], "feedback": "Dans cette situation, l'attribut WAI-ARIA aria-label permet de fournir une alternative textuelle pour l'image accompagnée d'une référence à une description détaillée adjacente. Cela permet aux personnes en situation de handicap d'accéder à l'information présente dans l'image.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la connaissance d'un aspect clé de l'accessibilité des contenus visuels, en particulier l'utilisation d'attributs pour fournir des alternatives textuelles. Cela est directement lié à la section sur l'importance des alternatives textuelles pour les utilisateurs de technologies d'assistance, comme mentionné dans la synthèse. Cependant, bien que pertinent, il pourrait être amélioré en incluant une question qui aborde également d'autres concepts tels que le contraste visuel ou les types d'images numériques. Cela aurait permis de couvrir un éventail plus large des compétences et connaissances nécessaires pour traiter efficacement des images numériques."}, {"exercise": {"id": "43ed5db4b45b4c63965cd7cf6749ea3c", "statement": "L'attribut WAI-ARIA aria-label contient à la fois l'alternative textuelle et une référence à une description détaillée adjacente.", "veracity": false, "feedback": "L'attribut WAI-ARIA aria-label ne contient que l'alternative textuelle. La référence à une description détaillée est mentionnée séparément, mais ne fait pas partie de l'attribut aria-label lui-même.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des attributs d'accessibilité, en particulier l'attribut WAI-ARIA aria-label, qui est pertinent dans le contexte de l'accessibilité des contenus visuels. Bien que l'exercice ne traite pas directement des concepts de colorimétrie ou de cadrage, il aborde un aspect essentiel de la conception graphique : l'accessibilité. La question teste la connaissance d'un détail technique important pour garantir que les images et les éléments graphiques soient accessibles à tous les utilisateurs, ce qui est en ligne avec les objectifs d'apprentissage mentionnés dans la référence. Cependant, une note légèrement inférieure à 10 est attribuée car l'exercice pourrait être plus directement lié aux types d'images numériques ou à leur impact esthétique."}, {"exercise": {"id": "b3e57401533842d0be619dce4af41dfc", "statement": "La condition de test doit garantir que la restitution est pertinente pour l'accessibilité.", "veracity": true, "feedback": "Effectivement, la restitution doit être évaluée quant à sa pertinence pour une accessibilité correcte, assurant ainsi que l'élément ou le dispositif est compatible avec les standards d'accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité dans le traitement des images numériques, ce qui est un aspect clé de la référence. L'affirmation souligne que la restitution doit être pertinente pour l'accessibilité, ce qui fait écho aux concepts abordés dans la synthèse concernant les alternatives textuelles et les normes WCAG. Cependant, bien que pertinent, l'exercice ne couvre pas directement d'autres éléments importants comme la colorimétrie ou le cadrage, ce qui empêche une note parfaite."}, {"exercise": {"id": "2f426f30fa264f6f94c2b738c0c0a2e0", "question": "Quels textes sont concernés par la mesure de contraste selon les directives ?", "answers": ["Le texte, le texte en image et les sous-titres des vidéos"], "distractors": ["Les icônes et illustrations graphiques", "Le texte dans les arrière-plans d'images", "Les bordures et décorations CSS", "Les zones blanches dans une page web", "Les logos dans les animations", "Les liens hypertextes externes", "Les titres des documents PDF", "Les boutons et menus déroulants", "Les annotations dans les diagrammes"], "feedback": "Les directives de contraste s'appliquent au texte principal ainsi qu'aux textes incrustés dans les images et animations (comme les sous-titres). Ces textes doivent être suffisamment contrastés pour être lisibles, même pour les personnes ayant une déficience visuelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f2b15e9b2aef439686cbd8a9e3eaf4ca", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Note : la pratique qui consiste à gérer des images en propriété de fond d'éléments via CSS est formellement déconseillée, même si elle est accompagnée d'un texte caché. Note : la mesure de contraste concerne le texte, le texte en image, le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos. Pour le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos, la taille de la police doit être mesurée par rapport à la taille d'affichage par défaut (telle qu'affichée). Les textes présents dans les éléments d'une image ou d'une vidéo (par exemple un écriteau, une affiche etc.) ne sont pas concernés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1ab34767803b452ab46a6755582f7b5e", "next_id": "3767e8e96bdf494f8cd8e6b538967a95", "prev_id": "f3447a85d2f14376bd33f7dc7d7e8923", "associated_block_ids": [], "first_page": 94, "last_page": 96, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des directives de contraste, qui est un aspect clé de l'accessibilité des contenus visuels abordé dans la synthèse. Il teste spécifiquement la connaissance des types de textes concernés par ces mesures, ce qui est pertinent pour le traitement des images numériques et leur impact sur l'accessibilité. Cependant, il pourrait être amélioré en incluant des questions sur d'autres concepts mentionnés dans la référence, comme les types d'images ou l'esthétique dans le design graphique."}, {"exercise": {"id": "48bcec0fe85e486b997ca81cb67263c1", "query": "Pour faciliter l'accessibilité, la longueur maximale recommandée pour une alternative textuelle est de <blank>.", "answers": ["80 caractères"], "distractors": [["50 caractères", "100 caractères", "120 caractères", "60 caractères", "70 caractères", "90 caractères"]], "feedback": "La longueur maximale de 80 caractères est recommandée car elle permet de limiter les manipulations pour les utilisateurs de technologies d'assistance telles que des plages braille ou des loupes d'écran. Un texte plus long pourrait compliquer la lecture pour ces outils.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'accessibilité des contenus visuels, en se concentrant sur les alternatives textuelles pour les images. La référence mentionne explicitement l'importance des alternatives textuelles pour garantir que les utilisateurs de technologies d'assistance puissent accéder au contenu visuel. En demandant aux apprenants de connaître la longueur maximale recommandée pour ces descriptions, l'exercice teste leur connaissance d'une norme essentielle liée à l'accessibilité. Cependant, il pourrait être amélioré en incluant davantage de concepts liés à la colorimétrie ou au cadrage, qui sont également abordés dans la synthèse."}, {"exercise": {"id": "616b5d2ed72e4a31ba53f684e25b1e18", "statement": "Une alternative textuelle doit impérativement contenir moins de 80 caractères pour être accessible.", "veracity": false, "feedback": "Il est recommandé que l'alternative textuelle ne dépasse pas 80 caractères pour limiter les manipulations des utilisateurs de technologies d'assistance, mais ce n'est pas une obligation stricte. Le nombre maximal de 80 caractères est une bonne pratique conseillée, non une règle absolue.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des alternatives textuelles, qui est un concept clé abordé dans la synthèse concernant l'accessibilité des contenus visuels. Bien que l'affirmation soit incorrecte en affirmant qu'une limite de 80 caractères est impérative, elle soulève une bonne pratique recommandée. Cela montre que l'apprenant doit comprendre non seulement les normes d'accessibilité mais aussi les nuances de leur application. Cependant, le fait que l'exercice ne teste pas directement d'autres aspects importants comme la colorimétrie ou le cadrage réduit légèrement sa pertinence globale."}, {"exercise": {"id": "6959a0ee488345c7b82f166b7c72587f", "statement": "Les technologies comme les plages braille et les loupes d'écran peuvent faciliter la lecture des alternatives textuelles.", "veracity": true, "feedback": "Il est mentionné que les technologies d'assistance telles que les plages braille et les loupes d’écran permettent aux utilisateurs d’accéder aux alternatives textuelles. Ces outils aident notamment dans la restitution de texte destiné à ceux ayant des limitations visuelles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des alternatives textuelles pour l'accessibilité des contenus visuels, ce qui est un concept clé abordé dans la synthèse. Il fait référence aux technologies d'assistance, comme les plages braille et les loupes d'écran, qui sont mentionnées dans le contexte de l'accessibilité. Cependant, bien que pertinent, l'exercice se concentre principalement sur un aspect spécifique (les technologies d'assistance) sans aborder directement d'autres éléments importants tels que le contraste visuel ou les types d'images numériques. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "3b3af59a3fa9427a8a632fc7dcb9958b", "statement": "L'audiodescription doit décrire uniquement les détails visuels importants qui ne peuvent pas être compris à partir de la piste sonore principale.", "veracity": true, "feedback": "L'audiodescription a pour but de compléter les informations disponibles dans l'audio en décrivant les éléments visuels essentiels. Cela permet aux personnes malvoyantes ou aveugles de mieux comprendre ce qui se passe visuellement lorsque ces détails ne sont pas transmis par la piste sonore principale seule.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "6b18ba6e489843e69be97a32a0d810cf", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Narration ajoutée (via un fichier son) à une piste sonore pour décrire les détails visuels importants qui ne peuvent être compris à partir de la piste sonore principale seulement. L'audiodescription doit être synchronisée avec le média temporel par un dispositif applicatif lié au lecteur lui-même ou fourni par le développement par exemple avec JavaScript. . Note 3 : lorsque toute l'information de la vidéo est déjà donnée dans la piste audio, aucune audiodescription supplémentaire n'est requise.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7c1bac306bf34d80801892580f4e5cc4", "next_id": "32305b9d04f94f71bf1029506cce3095", "prev_id": "7c1bac306bf34d80801892580f4e5cc4", "associated_block_ids": [], "first_page": 88, "last_page": 88, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité des contenus visuels, un aspect clé de la référence. En se concentrant sur l'audiodescription, il aborde comment les informations visuelles doivent être transmises aux utilisateurs ayant des déficiences visuelles, ce qui est en lien direct avec le thème de l'accessibilité mentionné dans la synthèse. Cependant, bien que pertinent, l'exercice ne couvre pas directement d'autres éléments importants comme la colorimétrie ou le cadrage des images numériques. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "7a9a0d8eaaca4a9eacdbd3f5cf15cd73", "query": "Lorsqu'une image est légendée, il est important d'associer la légende de l'image à l'image par une relation de <blank> afin que les technologies d'assistance puissent interpréter correctement cet ensemble.", "answers": ["structure"], "distractors": [["couleur", "signalisation", "marqueur", "contenu visuel", "connexion", "sémantique"]], "feedback": "Il est essentiel de relier une légende à son image par une relation de structure pour que les technologies d'assistance puissent traiter les deux comme un seul élément. Sans cette relation, ces technologies risquent de ne pas comprendre que la légende et l'image sont liées, ce qui pourrait rendre l'information inaccessible.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension de l'importance de la relation entre une image et sa légende, ce qui est directement lié à l'accessibilité des contenus visuels abordée dans la synthèse. En demandant aux apprenants d'associer correctement la légende à l'image par une relation de structure, il teste leur connaissance des concepts clés tels que l'utilisation d'alternatives textuelles et le traitement des images numériques pour garantir l'accès à tous les utilisateurs, y compris ceux utilisant des technologies d'assistance. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, comme le contraste visuel ou les types d'images numériques. C'est pourquoi il obtient un score élevé mais pas parfait."}, {"exercise": {"id": "5599f501ed314414a5b63960a180fab0", "question": "Quelle alternative textuelle doit être considérée comme base de référence ?", "answers": ["Celle des technologies d'assistance dans l’environnement de test"], "distractors": ["Celle configurée manuellement dans l’application", "Le texte saisi par les utilisateurs finaux", "Les valeurs par défaut indiquées dans la documentation", "Celle fournie par l'algorithme initial", "Les recommandations des développeurs logiciels", "Les résultats obtenus via des outils tiers", "La configuration réseau de l'environnement", "Les mises à jour logicielles du système", "Celle renseignée dans les registres du système"], "feedback": "Dans ce cas de figure, il faut se fier à la valeur fournie par les technologies d'assistance utilisées dans l'environnement de test en tant que base de référence pour l'alternative textuelle, et non à des valeurs configurées manuellement ou par défaut.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d9252e7a2a9d4f659cd86ef8f57c1017", "order": 25.0, "image_url": null, "origin_type": "document_content", "text": "Néanmoins, en cas de support partiel de l'algorithme de calcul du « nom accessible », c'est la valeur réellement restituée par les technologies d'assistance utilisées dans l'environnement de test (ou « base de référence ») qu'il faudra considérer comme alternative textuelle.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "next_id": "31b407ea8d1e4dfe8afb8b533b4e483d", "prev_id": "88196e46ab824e1799e7d0816c9e519c", "associated_block_ids": [], "first_page": 86, "last_page": 86, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur l'importance des alternatives textuelles pour les images, ce qui est un aspect clé de la référence concernant l'accessibilité des contenus visuels. Cependant, la question posée semble plus axée sur une situation spécifique liée à l'environnement de test plutôt que sur une compréhension générale des concepts de colorimétrie ou de cadrage. Bien qu'il évalue une partie pertinente du sujet, il ne couvre pas entièrement les autres éléments importants mentionnés dans la synthèse, tels que le contraste visuel et l'esthétique. Par conséquent, bien qu'il soit pertinent, il ne teste pas tous les aspects clés de la référence."}, {"exercise": {"id": "743e57b6a1e84db9833d12602a887e5f", "statement": "Lorsque l'algorithme de calcul du 'nom accessible' est partiellement pris en charge, il faut considérer la valeur d'origine comme alternative textuelle.", "veracity": false, "feedback": "Ce n'est pas la valeur d'origine qui est prise en compte, mais plutôt la valeur restituée par les technologies d'assistance dans l'environnement de test. Celle-ci doit être utilisée comme alternative textuelle lorsqu'il y a un support partiel de l'algorithme.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d9252e7a2a9d4f659cd86ef8f57c1017", "order": 25.0, "image_url": null, "origin_type": "document_content", "text": "Néanmoins, en cas de support partiel de l'algorithme de calcul du « nom accessible », c'est la valeur réellement restituée par les technologies d'assistance utilisées dans l'environnement de test (ou « base de référence ») qu'il faudra considérer comme alternative textuelle.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "next_id": "31b407ea8d1e4dfe8afb8b533b4e483d", "prev_id": "88196e46ab824e1799e7d0816c9e519c", "associated_block_ids": [], "first_page": 86, "last_page": 86, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité des contenus visuels, en lien avec l'utilisation d'alternatives textuelles pour les images. Cela correspond à une partie des concepts clés mentionnés dans la référence, notamment l'importance de fournir des descriptions appropriées pour garantir que tous les utilisateurs, y compris ceux utilisant des technologies d'assistance, puissent accéder au contenu visuel. Cependant, l'exercice se concentre spécifiquement sur un détail technique concernant le 'nom accessible', ce qui peut ne pas couvrir entièrement la portée plus large de la colorimétrie et du cadrage évoqués dans la référence. Ainsi, bien qu'il soit pertinent, il ne teste pas directement tous les aspects clés de la référence."}, {"exercise": {"id": "fd2fffde74194be18561b8d1d2b75601", "statement": "Il est nécessaire de fournir une alternative accessible pour un composant JavaScript si ce dernier n'est pas rendu accessible.", "veracity": true, "feedback": "Il est en effet essentiel de proposer une alternative spécifique lorsqu'un composant JavaScript ne peut pas être rendu accessible afin de garantir une expérience utilisateur inclusive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "6651b2dd1dc54f1788efcdc58d58b531", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Note importante : dans un environnement HTML5, beaucoup de composants peuvent nécessiter JavaScript pour fonctionner ; en conséquence la fourniture d'une alternative à un composant JavaScript qui ne pourrait pas être rendu accessible devra bénéficier d'une méthode spécifique au composant en cause, permettant de le remplacer par une alternative accessible (et de le réactiver). Cela signifie que la désactivation de JavaScript pour l'ensemble de la page ne sera pas acceptée comme une méthode valable, à moins qu'elle ne remette pas en cause l'utilisation des autres composants.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf92b5f2e30c4b72a9939e35bc21a854", "next_id": "db79017022d14db09eafa0f20c9e8b2c", "prev_id": "14dc674e93034566b12def6e88ecc962", "associated_block_ids": [], "first_page": 48, "last_page": 48, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'accessibilité des contenus numériques, un aspect clé de la référence. Bien que l'affirmation porte sur les composants JavaScript et leur accessibilité, elle ne traite pas directement des images numériques ni des concepts de colorimétrie ou de cadrage mentionnés dans la référence. Cependant, le lien avec l'accessibilité est pertinent et montre une compréhension des principes généraux qui sous-tendent la conception graphique inclusive. L'exercice pourrait être amélioré en intégrant des éléments spécifiques aux images numériques pour mieux correspondre à la référence."}, {"exercise": {"id": "64682f4463314c6f9a8f00d69e6c2034", "statement": "Il est possible de supprimer l'indication visuelle du focus d'un élément à condition que le style ajouté soit suffisamment visible et contrasté.", "veracity": true, "feedback": "L'indication visuelle du focus peut être ajustée ou remplacée uniquement si un style personnalisé est ajouté et qu'il respecte les critères de visibilité et de contraste suffisants, conformément aux bonnes pratiques d'accessibilité concernant le critère 3.3.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "fd43e9c74e7940dbb6bd4b4f46a4f448", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "La prise de focus est l'état renvoyé par un élément qui reçoit l'attention suite à une action de l'utilisateur. Il y a trois moyens en HTML de donner le focus à un élément : Note 2 : l'indication visuelle du focus du navigateur ne doit pas être pas supprimée ou dégradée sauf si un style du focus défini par l'auteur est visible et suffisamment contrasté au regard du critère 3.3.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c33e45f531924b10938e9149499b7ed4", "next_id": "c990b14433b64c91a14370bdf18ed4b6", "prev_id": "c33e45f531924b10938e9149499b7ed4", "associated_block_ids": [], "first_page": 117, "last_page": 117, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité visuelle, en lien avec le contraste et la visibilité des éléments graphiques, qui est mentionné dans la référence. Cependant, il se concentre spécifiquement sur l'indication du focus d'un élément, ce qui n'est qu'une partie des concepts plus larges liés à la colorimétrie et au cadrage des images numériques. Bien que pertinent pour l'accessibilité, cet exercice ne couvre pas directement les types d'images numériques ou leur impact esthétique dans la conception graphique. Par conséquent, bien qu'il soit pertinent, il ne teste pas de manière exhaustive les concepts clés de la référence."}, {"exercise": {"id": "e7e1673132b44458805f53b7217e6beb", "statement": "Le contenu caché peut être restitué par les technologies d'assistance après une action de l'utilisateur, comme un repositionnement du focus.", "veracity": true, "feedback": "Le contenu caché est rendu accessible aux technologies d'assistance après que l'utilisateur effectue certaines actions, notamment en utilisant le clavier ou un dispositif de pointage pour interagir avec un élément précédent ou en repositionnant le focus sur le contenu caché.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "81a4133a958f4554b9449289bc14fb56", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "· Le contenu caché n'a pas vocation à être ignoré par les technologies d'assistances et est rendu restituable par les technologies d'assistance suite à une action de l'utilisateur réalisable au clavier ou par tout dispositif de pointage sur un élément précédent le contenu caché ou suite à un repositionnement du focus dessus. Sauf si le contenu contrôlé par aria-hidden n'a pas vocation à être restitué par les technologies d'assistance, la valeur de l'attribut aria-hidden doit être cohérente avec l'état affiché ou masqué du contenu à l'écran.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e3c23a998e6743b0afa4a47412aecb95", "next_id": "92da586e97e94e9f810c3382f2a24e26", "prev_id": "0bcf73e79ee24cd0ae021d935ac733eb", "associated_block_ids": [], "first_page": 59, "last_page": 59, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect de l'accessibilité des contenus visuels, qui est un sujet clé dans la référence. Il teste la compréhension de la manière dont les technologies d'assistance interagissent avec le contenu caché, ce qui est pertinent pour garantir que tous les utilisateurs peuvent accéder à l'information. Cependant, l'exercice ne couvre pas directement d'autres concepts importants mentionnés dans la synthèse, tels que les types d'images numériques ou le contraste visuel. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects clés de la référence."}, {"exercise": {"id": "041c6d601d324bd6a43df7844aab78d0", "question": "Quel est le niveau de conformité le plus élevé des WCAG 2.0 ?", "answers": ["Le niveau AAA"], "distractors": ["Le niveau A+", "Le niveau A+S", "Le niveau AA+", "Le niveau AB", "Le niveau X", "Le niveau A-", "Le niveau XS", "Le niveau AB+", "Le niveau B"], "feedback": "Le niveau AAA représente le niveau de conformité le plus élevé dans les lignes directrices WCAG 2.0. Il s'agit d'un niveau exigeant dans lequel les utilisateurs doivent être en mesure d'accéder à toutes les informations fournies sur un site web sans rencontrer de difficultés majeures. Il nécessite donc un certain niveau de technicité et d'exhaustivité dans l'optimisation de l'accessibilité du site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8d71b22723174636b54af7115fb98029", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Le World Wide Web Consortium (Tim berner-lee), abrégé par le sigle W3C, est un organisme de standardisation à but non lucratif, fondé en octobre 1994 chargé de promouvoir la compatibilité des technologies du World Wide Web telles que HTML5, HTML, XHTML, XML, RDF, CSS, XSL, PNG, SVG. Fonctionnant comme un consortium international, il regroupe, au 14 août 2020, 434 entreprises partenaires. Chaque ligne directrice de WCAG 2.0 comporte trois niveaux de conformité : A (minimal), AA (moyen) et AAA (le plus élevé).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e84573ff412c46ae9983afed596faca0", "next_id": "7a83a13bf755451e8bd3136710373656", "prev_id": "6aa1c7b23f06468e8f0c02f2f5b9b821", "associated_block_ids": [], "first_page": 52, "last_page": 53, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance des niveaux de conformité des WCAG, ce qui est pertinent pour le sujet de l'accessibilité des contenus visuels abordé dans la synthèse. Cependant, il ne couvre pas directement les concepts clés liés à la colorimétrie ou au cadrage des images numériques mentionnés dans la référence. Bien qu'il soit lié à l'accessibilité, il ne permet pas d'évaluer en profondeur la compréhension des différents types d'images numériques ou leur impact esthétique dans la conception graphique. Par conséquent, bien que l'exercice ait une certaine pertinence, il n'évalue pas complètement les éléments essentiels de la référence."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 26.3, "top_pages": [96, 25], "top_minutes": []}]}