{"introduction": "La conception de supports de communication tels que des panneaux d'exposition, présentoirs et stands est essentielle pour transmettre efficacement des messages visuels. Ce processus implique une compréhension approfondie des éléments graphiques, de l'ergonomie et de la lisibilité afin d'assurer une expérience utilisateur optimale. Les concepts suivants explorent les différentes facettes nécessaires à la création de ces supports, en mettant l'accent sur leur impact visuel et fonctionnel.", "synthesis": "La création de panneaux d'exposition et autres supports visuels repose sur plusieurs thèmes centraux. Tout d'abord, les **éléments graphiques** jouent un rôle fondamental dans la communication visuelle. Ils incluent images, typographie et illustrations qui facilitent la compréhension des informations complexes tout en influençant l'interaction utilisateur. En parallèle, l'**image**, qu'elle soit bitmap ou vectorielle, est cruciale pour capter l'attention du public et véhiculer des émotions. La **lisibilité** est également primordiale ; elle détermine la facilité avec laquelle le contenu peut être lu et compris, ce qui est essentiel pour maintenir l'engagement du spectateur.\n\nEnsuite, l'**ergonomie**, tant physique que numérique, s'avère indispensable dans le design des interfaces. L'**ergonomie numérique**, par exemple, vise à optimiser l'expérience utilisateur sur les plateformes digitales en créant des interfaces intuitives qui répondent aux attentes des utilisateurs. Cela inclut également la prise en compte du **contexte d'utilisation**, qui influence directement comment un produit sera perçu et utilisé par son audience cible.\n\nLes **composants d'interface utilisateur**, tels que boutons et liens, sont essentiels pour permettre une interaction fluide avec le contenu présenté. Leur conception doit respecter les principes d'**organisation de page** afin de garantir une navigation claire et intuitive. De plus, les outils comme Figma ou Adobe XD permettent aux designers de créer ces composants tout en maintenant une cohérence visuelle.\n\nEnfin, le principe de **simplicité** dans le design encourage à réduire les éléments superflus pour favoriser une interface claire et agréable à utiliser. Cette approche se combine avec le concept de **design-first**, où l'esthétique est priorisée dès le début du processus créatif. En intégrant tous ces éléments — ergonomie, lisibilité, simplicité — on peut concevoir des supports efficaces qui non seulement attirent mais aussi retiennent l'attention du public cible.", "concepts": [{"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les éléments graphiques sont essentiels pour concevoir des panneaux d'exposition et des stands, car ils constituent les composants visuels qui communiquent le message souhaité."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "'Image' est fondamental dans le design graphique et joue un rôle clé dans l'attractivité et l'efficacité des panneaux d'exposition."}, {"concept": {"id": "95951d09-407f-42df-b703-47680e64ec8f", "label": "Ergonomie", "definition": "L'ergonomie est une science interdisciplinaire qui étudie la conception des objets, systèmes et produits afin qu'ils soient adaptés aux utilisateurs. Elle vise à optimiser l'interaction entre l'homme et son environnement en améliorant le confort, l'efficacité, la sécurité et la satisfaction des utilisateurs. Cela inclut également l'adaptation des interfaces aux besoins et comportements des utilisateurs tout en tenant compte de leurs capacités physiques et cognitives.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13710], "aliases": ["80655e5a-4c5c-4bde-90f0-54b72dda4845", "2671d243-2e4f-4a1e-a92e-61a810365839", "b25bf7f5-d332-4992-ac34-d439e39f149b"], "wikientity": {"label": "Ergonomie", "definition": "L’ergonomie est « l'étude scientifique de la relation entre l'humain et ses moyens, méthodes et milieux de travail » et l'application de ces connaissances à la conception de systèmes « qui puissent être utilisés avec le maximum de confort, de sécurité et d'efficacité par le plus grand nombre ».", "page_id": "1268752", "wikidata_id": "Q1750812", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Ergonomie", "definition": "the branch of engineering science in which biological science is used to study the relation between workers and their environments", "name": "biotechnology.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "L'ergonomie est cruciale dans la conception de tout espace exposé, car elle assure que les utilisateurs interagissent confortablement et efficacement avec le stand ou le panneau."}, {"concept": {"id": "407bc6c7-7486-4f6b-bc1c-ba5f3664d346", "label": "Ergonomie Numérique", "definition": "L'ergonomie numérique est une discipline qui vise à optimiser l'expérience utilisateur sur les interfaces numériques, notamment sur les appareils mobiles et les sites web. Elle se concentre sur la création d'interfaces intuitives et agréables, facilitant la navigation tout en répondant aux attentes des utilisateurs. L'ergonomie mobile prend en compte la conception spécifique pour les appareils portables, influençant également le classement dans les résultats de recherche Google. En somme, l'ergonomie numérique englobe tous les aspects de la qualité d'interface qui assurent une expérience utilisateur fluide et satisfaisante.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13707, 13710], "aliases": ["92024af3-eda4-4a37-98fb-fe2c19bb10b3", "31986d9e-30f7-4e45-827d-d4017b578758", "dac2c993-0388-4d64-846f-02e56618d8c0"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'ergonomie numérique est centrale à la création de supports visuels efficaces, car elle vise à optimiser l'expérience utilisateur sur divers dispositifs, y compris ceux utilisés pour les expositions."}, {"concept": {"id": "ff356c21-a6a9-4643-9b85-5ea63c1962d7", "label": "Composants d'Interface Utilisateur", "definition": "Les composants d'interface utilisateur sont des unités graphiques indépendantes et réutilisables, telles que des boutons, des liens ou des cartes, qui encapsulent la logique et le rendu d'une partie de l'interface. Ils permettent aux utilisateurs d'interagir avec le contenu et les fonctionnalités sur une page web. Dans des outils comme Figma, ces éléments aident les designers à maintenir une cohérence visuelle tout en facilitant les mises à jour, s'assemblant pour former des structures plus complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13668, 13708], "aliases": ["aa4065a5-c93e-4843-8784-987b3fb4a95b", "a52293d6-e08a-4666-9aa0-34c8daaf1426", "c177b8d1-7c43-4e1e-8b3d-ae5c9e7b3057"], "wikientity": {"label": "Composant logiciel", "definition": "En architecture logicielle, un composant logiciel est un élément constitutif d'un logiciel destiné à être incorporé en tant que pièce détachée dans des applications. Les paquets, les bibliothèques logicielles, les exécutables, les fichiers, les bases de données ou encore des éléments de configuration (paramètres, scripts, fichiers de commandes) sont des composants logiciels. \nLes composants logiciels sont développés par des professionnels de l'informatique en vue d'être réutilisés dans leurs propres logiciels, ou en vue d'être mis sur le marché et incorporés dans des logiciels tiers.", "page_id": "1824031", "wikidata_id": "Q17176533", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les composants d'interface utilisateur sont cruciaux pour créer des éléments interactifs dans un stand ou un panneau numérique, rendant cette notion très pertinente pour le contexte donné."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "'Lisibilité' est cruciale pour tout type de communication visuelle, y compris les panneaux d'exposition, car elle affecte directement l'engagement et la compréhension du public."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La balise <svg> est essentielle pour intégrer des graphiques vectoriels dans les supports visuels, ce qui en fait un élément clé pour concevoir des panneaux d'exposition attrayants."}, {"concept": {"id": "9063ef01-8369-4bd6-89af-11353700ccf4", "label": "image porteuse d'information", "definition": "Image essentielle à la compréhension du contenu, fournissant des informations critiques et souvent liée à des liens ou boutons.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Une image porteuse d'information est essentielle pour un panneau d'exposition car elle aide à transmettre des messages clés et attire l'attention du public."}, {"concept": {"id": "101b1f49-a9d9-49ec-ab99-f4a962b122ab", "label": "Éléments <fieldset> et <legend>", "definition": "Les éléments HTML <fieldset> et <legend> sont utilisés pour regrouper visuellement des champs de formulaire similaires, améliorant ainsi l'organisation et l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "<fieldset> et <legend> sont très pertinents pour organiser des informations sur un panneau d'exposition, améliorant ainsi l'accessibilité et l'organisation visuelle des contenus présentés."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le format vectoriel est très pertinent pour la création de supports visuels tels que des panneaux d'exposition, car il permet une mise à l'échelle sans perte de qualité, essentielle pour le graphisme."}, {"concept": {"id": "180973ca-7ea4-4179-9de6-4306d5f4a2c2", "label": "Composants d'interface", "definition": "Les composants d'interface sont des éléments interactifs sur une page web, tels que des boutons, des liens et des menus, qui permettent aux utilisateurs d'interagir avec le système et sont essentiels pour l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["b5b72bc5-0aa8-4ebc-9e2a-5b66e752e50d"], "wikientity": {"label": "Composant d'interface graphique", "definition": "En informatique, un composant d'interface graphique (aussi appelé widget en anglais ou encore control) est un élément de base d'une interface graphique avec lequel un utilisateur peut interagir (par exemple une fenêtre ou une zone de texte). Ces composants sont généralement regroupés dans des boîtes à outils graphiques (appelées toolkit en anglais). Une fois assemblés par un programmeur, ces composants forment une interface graphique complète.", "page_id": "1587875", "wikidata_id": "Q605117", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les composants d'interface sont importants pour l'interaction utilisateur dans un environnement numérique, mais leur pertinence par rapport à un panneau physique est limitée bien qu'ils puissent inspirer certains aspects interactifs."}, {"concept": {"id": "af063a7b-697c-4698-a3f9-571b25d446e7", "label": "Ergonomie web", "definition": "Discipline visant à adapter, concevoir et optimiser les interfaces web et utilisateur afin de garantir une utilisation facile, intuitive et confortable, favorisant ainsi la satisfaction des utilisateurs tout en tenant compte des lois psychologiques comme celles de Miller et Fitts, et améliorant l'expérience utilisateur sur les sites internet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707], "aliases": ["a22c9961-6357-4e30-8ce8-913123f918ec", "124581b4-e0cd-46eb-affc-0e2e0d426e33"], "wikientity": {"label": "Ergonomie des interfaces informatiques", "definition": "L'ergonomie informatique (ou ergonomie des interfaces) est une branche de l'ergonomie, qui a pour objectif d'améliorer les interactions homme-machine, la facilité d’utilisation et d’apprentissage des produits interactifs. Cette pratique cherche à concevoir ou modifier des interfaces afin qu'elles soient en adéquation avec les caractéristiques physiologiques, perceptives et cognitives de leurs utilisateurs potentiels. Elle s'appuie sur différentes  méthodes de conception et d’évaluation permettant d’obtenir le logiciel ou le site web le mieux adapté aux utilisateurs visés.", "page_id": "4962192", "wikidata_id": "Q1642623", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'ergonomie web est très pertinente car les principes ergonomiques peuvent également s'appliquer à la conception physique des panneaux pour assurer une bonne lisibilité et accessibilité."}, {"concept": {"id": "7cff2f67-e7cc-4264-ade4-2d0d96f0cadb", "label": "Outils de design web", "definition": "Logiciels utilisés par les designers pour créer des interfaces utilisateur attrayantes et fonctionnelles, tels que Adobe XD ou Figma.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les outils de design web sont cruciaux pour créer des interfaces attrayantes et fonctionnelles, ce qui est directement applicable à la conception de présentoirs et stands."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La simplicité est un principe fondamental en design qui s'applique directement à la création de panneaux d'exposition, favorisant une communication claire et efficace."}, {"concept": {"id": "7f68a084-10a3-4266-90e0-653c0f007cfd", "label": "Design-first", "definition": "Approche de conception priorisant l'esthétique et l'expérience utilisateur dès le début du processus de développement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Design-first' souligne l'importance de l'esthétique dès le début du processus créatif, ce qui est essentiel lors de la conception d'un panneau d'exposition attractif."}, {"concept": {"id": "d90c15d6-a890-40ff-9021-d9e24563d56a", "label": "Contexte d'utilisation", "definition": "Ensemble des conditions dans lesquelles un produit est utilisé, influençant son ergonomie et son efficacité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Utilisabilité", "definition": "L’utilisabilité, ou encore aptitude à l'utilisation est définie par la norme ISO 9241-11 comme « le degré selon lequel un produit peut être utilisé, par des utilisateurs identifiés, pour atteindre des buts définis avec efficacité, efficience et satisfaction, dans un contexte d’utilisation spécifié ».\nC'est une notion proche de celle d'affordance, ou même d’ergonomie qui est cependant plus large.\nLes critères de l’utilisabilité sont :\n\nl’efficacité : le produit permet à ses utilisateurs d’atteindre le résultat prévu.", "page_id": "142385", "wikidata_id": "Q216378", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le contexte d'utilisation est très pertinent car il influence directement la manière dont un panneau d'exposition doit être conçu pour répondre aux besoins des utilisateurs et maximiser son efficacité."}, {"concept": {"id": "6e187cc3-dc12-420a-bb87-62ca68aa8b43", "label": "Lien image", "definition": "Un lien HTML contenant uniquement des éléments d'image, tels que <img>, <area>, <object>, <canvas> ou <svg>, facilitant l'intégration visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le lien image est directement pertinent pour la création de supports visuels, car il facilite l'intégration d'éléments graphiques dans un panneau d'exposition."}, {"concept": {"id": "d5978979-95eb-4c2f-bbf0-34d3ca920f47", "label": "Objectifs stratégiques", "definition": "Buts définis par un site web ou une application qui guident le design et l'ergonomie en fonction des besoins des usagers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les objectifs stratégiques sont directement liés à la conception et à l'ergonomie des supports de communication, ce qui en fait un concept très pertinent pour réaliser un panneau d'exposition."}, {"concept": {"id": "826ac735-9873-4b63-a658-7a9022f13f23", "label": "Organisation de page", "definition": "Structure et agencement des éléments d'une page web pour optimiser la navigation et l'expérience utilisateur, en tenant compte de la hiérarchie visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'organisation de page est cruciale pour optimiser l'expérience utilisateur sur tout type de support visuel, y compris les panneaux d'exposition."}, {"concept": {"id": "1092d789-d0be-4326-b469-d82156055fd1", "label": "Modèles prédéfinis", "definition": "Structures HTML fournies par Twig pour insérer facilement des données tout en maintenant une séparation claire entre le code et le visuel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13618], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les modèles prédéfinis sont très pertinents car ils facilitent la création de supports visuels en permettant une séparation claire entre le contenu et l'apparence, ce qui est essentiel dans la conception de panneaux d'exposition."}, {"concept": {"id": "49cfc2c6-bf96-4192-8004-86d1ace1d976", "label": "Image bitmap", "definition": "Représentation graphique numérique composée de pixels, utilisée dans divers formats tels que JPEG ou PNG, ainsi que dans les balises <canvas> pour afficher des informations visuelles sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["3b69cc8b-032e-4ab9-a522-6a5cf578c980"], "wikientity": {"label": "Image matricielle", "definition": "Une image matricielle, ou « carte de points » (de l'anglais bitmap), est une image constituée d'un pavage carré dont chaque élément, appelé point ou pixel, est coloré selon un code enregistré dans un tableau à deux dimensions.\nDans les domaines de l'imagerie numérique et de l'infographie, on parle d'image matricielle par opposition avec l'image vectorielle.", "page_id": "70340", "wikidata_id": "Q182270", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'image bitmap est essentielle pour créer des éléments graphiques sur un panneau d'exposition, car elle représente le type principal de contenu visuel utilisé dans ces contextes."}, {"concept": {"id": "35731d03-1f0f-45f7-9e26-a44b29a90f40", "label": "Légende d'image", "definition": "Texte associé à une image, fournissant des informations complémentaires ou contextuelles, essentiel pour l'accessibilité et la compréhension visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La légende d'image est importante pour fournir un contexte visuel et améliorer l'accessibilité des images utilisées dans les supports de communication, ce qui en fait un concept pertinent."}, {"concept": {"id": "f9b7ff84-41ad-4b87-9037-60ce30d08594", "label": "DesignGouv", "definition": "Pôle Design des services numériques du gouvernement français, chargé de promouvoir une meilleure expérience utilisateur dans les services publics.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "DesignGouv est pertinent car il traite du design et de l'expérience utilisateur, ce qui peut influencer la manière dont un panneau d'exposition est conçu pour être efficace et attrayant."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La description détaillée est pertinente car elle enrichit le contenu visuel d'un panneau d'exposition, en fournissant un contexte essentiel pour les utilisateurs."}, {"concept": {"id": "7c15d1a8-6a39-4bb9-b353-1112c86b8900", "label": "Communication digitale", "definition": "Échange d'informations via des plateformes numériques, nécessitant une ergonomie adaptée pour optimiser l'interaction.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Communication numérique", "definition": "La communication numérique, parfois appelée « communication digitale » (anglicisme), est un champ des sciences de l’information relatif à l'utilisation de l’ensemble des médias numériques : le web, les médias sociaux ou les terminaux mobiles par exemple. Ces médias sont utilisés comme des canaux de diffusion, de partage et de création d'informations.", "page_id": "5018281", "wikidata_id": "Q97368847", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La communication digitale est très pertinente car elle englobe les échanges d'informations via des supports numériques, ce qui est essentiel pour concevoir des panneaux d'exposition modernes."}, {"concept": {"id": "d4605453-350f-4fb5-a9bb-d19ea166d057", "label": "Zone d'en-tête", "definition": "Section supérieure d'un document contenant des éléments comme le titre et le logo, essentielle pour l'identité visuelle et la navigation du site.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Zone d'en-tête' est pertinente car elle joue un rôle clé dans l'identité visuelle et peut influencer comment un panneau ou stand communique son message."}, {"concept": {"id": "25607d68-d4d4-4728-aeb8-1efc423cda6b", "label": "Compatibilité avec les technologies d'assistance", "definition": "Capacité d'un contenu à fonctionner avec des outils facilitant l'accès pour les utilisateurs ayant des besoins spécifiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La compatibilité avec les technologies d'assistance est pertinente car elle assure que les supports de communication sont accessibles à tous, ce qui est essentiel dans la conception de tout type de matériel visuel."}, {"concept": {"id": "9afb0643-e273-456d-8fd2-4ab13b0d8236", "label": "Contraste visuel", "definition": "Le contraste visuel, ou ratio de contraste, désigne la mesure de l'opposition entre la luminosité ou la couleur d'un élément de premier plan et celle d'un arrière-plan. Ce contraste est essentiel pour garantir la lisibilité et l'accessibilité des contenus numériques sur les pages web et les interfaces visuelles, en particulier pour les utilisateurs ayant des déficiences visuelles. Il joue un rôle crucial dans l'expérience utilisateur en assurant que le contenu soit facilement discernable par tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707, 13710, 13708], "aliases": ["5c481e4e-e436-4bb7-a7e9-53bc0830e306", "b12c3286-f79e-4321-a6d3-db4c95e9c849", "650d5354-ed61-4940-8878-706a15f07f6f", "1c2f3e20-96e3-4275-8631-9e9564ed2ed1", "c4dddffe-8da9-4405-8b54-28eb0959e6dd", "7141a9bd-f2a9-4685-95e3-5e81f87d7c9a", "cd3ee3d7-bb6f-4084-9226-a941f6eb43b9"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le contraste visuel est crucial pour garantir que les informations sur un panneau soient lisibles et accessibles, ce qui en fait un concept pertinent pour cette référence."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les usagers sont essentiels dans le processus de conception des panneaux d'exposition, car comprendre leurs besoins permet de créer des supports plus efficaces et engageants."}, {"concept": {"id": "7843365f-32d0-4ace-98d4-f900474fa71e", "label": "UI Designer", "definition": "Designer d'interface utilisateur responsable de l'apparence visuelle et de l'interactivité d'un produit numérique, complémentaire au travail de l'UX designer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'UI Designer' a une certaine pertinence car ces professionnels peuvent contribuer à l'aspect visuel des supports physiques en appliquant leurs compétences en design graphique."}, {"concept": {"id": "292d70cc-3de3-4698-a1e6-f79cd67134cc", "label": "Zones de regroupement de contenus", "definition": "Sections récurrentes sur plusieurs pages (comme en-têtes ou pieds de page) qui organisent le contenu et améliorent la navigation utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les zones de regroupement de contenus aident à organiser l'information sur un panneau d'exposition, rendant ainsi le contenu plus accessible et compréhensible pour le public."}, {"concept": {"id": "14c0dfc4-ae59-4351-b9d4-991278432fb8", "label": "Contenu alternatif", "definition": "Information présentée différemment mais équivalente à un autre contenu, respectant les critères d'accessibilité du RGAA.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Contenus alternatifs", "definition": "Un contenu alternatif est un programme diffusé au cinéma mais qui n’est pas un film. Il peut s’agir d’un ballet, d’un opéra, d’un concert, d’un match sportif, de gaming, d’une émission de télévision… Le contenu alternatif peut aussi bien être retransmis en direct qu’en différé. L’arrivée du numérique a beaucoup contribué au développement des contenus alternatifs.", "page_id": "6415654", "wikidata_id": "Q2995542", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le contenu alternatif est essentiel pour garantir l'accessibilité des informations présentées sur les supports visuels, ce qui en fait un concept pertinent dans ce contexte."}, {"concept": {"id": "9d54c769-32af-4dfb-bf56-1878ed64d5e5", "label": "Perception des informations", "definition": "Capacité à interpréter et comprendre les données présentées dans une interface; cruciale pour une navigation efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'La perception des informations' est cruciale pour une bonne compréhension du contenu présenté sur un panneau, ce qui lui confère une pertinence modérée à élevée."}, {"concept": {"id": "ea3b302e-400a-4bcf-aecc-45fdadbd09d6", "label": "Laurène Castor", "definition": "Laurène Castor est une designer et professeur chez OpenClassrooms, spécialisée dans la conception centrée sur l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Laurène Castor, en tant que designer spécialisée dans la conception centrée sur l'utilisateur, apporte une perspective précieuse qui peut influencer la création efficace de supports visuels."}, {"concept": {"id": "a11a000a-f07d-4ba3-933b-0d10c309a701", "label": "Sens de lecture", "definition": "Le sens de lecture désigne l'ordre et la direction dans lesquels les utilisateurs perçoivent le contenu textuel, soit de gauche à droite (ltr) ou de droite à gauche (rtl). Cela influence non seulement leur compréhension et interaction avec l'interface, mais aussi la disposition visuelle des étiquettes et champs selon les langues, impactant ainsi l'expérience utilisateur globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13708], "aliases": ["a399fbb0-f9a6-4ad5-aef8-f913cc09855b", "784198af-fc09-4b14-ab54-0c3a4cb8e600"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le sens de lecture influence comment les informations sont perçues sur un panneau d'exposition, ce qui est important pour sa conception efficace."}, {"concept": {"id": "43951e15-af78-496b-8f5f-e107f6ff4d99", "label": "Rôle presentation WAI-ARIA", "definition": "Attribut permettant de supprimer la sémantique d'un élément HTML afin qu'il soit traité uniquement comme un élément visuel sans signification structurelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le rôle presentation WAI-ARIA est pertinent car il aide à gérer comment les éléments sont perçus par les technologies d'assistance, ce qui peut être crucial pour l'accessibilité des panneaux exposés."}, {"concept": {"id": "e140233a-c3e5-430c-aff1-fbac9f904d56", "label": "Titre associé", "definition": "Élément fournissant un titre à un tableau de données, souvent via une balise <caption>, essentiel pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Titre associé' est important pour fournir un contexte aux données présentées sur un panneau, contribuant ainsi à une meilleure compréhension et accessibilité."}, {"concept": {"id": "a2024caf-bad3-4b20-a384-8d3cea0b2ff7", "label": "Dribbble", "definition": "Plateforme en ligne pour designers permettant de partager des travaux créatifs et de s'inspirer des tendances actuelles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": {"label": "Dribbble", "definition": "Dribbble est un site internet qui regroupe des travaux de designer. Il sert de plate-forme de conception de portfolio , l'une des plus grandes plates-formes permettant aux concepteurs de partager leur travail en ligne. La société est entièrement isolée, sans siège social.", "page_id": "12597240", "wikidata_id": "Q7605173", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Dribbble est pertinent car il s'agit d'une plateforme où les designers peuvent trouver inspiration et idées pour leurs créations visuelles, y compris des panneaux d'exposition."}, {"concept": {"id": "de2ea374-bfe8-4e91-bc15-584005b02914", "label": "Équivalents textuels", "definition": "Descriptions textuelles fournies pour remplacer le contenu non textuel afin de garantir l'accès aux utilisateurs malvoyants.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les équivalents textuels sont importants pour l'accessibilité dans les supports visuels, ce qui en fait un concept pertinent pour s'assurer que le contenu du panneau est accessible à tous."}], "exercises": [{"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension des éléments clés liés à l'ergonomie et à l'expérience utilisateur, qui sont essentiels pour concevoir des supports de communication efficaces. La question demande spécifiquement ce que le design doit prendre en compte pour être efficace, ce qui renvoie aux concepts d'ergonomie et d'interaction utilisateur mentionnés dans la synthèse. La réponse correcte 'L'expérience utilisateur' est pertinente et bien alignée avec les objectifs d'apprentissage de la référence. Les distracteurs proposés sont également pertinents car ils représentent des aspects du design qui ne sont pas directement liés à l'efficacité dans le contexte donné, renforçant ainsi la validité de l'exercice."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur dans le design, ce qui est un aspect clé du contexte de la référence sur la création de panneaux d'exposition et supports visuels. L'accent mis sur l'ergonomie et l'interaction utilisateur dans la synthèse renforce cette pertinence. Cependant, bien que pertinent, l'exercice ne couvre pas directement tous les éléments graphiques ou les principes spécifiques mentionnés dans la synthèse, tels que la lisibilité ou les composants d'interface utilisateur. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du terme 'design' dans le contexte de la création de supports de communication, ce qui est pertinent par rapport à la référence. Il aborde des concepts clés tels que l'ergonomie et l'organisation des éléments, qui sont essentiels pour concevoir un panneau d'exposition efficace. Cependant, il pourrait être amélioré en intégrant des questions plus variées sur les autres aspects mentionnés dans la synthèse, comme la lisibilité ou l'utilisation d'outils spécifiques. Cela aurait permis une évaluation plus complète des compétences liées à la conception visuelle."}, {"exercise": {"id": "2f7d688d2dfe42259fea3dd5882400bd", "question": "Quelle caractéristique principale rend la police Arial particulièrement adaptée à une utilisation numérique ?", "answers": ["Elle offre une grande lisibilité même sur les supports numériques"], "distractors": ["Elle est spécialement conçue pour le design d'identités visuelles complexes.", "Elle utilise des empattements distincts pour améliorer l'esthétique de la page.", "Elle a été développée pour être utilisée uniquement dans le secteur financier.", "Elle a un style manuscrit qui fonctionne bien pour les invitations formelles.", "Elle propose différentes versions en italique et gras animées.", "Elle inclut des ligatures uniques pour chaque lettre de l'alphabet.", "Elle est principalement reconnue pour ses courbes élégantes.", "Elle est inspirée du style calligraphique traditionnel.", "Elle a été initialement conçue pour les panneaux de signalisation."], "feedback": "La police Arial est adaptée à une utilisation numérique grâce à sa grande lisibilité, même si elle peut également être utilisée pour le design d'identités visuelles complexes, les invitations formelles et les panneaux de signalisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5f01e31af3b049b398126317552f9ae2", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Pour moi, Arial est une police web-safe et sans empattements réussie, simple et efficace. C'est une police polyvalente qui fonctionne pour tous les secteurs d'activité et offre une grande lisibilité, même si elle a été conçue principalement pour une utilisation numérique. La police Geneva est connue pour s'inspirer du style grotesque. Elle est légèrement étroite et est plébiscitée par les grandes marques comme Facebook et Apple (l'entreprise dont elle est issue).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "5161d25144774c9092ef4e27d690ba62", "next_id": null, "prev_id": "d562f923eb3c4ec7bd755624e31f1e41", "associated_block_ids": [], "first_page": 303, "last_page": 304, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de la lisibilité, un concept clé dans la création de panneaux d'exposition et de supports visuels. La question sur la police Arial permet d'aborder l'importance des éléments graphiques et de leur impact sur la communication visuelle, ce qui est en lien direct avec l'objectif pédagogique. Cependant, l'exercice pourrait être amélioré en intégrant des questions qui explorent davantage les autres aspects mentionnés dans la synthèse, comme l'ergonomie ou le design-first. Néanmoins, il reste pertinent et bien ciblé."}, {"exercise": {"id": "2e4690c8ed0e457c984b12c5a4c9dc8a", "question": "Que désignent les micro-espaces blancs dans une conception graphique ?", "answers": ["Les petits espaces/tampons créés autour du contenu pour plus d'aération"], "distractors": ["Les grandes zones vides placées intentionnellement pour guider le lecteur", "Les couleurs claires utilisées pour alléger visuellement une page", "Les lignes invisibles délimitant les paragraphes dans un texte structuré", "Les éléments graphiques utilisés pour attirer l'attention sur le contenu", "Les zones d'ombre ajoutées pour créer un effet de relief", "Les marges de sécurité pour éviter les débordements de texte", "Les espaces réservés pour insérer des images ou des vidéos", "Les interlignes ajustables selon la police choisie pour le texte", "Les bordures entourant chaque section afin de garantir la lisibilité"], "feedback": "Les micro-espaces blancs sont créés autour du contenu pour aérer visuellement la mise en page et éviter un aspect trop chargé. Ils peuvent également être ajustés pour des raisons esthétiques, mais ils sont toujours présents même s'ils ne sont pas voulus.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception graphique, en l'occurrence les micro-espaces blancs, qui sont essentiels pour assurer la lisibilité et l'ergonomie d'un panneau d'exposition. La question permet de tester si l'apprenant saisit l'importance de ces espaces dans la création de supports visuels efficaces. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, comme l'utilisation des éléments graphiques ou le design-first. Il aurait pu être amélioré en intégrant des questions sur d'autres concepts clés tels que l'image ou les composants d'interface utilisateur."}, {"exercise": {"id": "9705a7226b494b009033c21cabddf20d", "query": "La police Helvetica est réputée pour <blank>, ce qui la rend populaire notamment pour retranscrire des textes longs et denses.", "answers": ["sa lisibilité"], "distractors": [["ses complexité", "ses subtilité", "ses rigidité", "ses élégance", "ses singularité", "ses beauté"]], "feedback": "La bonne réponse est 'lisibilité' car Helvetica est principalement reconnue pour la facilité avec laquelle on peut lire les caractères qui la composent. C'est cette qualité qui fait que la police est souvent utilisée pour des textes longs et denses. Les autres termes comme 'complexité', 'subtilité', ou 'élégance' n'ont pas de lien direct avec l'usage principal de la police.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "75bf3e0555244e87883df8a4e922c34c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "La police Helvetica est réputée pour sa lisibilité. Certains la voit comme la police contemporaine la plus populaire, et elle a longtemps été considérée comme efficace pour retranscrire des textes longs et denses. Tous les jours, dans la rue, au bureau, à la maison, nous sommes en contact avec des milliers de caractères typographiques différents. Nous les lisons, nous les écrivons, nous les envoyons. Times, Futura, Helvetica, Mistral, Bodoni, Garamond : ces «sacrés caractères» sont des intimes inconnus que nous fréquentons sans même le savoir. Les polices révèlent les personnalités souvent excentriques et obsessionnelles de leurs créateurs. Sculpteurs, peintres, historiens ou typographes ont consacré des années de leur vie à dessiner des caractères qui, pour certains, leur survivront pendant des siècles.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ada1c2a2beb648628c46076dc4c6b8fa", "next_id": null, "prev_id": "baab71b4f65d45e89cef6fe208c211b8", "associated_block_ids": [], "first_page": 305, "last_page": 307, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un aspect clé de la référence, à savoir la lisibilité, qui est essentielle dans la création de supports de communication visuelle. En se concentrant sur une police spécifique reconnue pour sa lisibilité, l'exercice permet d'évaluer si l'apprenant comprend l'importance de cet élément graphique dans le design des panneaux d'exposition. Cependant, il pourrait être amélioré en intégrant davantage d'éléments liés à l'ergonomie ou à l'organisation de page pour couvrir plus largement les concepts abordés dans la synthèse."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'ergonomie dans la conception de supports visuels, ce qui est un aspect clé de la référence. En demandant à l'apprenant d'affirmer que les éléments ergonomiques doivent être sélectionnés en fonction des usagers, il teste leur capacité à relier les concepts d'ergonomie et d'expérience utilisateur aux choix de design. Cependant, bien que pertinent, cet exercice ne couvre pas directement tous les aspects mentionnés dans la synthèse, comme la lisibilité ou les éléments graphiques. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "63fc6d6be00f486fbc566c553cd77f02", "statement": "Les sites Web minimalistes font souvent usage de typographies complexes et d'une large variété de styles de caractères.", "veracity": false, "feedback": "Les sites Web minimalistes utilisent généralement une typographie simple et une gamme limitée de styles de caractères pour offrir une expérience épurée. L’objectif est de favoriser la lisibilité et éliminer les distractions inutiles, en cohérence avec le principe de réduction des détails.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du principe de simplicité dans le design, qui est un aspect clé de la référence concernant la création de panneaux d'exposition et supports visuels. En demandant à l'apprenant d'évaluer une affirmation sur les sites Web minimalistes, il teste leur capacité à reconnaître l'importance de la lisibilité et de l'utilisation restreinte des éléments graphiques pour créer une expérience utilisateur efficace. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à la conception de panneaux d'exposition ou en abordant spécifiquement les autres concepts mentionnés dans la synthèse, comme l'ergonomie ou les composants d'interface utilisateur."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de lisibilité dans le design d'interfaces, qui sont des éléments clés mentionnés dans la référence. En se concentrant sur l'importance de rendre les fonctions essentielles d'une interface plus visibles, il aborde directement la nécessité d'une conception intuitive et efficace pour améliorer l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être encore plus lié à la création spécifique de panneaux d'exposition ou de supports visuels, ce qui lui empêche d'obtenir un score parfait."}, {"exercise": {"id": "e846ef0159d94e02a46b826e22c81e6b", "question": "Pour améliorer la compréhension d'une interface, que faut-il respecter principalement ?", "answers": ["La hiérarchie visuelle et l'ordre de lecture de l'utilisateur"], "distractors": ["Les polices de caractères artistiques et les animations interactives.", "Les couleurs de fond claires avec des éléments graphiques complexes.", "L'intégration de plusieurs menus déroulants imbriqués.", "L'affichage direct de plusieurs options techniques avancées.", "La quantité maximale d'informations sur une seule ligne.", "L'utilisation d'icônes réduites pour chaque section.", "Le positionnement aléatoire des boutons d'action.", "L'ajout de contenu vidéo en arrière-plan.", "La mise en place d'un menu global en bas de page."], "feedback": "Pour améliorer la compréhension d'une interface, il est important de respecter la hiérarchie entre les éléments visuels et de suivre l'ordre de lecture de l'utilisateur. Cela permet une meilleure compréhension de l'action à effectuer et facilite ainsi son utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de lisibilité, qui sont des éléments clés dans la conception de panneaux d'exposition et de supports visuels. La question cible spécifiquement l'importance de la hiérarchie visuelle et de l'ordre de lecture, ce qui est directement lié à la capacité d'un support à communiquer efficacement avec son audience. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés aux éléments graphiques ou à l'image, afin de couvrir plus largement les thèmes abordés dans la référence."}, {"exercise": {"id": "a89e80f3f1dc43a68ce19fbb0af28b4a", "statement": "L'utilisateur va d'abord trouver le call to action avant de lire le contenu.", "veracity": false, "feedback": "L'utilisateur commence par lire le contenu, puis s'il le souhaite, il entreprendra une démarche pour ensuite trouver le call to action. Le processus suit un ordre logique respectant le sens de lecture et la hiérarchie des éléments de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de lisibilité dans la conception de supports visuels, qui sont des éléments clés mentionnés dans la référence. En questionnant l'ordre logique de lecture et l'interaction utilisateur avec le contenu, il teste la capacité à appliquer ces concepts à un scénario pratique. Cependant, il pourrait être amélioré en intégrant des aspects plus variés du design graphique ou en demandant une application directe sur un projet de panneau d'exposition."}, {"exercise": {"id": "2f9b8c77092542f7b1b9ff425a63a1c1", "statement": "La hiérarchie entre les éléments d'une interface aide à mieux comprendre les actions à réaliser.", "veracity": true, "feedback": "Il est exact que la hiérarchie entre les différents éléments permet une meilleure compréhension des actions à entreprendre. Cette organisation guide l'utilisateur dans son parcours, rendant l'expérience plus fluide et intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de la hiérarchie des éléments d'une interface, ce qui est pertinent pour le contexte de la création de panneaux d'exposition et supports visuels. La hiérarchie est un aspect clé de l'ergonomie et de l'organisation de page, qui sont mentionnés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments spécifiques liés à la conception graphique ou à l'impact visuel des supports, afin d'évaluer plus largement les compétences nécessaires pour réaliser un panneau d'exposition."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension du concept de wireframe, qui est pertinent dans le contexte de la conception de supports visuels et d'ergonomie. Bien que le wireframe ne soit pas spécifiquement mentionné dans la référence, il s'inscrit dans le processus global de création de panneaux d'exposition en tant qu'étape préliminaire pour organiser les éléments graphiques. L'accent mis sur l'organisation des éléments sans se concentrer sur l'aspect visuel reflète bien les thèmes de lisibilité et d'ergonomie abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des questions plus directement liées à la création spécifique de panneaux d'exposition ou à l'utilisation des outils mentionnés comme Figma ou Adobe XD."}, {"exercise": {"id": "98e4a74f235e4dc1a2c1d0fc6551ae85", "query": "Il est important que l'étiquette et son champ soient visuellement <blank>, afin d'éviter toute confusion sur leur relation.", "answers": ["proches"], "distractors": [["séparés", "indépendants", "dissociés", "distants", "espacés", "invisibles"]], "feedback": "L'étiquette doit être visuellement proche de son champ pour que l'utilisateur puisse facilement comprendre qu'ils sont liés. Si l'étiquette est trop distante ou dissociée de son champ, cela peut entraîner une confusion pour l'utilisateur sur la fonctionnalité associée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé évalue la compréhension de l'importance de la proximité visuelle entre une étiquette et son champ, ce qui est en lien avec les concepts d'ergonomie et de lisibilité mentionnés dans la référence. En effet, une bonne conception des interfaces doit garantir que les éléments sont organisés de manière à faciliter la compréhension et l'interaction utilisateur. Cependant, l'exercice se concentre principalement sur un aspect spécifique (la proximité visuelle) sans aborder d'autres éléments clés tels que les composants graphiques ou le design global du panneau d'exposition. Cela limite légèrement sa portée par rapport à l'ensemble des compétences couvertes dans la référence."}, {"exercise": {"id": "f4b28520ee1f4e42b907e9f23a587b75", "query": "Les espaces blancs passifs sont des lacunes qui apparaissent naturellement dans la conception ou la typographie, tandis que les espaces blancs actifs sont ajoutés intentionnellement pour <blank>.", "answers": ["faciliter la lecture"], "distractors": [["améliorer le contraste", "réduire la fatigue oculaire", "remplir les zones vides", "augmenter l'espace visuel", "contrôler l'esthétique", "optimiser la typographie"]], "feedback": "La bonne réponse est 'faciliter la lecture' car les espaces blancs actifs ont pour but explicite de diriger l'attention d'un utilisateur en rendant la page plus facile à parcourir. Ils ne sont pas accidentels mais créés pour améliorer la lisibilité et le flux visuel.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé évalue la compréhension des espaces blancs dans le design, ce qui est pertinent pour la création de panneaux d'exposition et de supports visuels. La notion d'espaces blancs actifs et passifs touche à l'ergonomie et à la lisibilité, deux concepts clés mentionnés dans la synthèse. Cependant, l'exercice se concentre spécifiquement sur un aspect technique (les espaces blancs) sans aborder directement d'autres éléments cruciaux comme les composants graphiques ou l'organisation de page. Cela limite légèrement sa portée par rapport à l'ensemble des compétences nécessaires pour concevoir efficacement un panneau d'exposition. Néanmoins, il reste pertinent et utile pour tester une partie importante des connaissances requises."}, {"exercise": {"id": "aa56f61857f44205a2ba7fef386130a4", "question": "Pourquoi faut-il lier une légende à son image par une relation de structure ?", "answers": ["Pour un traitement unifié par les technologies d'assistance"], "distractors": ["Pour faciliter le téléchargement de l'image", "Pour permettre l'impression de la légende seule", "Afin de rendre l'image plus rapide à charger", "Pour garantir que l'image soit centrée sur la page", "Pour éviter les erreurs dans le code CSS", "Pour accroître la visibilité du texte alternatif", "Pour réduire la taille du fichier HTML", "Pour assurer une mise en page responsive", "Pour améliorer le référencement dans les moteurs de recherche"], "feedback": "Lier la légende d'une image à l'image elle-même permet de traiter l'image et sa légende comme un ensemble unique, facilitant ainsi le traitement par les technologies d'assistance. Cela garantit également que l'image et sa légende soient présentées ensemble et évite tout risque de confusion pour les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité et de la lisibilité dans le design des supports visuels, ce qui est en lien avec les concepts clés de la référence. La question sur la nécessité de lier une légende à son image aborde directement le principe d'ergonomie numérique et d'interaction utilisateur, qui sont essentiels pour concevoir des panneaux d'exposition efficaces. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la conception graphique ou à l'organisation de page, afin de couvrir plus largement les thèmes mentionnés dans la synthèse."}, {"exercise": {"id": "d2cbe17d1e1140bea7fedaf2857cffbd", "statement": "Les micro-espaces blancs sont des espaces créés volontairement pour faciliter la lecture du contenu.", "veracity": false, "feedback": "Les micro-espaces blancs ne sont pas ajoutés intentionnellement pour faciliter la lecture. Ce sont des petits espaces autour du contenu, mais ils diffèrent des espaces blancs actifs qui sont volontairement placés pour guider les yeux du visiteur et améliorer la lisibilité d'une page.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de lisibilité, qui est un élément clé dans la création de panneaux d'exposition et supports visuels. Cependant, il se concentre spécifiquement sur les micro-espaces blancs, ce qui n'est qu'un aspect parmi d'autres de la lisibilité et de l'ergonomie. Bien que cela soit pertinent, l'exercice ne couvre pas suffisamment les autres éléments importants tels que l'utilisation des éléments graphiques ou l'ergonomie numérique. De plus, la formulation de l'affirmation pourrait prêter à confusion pour un apprenant qui pourrait interpréter différemment le rôle des espaces blancs dans le design. Ainsi, bien que pertinent, cet exercice ne teste pas pleinement la compréhension globale des concepts clés liés à la conception de supports de communication."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'ergonomie, qui est la compréhension des usagers, ce qui est pertinent dans le contexte de la conception de supports de communication et d'image. Cependant, il ne couvre pas directement les éléments graphiques, la lisibilité ou la simplicité dans le design, qui sont également des concepts clés mentionnés dans la référence. Bien que l'étude des usagers soit essentielle pour optimiser l'expérience utilisateur, l'exercice pourrait être amélioré en intégrant davantage d'éléments spécifiques à la création de panneaux d'exposition et à leur impact visuel."}, {"exercise": {"id": "7a9a0d8eaaca4a9eacdbd3f5cf15cd73", "query": "Lorsqu'une image est légendée, il est important d'associer la légende de l'image à l'image par une relation de <blank> afin que les technologies d'assistance puissent interpréter correctement cet ensemble.", "answers": ["structure"], "distractors": [["couleur", "signalisation", "marqueur", "contenu visuel", "connexion", "sémantique"]], "feedback": "Il est essentiel de relier une légende à son image par une relation de structure pour que les technologies d'assistance puissent traiter les deux comme un seul élément. Sans cette relation, ces technologies risquent de ne pas comprendre que la légende et l'image sont liées, ce qui pourrait rendre l'information inaccessible.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé évalue la compréhension de la relation entre une image et sa légende, ce qui est pertinent dans le contexte de la création de supports visuels. Cependant, il se concentre principalement sur un aspect technique (la structure) sans aborder d'autres éléments clés mentionnés dans la référence, tels que l'ergonomie, la lisibilité ou l'esthétique du design. Bien qu'il teste une compétence importante pour assurer l'accessibilité des contenus visuels, il ne couvre pas suffisamment les autres concepts essentiels liés à la conception de panneaux d'exposition et de supports de communication. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects nécessaires pour une note plus élevée."}, {"exercise": {"id": "2f426f30fa264f6f94c2b738c0c0a2e0", "question": "Quels textes sont concernés par la mesure de contraste selon les directives ?", "answers": ["Le texte, le texte en image et les sous-titres des vidéos"], "distractors": ["Les icônes et illustrations graphiques", "Le texte dans les arrière-plans d'images", "Les bordures et décorations CSS", "Les zones blanches dans une page web", "Les logos dans les animations", "Les liens hypertextes externes", "Les titres des documents PDF", "Les boutons et menus déroulants", "Les annotations dans les diagrammes"], "feedback": "Les directives de contraste s'appliquent au texte principal ainsi qu'aux textes incrustés dans les images et animations (comme les sous-titres). Ces textes doivent être suffisamment contrastés pour être lisibles, même pour les personnes ayant une déficience visuelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f2b15e9b2aef439686cbd8a9e3eaf4ca", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Note : la pratique qui consiste à gérer des images en propriété de fond d'éléments via CSS est formellement déconseillée, même si elle est accompagnée d'un texte caché. Note : la mesure de contraste concerne le texte, le texte en image, le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos. Pour le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos, la taille de la police doit être mesurée par rapport à la taille d'affichage par défaut (telle qu'affichée). Les textes présents dans les éléments d'une image ou d'une vidéo (par exemple un écriteau, une affiche etc.) ne sont pas concernés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1ab34767803b452ab46a6755582f7b5e", "next_id": "3767e8e96bdf494f8cd8e6b538967a95", "prev_id": "f3447a85d2f14376bd33f7dc7d7e8923", "associated_block_ids": [], "first_page": 94, "last_page": 96, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question du contraste des textes, ce qui est pertinent pour la lisibilité et l'ergonomie dans la conception de supports visuels. Cependant, il se concentre principalement sur un aspect technique (le contraste) sans explorer d'autres éléments clés tels que les éléments graphiques, l'organisation de page ou le design-first mentionnés dans la référence. Bien qu'il teste une compétence importante liée à la création de panneaux d'exposition, il ne couvre pas suffisamment l'ensemble des concepts abordés dans la synthèse."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 16.7, "top_pages": [25, 34], "top_minutes": []}, {"document": {"id": 13704, "label": "QUALITE-WEB-_C3", "authors": [], "title": "Ergonomie Web : Principes et Bonnes Pratiques", "content": [], "mime_type": "application/pdf", "short_summary": "L'ergonomie web vise à améliorer l'expérience utilisateur en rendant les interfaces faciles et confortables à utiliser. Des règles comme la loi de Fitts et la règle des 2 secondes sont essentielles pour optimiser l'interaction entre l'utilisateur et le site.", "long_summary": "- L'ergonomie web adapte les interfaces pour une utilisation facile et agréable.\n- Objectif : améliorer la communication entre l'humain et l'interface.\n- Chaque projet est unique, nécessitant une étude approfondie des utilisateurs.\n- Règle des 2 secondes : un utilisateur ne doit pas attendre plus de 2 secondes pour une réponse du système.\n- La ligne « Fold » : les informations importantes doivent être visibles sans faire défiler la page.\n- Règle de Pareto (80/20) : 20% du contenu satisfait 80% des recherches, prioriser ce contenu dans l'architecture.\n- Loi de Miller : limiter le nombre d'options de navigation à 5-9 éléments pour faciliter le traitement de l'information par l'utilisateur.\n- Loi de Fitts : la taille et la distance des cibles cliquables influencent leur accessibilité, augmentant ainsi les conversions sur un site web.\n- Conseils pratiques incluent supprimer les éléments inutiles, optimiser le chargement des pages, créer une hiérarchie claire, et assurer un bon contraste dans les textes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/63cb3c9_qualite-web-_c3.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Usages : Ergonomie et UX\n===\n\n- L'ergonomie web a pour objectif d'adapter une interface web à ses visiteurs de sorte que son utilisation soit ressentie comme facile, confortable et que ceux-ci aient envie d'y revenir.\n===\n\n- L'ergonomie digitale a pour but l'amélioration de la communication et de l'interaction entre l'humain et une interface.\n===\n\n- La règle des 2 secondes\n===\n\n- Règle de Pareto (80/20)\n===\n\n- Règle de Pareto (80/20)\n===\n\n- La Loi de Miller\n===\n\n- La loi de Fitts\n===\n\n- La loi de Fitts\n===\n\n- Focus : Organisation d'une page\n===\n\n- Activité\n===\n", "number_of_pages": 27, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.7, "top_pages": [1, 2], "top_minutes": []}]}