{"introduction": "La conception d'équipements, de machines ou d'installations nécessite une approche méthodique qui prend en compte les usages et les contraintes spécifiques. Cette synthèse explore divers concepts clés liés à la création et à l'amélioration de produits, en mettant l'accent sur des méthodologies telles que le Design Thinking et l'éco-conception. Ces éléments sont essentiels pour répondre aux besoins des clients tout en intégrant des considérations esthétiques, fonctionnelles et environnementales.", "synthesis": "La première section aborde le processus de conception initiale, où des outils comme le Prototype Mockup et le Wireframing jouent un rôle crucial. Le Prototype Mockup permet de visualiser et tester les idées avant leur développement final, tandis que le Wireframing aide à clarifier la structure d'une interface utilisateur. Ces étapes préliminaires sont essentielles pour s'assurer que les concepts répondent aux attentes du client.\n\nEnsuite, nous explorons la phase de développement des idées qui implique une collaboration étroite avec l'équipe pour approfondir les meilleures propositions. L'Analyse des Besoins du Client et les Questions Essentielles permettent de cerner précisément ce que recherche le client, assurant ainsi que chaque aspect du produit est aligné avec ses attentes. Les Spécifications du produit fournissent également un cadre technique nécessaire pour guider la réalisation.\n\nUne attention particulière est accordée à l'esthétique dans cette phase de conception. L'Esthétique influence non seulement l'apparence visuelle mais aussi l'engagement utilisateur, nécessitant un équilibre entre design attrayant et fonctionnalité efficace. Parallèlement, le Design System assure une cohérence visuelle dans tous les produits développés.\n\nL'éco-conception émerge comme un thème central dans notre synthèse, intégrant des considérations environnementales dès la phase de conception. En minimisant l'impact écologique tout au long du cycle de vie du produit, cette approche favorise un développement durable qui répond aux enjeux contemporains.\n\nEnfin, la réalisation concrète des idées se traduit par une Évaluation rigoureuse qui permet d'affiner les propositions selon des critères spécifiques. La Conception d'Expérience Utilisateur (UX) joue ici un rôle clé en optimisant les interactions entre utilisateurs et produits numériques afin d'améliorer leur satisfaction globale. En somme, ces concepts interconnectés offrent une vue d'ensemble sur comment concevoir efficacement un équipement tout en respectant ses usages et contraintes.", "concepts": [{"concept": {"id": "8c7b17fe-658b-45cc-a0d4-1d71af2d91bf", "label": "Prototype Mockup", "definition": "Un prototype mockup est une représentation visuelle ou interactive d'un produit qui simule son apparence et son fonctionnement réel. Il permet aux utilisateurs de tester des concepts et de fournir des retours avant le développement final. Contrairement à un mockup statique, qui illustre uniquement l'impact visuel sans interactivité, le prototype mockup intègre des éléments de design tout en offrant une expérience utilisateur plus immersive, servant ainsi à démontrer le design et les fonctionnalités potentielles avant la production finale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13683], "aliases": ["4a71ddc6-3b7c-423d-8a1c-69128fe83586", "0b196773-99b7-4918-9cfc-5deb0a101c35", "e74bec6f-5a73-49fd-b5eb-b8046119c179"], "wikientity": {"label": "Mock-up", "definition": "En informatique, le terme mock-up (qui vient du même mot anglais qui signifie une maquette à l'échelle 1:1) désigne un prototype d'interface utilisateur. Un mock-up a ainsi pour rôle de présenter les idées sur l'utilisation d'un logiciel.\nDu point de vue matériel, un mock-up se caractérise par le fait d'être un modèle visuel esthétique, fixe ou sous forme de vidéo, qui peut être modifié aux fins de personnalisation, souvent des textes.", "page_id": "1258223", "wikidata_id": "Q1933427", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le prototype mockup est essentiel pour tester et valider les concepts avant la production finale, ce qui est fondamental dans le processus de conception d'équipements."}, {"concept": {"id": "46418a35-4388-41fc-a035-551226221ba5", "label": "Développement des idées", "definition": "Le développement des idées est la phase où les concepts sélectionnés sont approfondis et affinés grâce à la recherche, aux croquis et aux prototypes. Cette étape implique une exploration détaillée des meilleures idées en collaboration avec l'équipe pour assurer leur concrétisation effective.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": ["1c71f943-b98f-4d1d-bb3e-3703897438d0"], "wikientity": null, "wordnetentity": {"label": "Développement", "definition": "something grown or growing", "name": "growth.n.07", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "'Développement des idées' est central au processus de conception, car il s'agit précisément d'affiner et concrétiser les concepts en tenant compte des usages et contraintes."}, {"concept": {"id": "008d5789-6187-488a-86aa-9faf7453aed1", "label": "Questions Essentielles", "definition": "Interrogations clés posées au client pour clarifier ses besoins et attentes avant le début d'un projet créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les questions essentielles sont fondamentales pour clarifier les besoins du client avant de concevoir un équipement, ce qui en fait un concept central à l'objectif pédagogique."}, {"concept": {"id": "e4515c79-13fd-4349-a049-bb81e6878488", "label": "Ressources nécessaires", "definition": "Les ressources nécessaires incluent tout ce qui est requis pour réaliser un projet, comme le personnel, le matériel et le budget.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Ressources nécessaires' est fondamental pour toute phase de conception d'un équipement car elles déterminent ce qui peut être réalisé selon les usages et contraintes."}, {"concept": {"id": "9c7cbcbd-6820-4fcd-bd00-88a36b11fe80", "label": "Analyse des Besoins du Client", "definition": "Processus d'évaluation des exigences explicites et implicites d'un client afin de fournir des solutions adaptées à ses attentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'analyse des besoins du client est cruciale pour concevoir un équipement adapté aux usages et contraintes spécifiques des utilisateurs."}, {"concept": {"id": "c046e017-bd93-494e-935f-03880b12ef92", "label": "Spécifications du produit", "definition": "Détails techniques et exigences précises concernant un produit ou service demandé par le client.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": {"label": "Spécification (norme technique)", "definition": "Une spécification est un ensemble explicite d'exigences à satisfaire par un matériau, produit ou service. Si un matériau, produit ou service ne parviennent pas à satisfaire à une ou plusieurs des spécifications applicables, il peut être désigné comme étant hors spécification.\nUne spécification technique peut être développée en privé, par exemple, par une société, un organisme de réglementation, ou une organisation militaire, ou bien elle peut être développée par des organismes de normalisation qui sont souvent plus amenés à développer des normes volontaires (ces normes volontaires pouvant devenir obligatoires si elles sont adoptées par un du gouvernement ou un contrat d'entreprise).", "page_id": "79499", "wikidata_id": "Q2101564", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les spécifications du produit fournissent les détails techniques nécessaires pour concevoir un équipement conforme aux attentes du client et aux contraintes techniques."}, {"concept": {"id": "46f98aa1-718b-4130-a429-5e0c698e2f72", "label": "Design Thinking", "definition": "Méthodologie centrée sur l'utilisateur visant à résoudre des problèmes complexes par l'empathie, la définition, l'idéation, le prototypage et le test.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680], "aliases": [], "wikientity": {"label": "Démarche design", "definition": "Une démarche design ou conception créative (en anglais : design thinking) est une méthode de gestion de l'innovation élaborée à l'université Stanford aux États-Unis dans les années 1980 par Rolf Faste.\nCette méthode, qui se veut une synthèse entre pensée analytique et pensée intuitive, relève du design collaboratif, pratique du design qui implique les usagers dans un processus de co-créativité.", "page_id": "7876435", "wikidata_id": "Q1200670", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le Design Thinking est extrêmement pertinent car il met l'accent sur une approche centrée sur l'utilisateur qui est essentielle pour concevoir efficacement un équipement selon ses usages et contraintes."}, {"concept": {"id": "1ef72a7e-5e74-4275-8671-d3b08e7e6482", "label": "Design System", "definition": "Un design system est une bibliothèque standardisée d'éléments graphiques, de composants réutilisables et de règles de branding unifiées, qui assurent la cohérence visuelle et fonctionnelle dans le développement de produits, sites ou applications. Il vise à standardiser le développement et à garantir une expérience utilisateur homogène à travers plusieurs produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13700], "aliases": ["9dbaffae-3852-4454-b66b-2adfc8c61863", "959c321e-cd66-4ef2-beec-74a58976030e"], "wikientity": {"label": "Système de design", "definition": "Un système de design, un système de conception ou un design system est un ensemble de composants réutilisables et de normes claires qui peuvent être assemblés pour créer un nombre illimité d'applications. Les systèmes de design aident à la conception de produits numériques et au développement de produits tels que des applications mobiles ou des sites Web. Ils peuvent contenir, sans toutefois s'y limiter, des bibliothèques de modèles/composants, des dictionnaires de conception, des guides de style (police, couleur, espacement, placement), des composants codés, des langages de marque et de la documentation.", "page_id": "16328891", "wikidata_id": "Q81875083", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Un Design System est très pertinent car il assure la cohérence visuelle et fonctionnelle dans le développement d'équipements, ce qui est crucial pour répondre aux besoins spécifiques des utilisateurs."}, {"concept": {"id": "5de70e87-5ec8-41e0-bed3-9c9a885ac069", "label": "Produit", "definition": "Bien ou service conçu pour répondre aux besoins spécifiques des consommateurs, essentiel dans le mix marketing pour assurer la satisfaction et la fidélité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13676], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Produit", "definition": "items for sale to the individual consumer", "name": "merchandise.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "'Produit' est hautement pertinent car il représente directement l'objet final conçu pour répondre aux besoins spécifiques des consommateurs, au cœur du processus de conception."}, {"concept": {"id": "4de058a8-3e3f-4ded-ace0-e2803ffcd4a2", "label": "Phase de Veille", "definition": "Étape préliminaire où le designer s'informe sur l'univers du client pour mieux comprendre ses valeurs et son marché avant de créer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La phase de veille est très pertinente car elle permet au designer de comprendre les besoins et contraintes du client avant de concevoir un équipement adapté."}, {"concept": {"id": "5792c744-4854-454e-8f87-ec4f5ccf2582", "label": "Éco-conception", "definition": "L'éco-conception est une approche de design qui intègre des considérations écologiques et les enjeux environnementaux dans la conception de produits ou services, y compris le développement durable dans la création de sites web. Elle vise à minimiser l'impact environnemental tout au long du cycle de vie des produits ou services, en équilibrant durabilité, faisabilité technique et performance visuelle et économique, tout en cherchant spécifiquement à réduire l'empreinte écologique des plateformes numériques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689, 13705, 13707, 13710], "aliases": ["38fcc5fa-1e9a-4c59-aae0-84056f944879", "609f9dc6-35e8-4391-930d-0357b9e53ae7", "dfc96dcc-97c8-4069-b1a1-dfbb8ca41f8a", "05a8aba3-d572-485a-b33a-17449f7e81db", "4e4dabed-3dd1-4b7f-a965-da4f5c53ce5d"], "wikientity": {"label": "Écoconception", "definition": "L’écoconception est la volonté de concevoir des produits respectant les principes du développement durable et de l'environnement, en — selon l'Ademe — recourant « aussi peu que possible aux ressources non renouvelables en leur préférant l'utilisation de ressources renouvelables, exploitées en respectant leur taux de renouvellement et associées à une valorisation des déchets qui favorise le réemploi, la réparation et le recyclage », dans un contexte qui évoluerait alors vers une économie circulaire.\nLa définition officielle qui fait foi pour l'ADEME est la suivante : « C’est une démarche préventive et innovante qui permet de réduire les impacts négatifs du produit, service ou bâtiment sur l’environnement sur l’ensemble de son cycle de vie (ACV), tout en conservant ses qualités d’usage. »\nÀ partir de celle-ci, on peut en effet décliner d'autres formulations ou déclinaisons.", "page_id": "3967563", "wikidata_id": "Q795082", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'éco-conception est hautement pertinente car elle intègre des considérations écologiques dans le design, ce qui est crucial lors de la conception d'équipements durables et responsables."}, {"concept": {"id": "e3db3cdb-5474-48f7-833c-0bdae33ed61a", "label": "Dossier d'Exécution", "definition": "Document technique détaillant les spécifications et les éléments nécessaires à la réalisation d'un projet, crucial pour assurer sa bonne mise en œuvre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": {"label": "Dossier des ouvrages exécutés", "definition": "Le dossier des ouvrages exécutés, ou DOE, est un document contractuel de la construction immobilière en France.", "page_id": "3606988", "wikidata_id": "Q3037354", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le dossier d'exécution est crucial pour la mise en œuvre d'un projet, car il détaille les spécifications nécessaires à la réalisation de l'équipement selon ses usages et contraintes."}, {"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'esthétique joue un rôle crucial dans la conception d'équipements, car elle influence l'attrait visuel et l'engagement des utilisateurs tout en devant être équilibrée avec la fonctionnalité."}, {"concept": {"id": "f1ab6b4e-ff62-4372-988c-6d4c7f225258", "label": "Collecte et synthèse", "definition": "Étape finale de compilation des idées générées pour identifier celles qui sont pertinentes pour le processus créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La collecte et synthèse des idées est une étape clé dans le processus créatif qui aide à définir les usages et contraintes lors de la conception d'un équipement."}, {"concept": {"id": "90da4202-90b8-4ca5-8958-1e7d343da9ff", "label": "Veille", "definition": "Phase d'observation et d'analyse des tendances et facteurs externes influençant un projet, essentielle pour une compréhension approfondie du brief.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Veille", "definition": "exploring in order to gain information", "name": "scouting.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La veille est essentielle pour comprendre les tendances et les besoins du marché lors de la conception d'un équipement, ce qui en fait un concept hautement pertinent par rapport à l'objectif pédagogique donné."}, {"concept": {"id": "4752ada0-b3bc-480a-b0d2-15bee717abf1", "label": "Améliorations de produit", "definition": "Modifications apportées à un produit existant pour mieux répondre aux besoins des clients ou se démarquer sur le marché.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les améliorations de produit sont centrales à l'objectif de concevoir et améliorer un équipement en répondant mieux aux besoins des utilisateurs."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le wireframing est très pertinent car il s'agit d'une étape clé dans la conception d'interfaces qui peut également s'appliquer à l'équipement en visualisant les fonctionnalités essentielles avant le développement."}, {"concept": {"id": "428549b4-6b1b-49f2-afdf-65890ef5cd30", "label": "Atomic Design", "definition": "L'atomic design est une méthode systématique de conception d'interface qui décompose les interfaces en composants plus petits et réutilisables, permettant ainsi une construction modulaire, évolutive et favorisant une meilleure cohérence visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13680], "aliases": ["0164746b-3388-423b-a975-eb1cb6dcd3b7"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'Atomic Design est pertinent car il s'agit d'une méthode de conception qui favorise la modularité et l'adaptabilité des équipements, ce qui est essentiel pour concevoir un équipement selon ses usages et contraintes."}, {"concept": {"id": "a483e3d5-3d71-4891-9b1b-82594ebc0416", "label": "Performance écologique", "definition": "Dimension du design qui se concentre sur la minimisation de l'impact environnemental lors de la production et de l'utilisation des éléments graphiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La Performance écologique est très pertinente dans le contexte actuel où la durabilité et l'impact environnemental sont des considérations importantes lors de la conception d'équipements."}, {"concept": {"id": "376d95b1-05d3-4b9f-900a-5d6b1ab40030", "label": "Réalisation", "definition": "Mise en œuvre concrète des idées sélectionnées, impliquant compétences techniques pour créer un produit ou une œuvre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Réalisation", "definition": "the action of accomplishing something", "name": "accomplishment.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La réalisation est essentielle pour concevoir un équipement, car elle implique la mise en œuvre des idées et l'utilisation de compétences techniques nécessaires à la création d'un produit fonctionnel."}, {"concept": {"id": "0e2b76bd-fa95-4a2e-9aa6-621ca5664d4c", "label": "Évaluation", "definition": "Processus d'analyse des idées développées selon des critères spécifiques pour affiner et améliorer les propositions.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'évaluation est cruciale pour affiner les idées développées et s'assurer qu'elles répondent aux usages et contraintes identifiés lors du processus de conception."}, {"concept": {"id": "681bd960-0547-4e06-81c7-c87e899af05b", "label": "Conception et design web", "definition": "La conception et le design web désignent le processus de création d'interfaces numériques qui allient esthétique et fonctionnalité pour optimiser l'expérience utilisateur. Cela inclut la conception de l'interface utilisateur, l'intégration des éléments du site de manière accessible et fonctionnelle, ainsi que la prise en compte des palettes de couleurs et des tendances modernes telles que la commande vocale et le mode sombre. L'objectif est de rendre les sites non seulement attrayants mais aussi faciles à naviguer, répondant ainsi aux besoins contemporains des utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13692], "aliases": ["408a71e5-2328-4efc-b763-2f6ddd50204c", "b73e3b1f-6972-406b-82f8-69acf4925e52", "e970bfbc-ec61-4fbe-a66a-e65a0ad0ba8c", "4384a27b-4e99-442c-bbc8-dfa1980e56fe", "dec0a245-63b1-4b4c-bce7-12be12f6d362"], "wikientity": {"label": "Conception de site web", "definition": "La conception  et la création site web ou web design est la conception de l'interface web : l’architecture interactionnelle, l’organisation des pages, l’arborescence et la navigation dans un site web. La conception d'un design web tient compte des contraintes spécifiques du support Internet, notamment en matière d’ergonomie, d’utilisabilité et d’accessibilité.\nLe web design réclame donc des compétences en programmation, en ergonomie et en interactivité, ainsi qu'une bonne connaissance des contraintes techniques liées à ce domaine.", "page_id": "807249", "wikidata_id": "Q190637", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La conception et le design web sont très pertinents car ils englobent des principes essentiels pour créer des interfaces utilisateurs efficaces qui peuvent être appliqués à divers équipements numériques."}, {"concept": {"id": "baebe016-d0cc-4e32-9346-f7e1124193a3", "label": "Conception d'Expérience Utilisateur (UX)", "definition": "La conception d'expérience utilisateur (UX) est une discipline centrée sur l'optimisation des interactions entre les utilisateurs et les produits ou services numériques. Elle vise à améliorer la satisfaction et l'efficacité de l'utilisation en créant des interfaces utilisateur intuitives et attrayantes, tout en tenant compte des comportements, besoins cognitifs et préférences des utilisateurs finaux. Ce processus englobe à la fois l'esthétique et la fonctionnalité, influençant ainsi l'expérience globale par des choix visuels et structurels. Les professionnels tels que les designers UX et UI travaillent à établir des interactions significatives, simplifiant l'interaction utilisateur tout en gérant la complexité sous-jacente du système.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13609, 13709], "aliases": ["dbb0eb49-384a-4835-8a27-f3df10e75759", "91010b14-36ae-419d-bf38-a846de1275f6", "574e83b8-4354-48fa-850e-93c5120ebc83", "ecf19b49-88ec-4c4c-a1b6-95ffa690e97f", "25934ed3-33c1-4498-8e65-074291667094", "796f5e0a-7a74-4541-adfb-b2193ad73b61", "a23c6da5-a4ab-4891-991e-7b937aa0abdc", "37ee1509-2635-464b-9584-a9b0c9d9c8ad", "c00973e6-b1c9-4905-942b-5be484cb15c3", "d4bcea8d-2203-4129-9886-2b5a3d013def", "10afcc11-a32f-4ff7-b2c9-b91fd8f41279", "bfa65925-0083-4475-bf52-1b49b880a8ef", "172c8581-4218-4949-9879-3623e9c81b76", "84c2a388-034d-4adb-8881-3d024eed3a5c", "54158781-d4d4-4026-a63f-e0e8693a8902", "9f681d3a-0c7c-4485-9bcf-e52381ff9719", "da83989a-f0e2-4e84-b8e1-dbb6cfe0e312"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La conception d'expérience utilisateur (UX) est très pertinente car elle vise à optimiser les interactions avec un produit ou service, ce qui est essentiel lors de la création d'un équipement adapté aux utilisateurs finaux."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'expérience utilisateur et client est également très pertinente puisqu'elle englobe les émotions et réactions des utilisateurs face à un produit, influençant ainsi sa conception selon ses usages."}, {"concept": {"id": "783fc253-47e6-4a8c-90f5-bb9685af922a", "label": "Créativité", "definition": "La créativité est la capacité d'innover et de générer des idées nouvelles et originales, essentielle dans divers domaines tels que le design, l'innovation, la communication et l'expression personnelle. Elle joue un rôle crucial dans le processus de résolution de problèmes et de brainstorming pour encourager des solutions innovantes. La créativité est souvent stimulée par des routines ou des rituels personnels qui favorisent l'inspiration, permettant ainsi aux individus et aux équipes de se démarquer dans un environnement compétitif et d'influencer l'évolution personnelle et collective.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13678, 13680, 13697], "aliases": ["99d2e36f-7c1f-4f40-8455-567a1ad51be8", "34bc1095-ddb4-4015-b587-6bbb36b1deb9", "25694a9a-9fe7-40fe-b771-45e604b659c3", "12578152-d3bc-4284-ad1d-5d995e291f7e", "86cf7c37-95e2-421a-8f6d-881f391a3bbd"], "wikientity": {"label": "Créativité", "definition": "La créativité est — de façon générale — la capacité d'un individu ou d'un groupe d'individus ou d'êtres non-humains à imaginer et mettre en œuvre un concept neuf, un objet nouveau, à combiner des idées existantes ou à découvrir une solution originale à un problème. Elle combine donc deux dimensions : imagination et efficacité et passe par un processus complexe et encore mal compris de « fluidité idéationnelle », qui peut être appris via l'éducation, et qui pourrait avoir des bases génétiques.\nElle peut être plus précisément définie comme « un processus psychologique ou psycho-sociologique par lequel un individu témoigne d'imagination et d'originalité dans la manière d'associer des choses, des idées, des situations et — par la publication du résultat concret de ce processus — change, modifie ou transforme la perception, l'usage ou la matérialité de quelque chose auprès d'un public donné[réf.", "page_id": "212286", "wikidata_id": "Q170658", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Créativité", "definition": "the ability to create", "name": "creativity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La créativité est essentielle dans le processus de conception d'équipements, car elle permet d'innover et de trouver des solutions adaptées aux usages et contraintes spécifiques."}, {"concept": {"id": "dadb4cae-ecdd-4562-ad1c-c4f863b80368", "label": "Design digital", "definition": "Discipline qui englobe la création d'éléments visuels et de contenus numériques, incluant l'interface utilisateur (UI) et l'expérience utilisateur (UX), intégrant esthétique et fonctionnalité tout en influençant l'expérience utilisateur et le marketing moderne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696, 13699, 13701], "aliases": ["37366e80-dc38-4858-88b6-e28fcdd1db5d", "b664875f-3175-4572-8451-a28607cf63e8", "a1e23201-bb06-4457-b988-61590e500cb9"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le design digital est très pertinent car il englobe des aspects cruciaux comme l'interface utilisateur et l'expérience utilisateur, qui sont essentiels lors de la conception d'équipements modernes."}, {"concept": {"id": "a99118f8-3d0e-4517-88a1-b6e4a98947bc", "label": "Collaboration dans le développement logiciel", "definition": "La collaboration dans le développement logiciel désigne le processus par lequel plusieurs individus ou équipes, y compris les équipes de développement et d'exploitation, interagissent étroitement pour atteindre des objectifs communs. Ce partenariat actif favorise une responsabilité partagée pour les livraisons logicielles et améliore la compréhension mutuelle, permettant ainsi de résoudre rapidement les problèmes. La collaboration implique un échange d'idées enrichissant, facilitée par des outils numériques, qui transforme les relations traditionnelles en un environnement d'innovation et de partage. Elle se caractérise également par une interaction continue entre membres d'une équipe, favorisant le partage de code et la résolution rapide des conflits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697, 13698, 13639, 13609, 13642, 13644, 13679], "aliases": ["6b2d0d61-bbc2-483a-9010-65679e414f4e", "67c9c2cc-8f9b-438a-9473-51116617429e", "baeae1c8-e8b7-4df0-a247-1b2fbcc50f47", "fa6521ce-6e4a-4aa4-b28b-2b80db1c075a", "795c3c40-5626-4e38-93f5-187486671c03", "300b92cd-5329-4dda-8ecb-d8f1026344e4", "552493e2-b80a-4ed6-a462-ffd54ddeb69a", "0a19e2ae-f21e-40e1-93a8-51f1b84ba106"], "wikientity": {"label": "Collaboration", "definition": "La collaboration est l'acte de travailler ou de réfléchir ensemble pour atteindre un objectif. \nDans son sens commun, la collaboration est un processus par lequel deux ou plusieurs personnes ou organisations s’associent pour effectuer un travail  intellectuel suivant des objectifs communs.\nDes méthodes structurées de collaboration encouragent l'introspection de comportements et communication.", "page_id": "1104659", "wikidata_id": "Q1145523", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Collaboration", "definition": "a cooperative relationship between people or groups who agree to share responsibility for achieving some specific goal", "name": "partnership.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La collaboration dans le développement logiciel est très pertinente car elle favorise une approche collective pour concevoir et améliorer des équipements en tenant compte des besoins variés des utilisateurs."}, {"concept": {"id": "8995d1ba-6deb-4865-91a8-8aafbfe06f2e", "label": "Création", "definition": "Processus de conception et de développement d'idées originales ou de produits, souvent lié à l'art, au design graphique et digital, ainsi qu'à l'innovation technique dans divers domaines. Ce processus implique créativité et innovation pour créer des visuels impactants et répondre aux besoins des clients.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696, 13699, 13701], "aliases": ["7a5659cd-6b9e-40b7-956a-63df5c07c263", "50ae0ae3-b8c0-48f3-ba21-f9d2645571ab", "37281b9b-304c-466d-a4dd-b22491ef6b35"], "wikientity": null, "wordnetentity": {"label": "Création", "definition": "the act of forming or establishing something", "name": "constitution.n.04", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La création est essentielle dans le processus de conception d'équipements, car elle implique l'innovation et le développement d'idées qui répondent aux besoins spécifiques des utilisateurs."}, {"concept": {"id": "d49ca571-1985-46c8-a1ee-1a21d7b40165", "label": "Finalisation", "definition": "Étape finale dans le processus de création où les détails sont peaufinés avant la livraison ou la mise en œuvre du produit final.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696], "aliases": ["3216d7fb-388c-4939-9510-87d2bb0f74db"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Finalisation' est une étape clé dans le processus de création où les détails sont peaufinés avant mise en œuvre, ce qui est essentiel pour garantir que l'équipement répond aux usages et contraintes."}, {"concept": {"id": "5a492283-28dd-4d14-8919-becc43892c23", "label": "Retour Client", "definition": "Les retours clients, ou retour client, désignent les commentaires et évaluations fournis par les clients sur leur expérience avec un produit ou service. Ces retours sont cruciaux pour ajuster et améliorer l'offre d'une entreprise afin de mieux satisfaire la demande et répondre aux attentes des consommateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13694], "aliases": ["c9784dc3-1ae7-4c97-aa85-6473f55f13ac"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le retour client est essentiel pour concevoir et améliorer un équipement selon les usages et contraintes, car il permet d'ajuster les produits aux attentes des utilisateurs."}, {"concept": {"id": "e4ae9c09-4ec8-4a59-9314-2e4c0c931e9b", "label": "Mise en page", "definition": "La mise en page (ou MEP) désigne le processus d'arrangement visuel des éléments graphiques et textuels sur une page, qu'elle soit imprimée ou numérique. Elle est essentielle pour l'expérience utilisateur sur un site web et dans d'autres supports visuels, car elle influence la lisibilité, l'esthétique, l'impact visuel et la clarté du message transmis ainsi que l'interaction avec le contenu. La MEP assure également une présentation cohérente et esthétique des documents.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13684, 13687, 13689], "aliases": ["2820af73-3b5d-4571-87ad-2c8b3b35023a", "d1811778-06d3-4715-acd2-6d6f55007f2b", "529c12dc-31c1-4106-b66d-787089356057", "1de5e449-7a2f-4249-a3c9-00fca42a6ccb"], "wikientity": {"label": "Mise en page", "definition": "La mise en page, ou mise en pages, est l'opération de disposition graphique d'un contenu informationnel dans un espace donné (feuille de papier, planche de bande dessinée, pages web, etc.).\nElle succède au travail de collecte et de composition du contenu (composition de texte « au kilomètre », collection des composants) et précède souvent le travail d'impression. Elle peut le précéder dans la mesure où elle est prédéfinie (dimensions des colonnes, styles du texte, placement des illustrations, etc.).", "page_id": "400658", "wikidata_id": "Q868954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La mise en page est essentielle pour l'expérience utilisateur et peut influencer la conception d'équipements en termes de présentation et d'interaction, ce qui en fait un concept pertinent."}, {"concept": {"id": "d80ccc04-eb0f-4956-816e-4bdf2d92611e", "label": "Idéation", "definition": "Étape de génération d'idées où la créativité est encouragée sans jugement, souvent par des techniques comme le brainstorming.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": {"label": "Idéation", "definition": "L'idéation est le processus créatif de production, développement, et communication de nouvelles idées ; le terme idée signifie ici un élément de base de la pensée, ou plutôt de la vie psychique en général, qui peut être aussi bien sensoriel ou concret qu'abstrait. Formation à l’enchaînement idée.\nL'idéation comprend tous les stades d'un processus de pensée original, de l'innovation au développement de l'idée et jusqu'à son achèvement.", "page_id": "2728205", "wikidata_id": "Q17039022", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'idéation est très pertinente car elle fait partie intégrante du processus de conception, permettant de générer des idées innovantes pour répondre aux usages et contraintes d'un équipement."}, {"concept": {"id": "e7135db8-6662-4cf1-a1eb-f53f50d8cb30", "label": "Évaluation des coûts", "definition": "Analyse des dépenses liées à un projet, incluant matériaux et main-d'œuvre, pour assurer la viabilité financière.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'évaluation des coûts est importante pour assurer que le projet reste viable financièrement tout en répondant aux exigences de conception."}, {"concept": {"id": "4ea86225-9e30-4861-95f0-0ae6616673ad", "label": "Bonnes pratiques UI", "definition": "Des recommandations pour optimiser l'utilisation des couleurs et autres éléments graphiques afin d'améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les bonnes pratiques UI sont pertinentes car elles peuvent influencer la manière dont un équipement est conçu pour optimiser l'expérience utilisateur, même si elles se concentrent généralement sur les interfaces numériques."}, {"concept": {"id": "6f331ec9-8301-4698-be14-1c6426cb04e9", "label": "Techniques de Production", "definition": "Méthodes utilisées pour réaliser des projets graphiques, incluant les normes prépresse et les fichiers de fabrication adaptés aux différents supports.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les Techniques de Production sont pertinentes car elles englobent les méthodes nécessaires pour réaliser efficacement un équipement tout en respectant les normes requises."}, {"concept": {"id": "2414d865-830b-4ca5-a094-d8217f6b09f0", "label": "Human Problems", "definition": "Défis ou besoins rencontrés par les individus que les entreprises cherchent à résoudre grâce à des solutions technologiques innovantes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les Human Problems sont pertinents car comprendre les défis rencontrés par les utilisateurs peut guider la conception d'un équipement plus adapté à leurs besoins."}, {"concept": {"id": "02ad06b9-5b33-4a60-b142-c8c37eb3a4f3", "label": "Performance économique", "definition": "Aspect du design éco-brandé qui cherche à optimiser les coûts tout au long du processus de création et de diffusion.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La performance économique est pertinente car optimiser les coûts est crucial lors de la conception d'équipements, bien qu'elle ne soit pas le seul facteur à considérer."}, {"concept": {"id": "03321d7f-4bf6-4cea-a288-0db13fbe9a0f", "label": "Design concurrentiel", "definition": "Analyse du design utilisé par les concurrents afin d'informer et d'améliorer ses propres stratégies visuelles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le design concurrentiel est pertinent car il permet d'analyser les équipements existants sur le marché et d'informer la conception en fonction des besoins identifiés."}, {"concept": {"id": "b73d77d1-523f-4328-a45c-d7b91e2a52ff", "label": "Méthode de l'entonnoir", "definition": "Technique de collecte d'informations pour clarifier un projet, facilitant la compréhension et la communication des idées créatives.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La méthode de l'entonnoir est pertinente car elle aide à clarifier les besoins et contraintes d'un projet, ce qui est essentiel pour concevoir un équipement adapté."}, {"concept": {"id": "fc042f14-b979-4769-b475-11f6e6d65c88", "label": "Devis", "definition": "Document formel détaillant les coûts estimés et les conditions d'un projet ou service proposé, essentiel pour établir un accord entre le fournisseur et le client tout en assurant la transparence financière.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": ["033b1778-246d-48ac-9b0b-256f48cbda20"], "wikientity": {"label": "Devis", "definition": "Un devis est un document écrit par lequel un fournisseur ou un prestataire de services propose un prix pour un bien ou un service.\nPlus précisément, un \"devis\" est un document détaillé qu'un prestataire de services ou un vendeur propose à son client potentiel avant l'exécution d'un travail ou la livraison de produits. Ce document inclut généralement une description précise des services ou produits offerts, avec leur quantité et le prix unitaire, aboutissant à un total général que le client devrait payer si les conditions sont acceptées.", "page_id": "3164773", "wikidata_id": "Q940607", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le devis est important pour établir un accord financier concernant un projet, mais il n'aborde pas directement les aspects techniques ou créatifs de la conception d'équipements."}, {"concept": {"id": "2237b39e-574d-4342-8a5e-c2a7ff5e7bf8", "label": "Principes du design", "definition": "Règles fondamentales qui guident la création visuelle, incluant lisibilité, accessibilité et cohérence pour une communication efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les principes du design sont essentiels pour concevoir des équipements fonctionnels et esthétiques, ce qui est directement lié à l'objectif de conception selon les usages."}, {"concept": {"id": "03d2748a-1d6c-4f0e-b222-ff00e6a4e589", "label": "Valeur ajoutée", "definition": "La valeur ajoutée se réfère aux caractéristiques uniques d'un produit ou service qui le distinguent de la concurrence, augmentant ainsi son attrait pour les clients.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": {"label": "Valeur ajoutée", "definition": "La valeur ajoutée est une notion des domaines fiscaux et comptable, ainsi que dans l’ingénierie industrielle, où elle permet de spécifier les résultats des opérations de transformation ainsi que d'évaluer et de faire évoluer la conception de produits. Elle s'inscrit en particulier dans l'analyse de la valeur.\nSelon l'INSEE, la valeur ajoutée se définit ainsi : « Solde du compte de production.", "page_id": "74026", "wikidata_id": "Q1434924", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La valeur ajoutée est pertinente car elle se rapporte aux caractéristiques distinctives qui peuvent influencer la conception et l'attrait d'un équipement sur le marché."}, {"concept": {"id": "94ceb899-3421-42f7-a5b0-f97af5b3441a", "label": "UI KIT", "definition": "Un ensemble d'éléments graphiques standardisés pour assurer la cohérence visuelle d'un site web, facilitant l'évolution de l'identité visuelle existante.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un UI KIT peut aider à assurer une cohérence visuelle lors de la création d interfaces pour équipements, ce qui lui confère une certaine pertinence dans le contexte donné."}, {"concept": {"id": "34e43b52-e36b-47cb-b2a6-1d1268bed8d6", "label": "Brainstorming", "definition": "Le brainstorming est une technique collaborative de créativité qui vise à générer un grand nombre d'idées nouvelles en peu de temps, souvent utilisée en groupe pour explorer diverses directions dans un projet. Cette méthode favorise l'expression libre et la créativité sans jugement, permettant ainsi l'émergence de concepts variés. Elle est essentielle pour affiner le choix d'un nom ou d'une stratégie et joue un rôle clé dans le développement d'innovations.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697, 13677, 13679], "aliases": ["cfb61b88-c683-481a-b072-61853f09d5dd", "ed7be01e-ffb2-4143-be35-538f1f22daee", "f823416b-9d9f-4023-912d-5600fed8b3e1"], "wikientity": {"label": "Brainstorming", "definition": "Un brainstorming ou remue-méninges (ou remue-méninge) est une technique formalisée de résolution créative et collective de problème. Elle fut élaborée à partir de 1940 par Alex Osborn.", "page_id": "1455223", "wikidata_id": "Q191183", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Brainstorming", "definition": "a group problem-solving technique in which members spontaneously share ideas and solutions", "name": "brainstorming.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "'Brainstorming' est pertinent car il permet de générer des idées innovantes pour concevoir un équipement adapté aux usages et contraintes identifiés."}, {"concept": {"id": "3898834d-4869-40af-9c13-784f85193239", "label": "Diagnostic", "definition": "Un diagnostic dans le contexte commercial fait référence à l'analyse approfondie des besoins d'un client, permettant de formuler des recommandations adaptées pour atteindre ses objectifs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le diagnostic est pertinent car il permet d'analyser les besoins des utilisateurs pour concevoir un équipement adapté, bien qu'il ne soit qu'une étape du processus global."}, {"concept": {"id": "bf9dcd29-03f3-4cd8-a076-8331895e019d", "label": "KPI (Indicateurs Clés de Performance)", "definition": "Les KPI, ou Indicateurs Clés de Performance, sont des mesures quantifiables utilisées pour évaluer le succès et l'efficacité d'un produit, service ou stratégie marketing. Ils jouent un rôle essentiel dans le suivi des performances des équipes, notamment dans les objectifs DevOps, en facilitant la prise de décisions éclairées et en permettant d'ajuster les actions si nécessaire.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676, 13644], "aliases": ["87e70941-61ac-4056-9449-16f5a2eb30de", "73f1aa64-cede-40bc-b84c-46a66b3d5549"], "wikientity": {"label": "Indicateur clé de performance", "definition": "Un indicateur clé de performance (ICP) – en anglais : key performance indicator (KPI) – est un indicateur utilisé pour l'aide à la décision dans les organisations. Les ICP sont utilisés particulièrement en gestion de la performance organisationnelle.", "page_id": "1432151", "wikidata_id": "Q860554", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Les KPI sont importants pour évaluer l'efficacité des équipements conçus et peuvent aider à ajuster les processus de conception en fonction des performances observées."}, {"concept": {"id": "ec8e7214-c2d2-4b69-bf1a-b572d9bcb7d3", "label": "Palette de couleurs", "definition": "Une palette de couleurs est un ensemble harmonieux et spécifique de teintes sélectionnées pour être utilisées dans l'identité visuelle d'une marque, le design d'un site web ou d'autres projets créatifs. Elle joue un rôle crucial dans la création d'une expérience utilisateur positive, influence la perception émotionnelle et psychologique des consommateurs, évoque des émotions et contribue à la perception globale de la marque auprès de son audience, tout en impactant également le comportement des consommateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13677, 13691], "aliases": ["2c29fcba-baa1-40e2-9664-fb835fd21aef", "cfd47ccb-a8d5-4e47-8d1a-2f4ca7323766", "d2ec4843-1099-46ea-a483-9b24b49d6d8e", "78786962-1a00-45d5-9662-efcbf8a722a6", "a3483a35-be74-4313-8b80-3af473ca1d09"], "wikientity": {"label": "Palette de couleurs", "definition": "En infographie, une palette de couleurs est un ensemble fini de couleurs stocké servant à l'affichage d'images numériques.\n\nVoici les utilisations les plus courantes de l'expression « palette de couleurs » en informatique :\n\nl'ensemble des couleurs qu'un système est capable de générer ou de gérer (selon les limitations de mémoire vidéo, il est possible qu'il ne puisse pas les afficher toutes en même temps) :\npar exemple, on dit des systèmes d'affichage de type Highcolor qu'ils ont une palette RVB 16 bits, c'est-à-dire qu'ils sont potentiellement capables d'afficher 65 536 couleurs différentes (en tout) ;\nla sélection de couleurs qui peut être affichée simultanément :\nsoit sur l'écran entier :\nsoit à l'aide d'une palette fixe : un terminal d'affichage donné peut offrir un choix de couleurs prédéterminés, en sélectionnant une palette parmi celles établies à l'avance par le constructeur. Le choix d'une de ces palettes se fait en plaçant les bonnes valeurs dans les registres électroniques du matériel.", "page_id": "244810", "wikidata_id": "Q2357944", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La palette de couleurs peut jouer un rôle important dans l'identité visuelle d'un produit conçu, influençant son attrait esthétique et émotionnel auprès des utilisateurs, bien qu'elle ne soit pas au cœur du processus fonctionnel."}], "exercises": [{"exercise": {"id": "e272bed138e8447394ad8396b46b85da", "question": "Quels éléments sont pris en compte lors de l'évaluation des idées développées?", "answers": ["Les objectifs, les contraintes et les critères spécifiques du projet"], "distractors": ["Les tendances générales du marché et des concurrents directs", "L'impact environnemental global et sociétal du produit", "Les préférences du public cible et son budget moyen", "Les exigences légales et techniques générales de production", "Les délais de livraison et les capacités logistiques attendus", "La conformité aux normes industrielles internationales", "La faisabilité de la commercialisation sur le long terme", "Le potentiel d'exportation et la compatibilité multiculturelle", "Les attentes des sponsors et des partenaires commerciaux"], "feedback": "L'évaluation des idées développées comprend la prise en compte des objectifs du projet, des contraintes techniques et budgétaires, ainsi que des critères spécifiques tels que la faisabilité, la compatibilité multiculturelle et le potentiel d'exportation. Ces éléments permettent de sélectionner les meilleures idées qui répondront aux exigences du projet et pourront être commercialisées avec succès.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des éléments clés à prendre en compte lors de l'évaluation des idées développées dans le cadre de la conception d'un équipement. Il fait référence aux objectifs, contraintes et critères spécifiques du projet, qui sont directement liés à la capacité de concevoir un produit répondant aux usages et contraintes mentionnés dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments sur l'éco-conception ou l'esthétique, qui sont également des aspects importants abordés dans la synthèse."}, {"exercise": {"id": "9787e4cf33a44e10828060c871cbdbdc", "question": "Que peut inclure le développement des idées après leur sélection?", "answers": ["La réalisation de prototypes ou l'expérimentation avec différents matériaux"], "distractors": ["L'élaboration d'un calendrier détaillé pour la production", "Le recrutement d'une équipe dédiée à la fabrication", "La création d'un budget prévisionnel complet", "La définition des objectifs de vente du projet", "L'analyse des risques financiers associés au projet", "L'évaluation des tendances actuelles du marché", "La formation continue des équipes créatives", "Le développement d'une campagne publicitaire spécifique", "La mise en place d'un suivi de post-production"], "feedback": "Lorsque les idées sont sélectionnées, elles sont ensuite développées en détail afin de répondre aux objectifs et contraintes du projet. Cela peut inclure la réalisation de prototypes ou l'expérimentation avec différents médias ou matériaux, qui sont tous des éléments nécessaires pour s'assurer que l'idée final est réalisable et répond aux exigences du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des étapes de développement des idées après leur sélection, ce qui est pertinent par rapport à la référence sur la conception d'équipements selon leurs usages et contraintes. La réponse correcte mentionne la réalisation de prototypes et l'expérimentation avec différents matériaux, deux aspects cruciaux du processus de conception abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à l'analyse des besoins du client ou à l'éco-conception, qui sont également des thèmes centraux dans le contexte donné."}, {"exercise": {"id": "d26ff603d732470c83c52a9b3dec2af2", "statement": "Les idées développées peuvent faire l'objet de plusieurs itérations pour s'assurer qu'elles remplissent les critères du projet.", "veracity": true, "feedback": "Cette affirmation est correcte. Les idées sont explorées à travers différentes variations et itérations, et elles subissent des ajustements nécessaires pour répondre aux objectifs et contraintes du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du processus de conception, en particulier l'importance des itérations dans le développement d'idées pour s'assurer qu'elles répondent aux critères du projet. Cela est en adéquation avec la référence qui souligne la nécessité d'améliorer un équipement selon ses usages et contraintes. Cependant, l'exercice pourrait être renforcé en intégrant des éléments spécifiques liés à l'analyse des besoins du client ou à l'éco-conception, qui sont également des aspects clés mentionnés dans la synthèse."}, {"exercise": {"id": "24806f82dc0549589c867864cdf1dead", "statement": "Une fois les idées sélectionnées, elles sont immédiatement mises en œuvre sans être testées ou ajustées.", "veracity": false, "feedback": "L'énoncé est incorrect car les idées développées passent par un processus d'évaluation. Elles sont testées, des feedbacks sont recueillis, et des révisions sont effectuées en fonction des commentaires afin de les améliorer avant leur mise en œuvre finale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du processus de conception en soulignant l'importance de l'évaluation et des tests avant la mise en œuvre finale. Cela correspond bien à la référence qui traite de la conception d'équipements selon leurs usages et contraintes, notamment en insistant sur le développement des idées et l'évaluation rigoureuse. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments spécifiques liés à l'esthétique ou à l'éco-conception mentionnés dans la synthèse."}, {"exercise": {"id": "e192175fbdbe46bebd93a510b0827b98", "question": "Quel est le but principal de l'éco-conception, selon la définition donnée ?", "answers": ["Trouver un compromis environnemental avec les contraintes de conception du produit"], "distractors": ["Maximiser l'efficacité énergétique à tout prix.", "Garantir seulement la faisabilité technique d'un projet.", "Minimiser uniquement les coûts de production.", "Optimiser exclusivement les délais de fabrication.", "Améliorer la performance commerciale avant tout.", "Assurer une expérience utilisateur parfaite sans considération écologique.", "Réduire drastiquement les émissions de carbone.", "Prioriser l'efficacité commerciale à la durabilité.", "Atteindre une réduction totale des déchets de fabrication."], "feedback": "L'éco-conception vise à trouver un équilibre entre les contraintes environnementales et les autres contraintes liées à la conception d'un produit, telles que la faisabilité technique, les coûts, les délais et la performance d'utilisation. Cela signifie qu'il ne s'agit pas seulement de minimiser l'impact écologique, mais aussi de prendre en compte d'autres critères importants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7fd2dfc8eaaa465f9363402ce9492498", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif de cette démarche n'est pas la performance mais l'efficience : (Consommer le moins de mémoire, CPU, Stockage, Bande passante) L'éco-conception recherche le juste compromis de l'environnement avec toutes les autres contraintes liées à la conception du produit. Ainsi, elle intègre les réflexions environnementales au même titre que la faisabilité technique, la maîtrise des coûts et délais, la commercialisation, ainsi que la performance d'usage, etc.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "51b2faf1dccf4c88a474ccace8951217", "next_id": "4b2cf00ad8b24049accfa4ddbbced494", "prev_id": "1ce45de7c77c4f7882ffa6a2781ce4fb", "associated_block_ids": [], "first_page": 4, "last_page": 9, "start_time": null, "end_time": null, "doc_id": 13705, "doc_label": "QUALITE-WEB-_C2", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'éco-conception, qui est un thème central dans la synthèse fournie. La question cible spécifiquement le but principal de l'éco-conception, ce qui est pertinent par rapport à la référence sur la conception d'équipements selon leurs usages et contraintes. Cependant, bien que cela soit un aspect important, l'exercice pourrait être amélioré en incluant des questions sur d'autres concepts clés mentionnés dans la synthèse, tels que le Prototype Mockup ou le Design System. Cela aurait permis une évaluation plus complète des compétences liées à la conception d'équipements."}, {"exercise": {"id": "92008ae12514487784f4ea9cc8deb243", "statement": "L'éco-conception ne prend en compte que les aspects environnementaux et néglige les contraintes de faisabilité technique.", "veracity": false, "feedback": "L'éco-conception intègre non seulement les considérations environnementales mais aussi d'autres contraintes, telles que la faisabilité technique, la maîtrise des coûts et délais, ainsi que la performance d'usage. Elle vise à concilier les enjeux environnementaux avec ces autres critères.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7fd2dfc8eaaa465f9363402ce9492498", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif de cette démarche n'est pas la performance mais l'efficience : (Consommer le moins de mémoire, CPU, Stockage, Bande passante) L'éco-conception recherche le juste compromis de l'environnement avec toutes les autres contraintes liées à la conception du produit. Ainsi, elle intègre les réflexions environnementales au même titre que la faisabilité technique, la maîtrise des coûts et délais, la commercialisation, ainsi que la performance d'usage, etc.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "51b2faf1dccf4c88a474ccace8951217", "next_id": "4b2cf00ad8b24049accfa4ddbbced494", "prev_id": "1ce45de7c77c4f7882ffa6a2781ce4fb", "associated_block_ids": [], "first_page": 4, "last_page": 9, "start_time": null, "end_time": null, "doc_id": 13705, "doc_label": "QUALITE-WEB-_C2", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'éco-conception, qui est un thème central dans la synthèse fournie. Il teste la capacité de l'apprenant à reconnaître que l'éco-conception ne se limite pas aux aspects environnementaux, mais qu'elle doit également prendre en compte des contraintes techniques et économiques. Cela reflète bien l'objectif pédagogique de concevoir un équipement selon ses usages et contraintes. Cependant, l'exercice pourrait être amélioré en incluant des éléments plus variés sur les autres concepts clés abordés dans la synthèse, tels que le Prototype Mockup ou le Design System."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du rôle du wireframe dans le processus de conception, ce qui est pertinent par rapport à la référence sur la conception d'équipements selon leurs usages et contraintes. En demandant aux apprenants de définir l'objectif principal du wireframe, l'exercice teste leur capacité à reconnaître une étape clé dans le développement d'un produit qui répond aux attentes des utilisateurs. Cependant, il pourrait être amélioré en intégrant davantage d'éléments liés à l'éco-conception ou à l'analyse des besoins du client, qui sont également des aspects importants mentionnés dans la synthèse."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur dans le processus de conception d'un équipement, ce qui est un aspect clé de la référence. La question cible directement un élément fondamental du design efficace, en lien avec les usages et contraintes mentionnés. Cependant, bien que l'expérience utilisateur soit cruciale, d'autres éléments comme l'analyse des besoins du client ou l'éco-conception auraient pu être davantage explorés pour une évaluation plus complète. Cela justifie une note élevée mais pas parfaite."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le processus de conception, ce qui est un aspect clé de la référence. La référence mentionne explicitement que la conception d'expérience utilisateur joue un rôle crucial pour optimiser les interactions entre utilisateurs et produits, ce qui est en lien direct avec l'affirmation proposée. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects liés à la conception d'équipements selon leurs usages et contraintes, comme l'éco-conception ou les spécifications techniques. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du terme 'design' dans le contexte de la conception d'équipements, ce qui est pertinent par rapport à la référence qui aborde la conception selon les usages et contraintes. L'affirmation teste si l'apprenant peut distinguer entre une interprétation limitée du design (création visuelle) et une compréhension plus large qui inclut l'organisation et la pensée derrière l'expérience utilisateur. Cependant, bien que cela touche un aspect clé de la conception, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur les outils ou processus spécifiques mentionnés dans la synthèse, comme le Prototype Mockup ou l'éco-conception."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des éléments ergonomiques dans le processus de conception, ce qui est en lien direct avec l'objectif de concevoir un équipement selon ses usages et contraintes. L'affirmation souligne la nécessité d'étudier les usagers pour faire des choix éclairés, ce qui reflète bien l'idée d'adapter le design aux besoins des utilisateurs. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la collaboration avec l'équipe ou à l'évaluation rigoureuse des propositions, qui sont également mentionnés dans la synthèse."}, {"exercise": {"id": "f3f25021e6e54215965ddd60615e7b25", "question": "Quelles techniques peuvent être utilisées pour générer des idées lors de cette étape ?", "answers": ["Le brainstorming, mind mapping, listes d'idées et jeux de rôle"], "distractors": ["Analyser les différentes propositions et les classer selon leur priorité", "Les études de cas comparatives et débats argumentés", "La création de prototypes et simulations fonctionnelles", "La réalisation d'enquêtes et entretiens pour valider les hypothèses", "La création de matrices SWOT et BCG pour chaque idée proposée", "L'évaluation SWOT détaillée avec un focus sur les forces et faiblesses", "Le développement de maquettes cadrant les idées principales", "Les tests utilisateurs et validation de marché à petite échelle", "Benchmarking des meilleures idées selon des critères financiers"], "feedback": "Les techniques telles que le brainstorming, le mind mapping, les listes d'idées et les jeux de rôle sont adaptées pour encourager la production d'idées variées et originales, en faisant appel à la fois à la réflexion individuelle et à l'échange d'idées en groupe. Ces méthodes permettent également de stimuler l'innovation en sortant des sentiers battus et en combinant des idées de différentes personnes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "67fdbe4693c44dc0b365739538de5681", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade. C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "7b247f5a093543c99523d6dbff408ebd", "prev_id": "5b1cde7d85cf49db99d962eaff61fd45", "associated_block_ids": [], "first_page": 4, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la capacité de l'apprenant à identifier des techniques de génération d'idées, ce qui est pertinent dans le contexte de la conception d'équipements selon leurs usages et contraintes. Les méthodes mentionnées dans la réponse (brainstorming, mind mapping, etc.) sont effectivement des outils utilisés lors de la phase de développement des idées, comme décrit dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant une question plus spécifique sur l'application de ces techniques dans un contexte donné ou en lien avec les spécificités du produit à concevoir. Cela permettrait d'évaluer non seulement la connaissance des techniques mais aussi leur pertinence et leur application pratique."}, {"exercise": {"id": "a4211a89a66041cea75d9f65c5dd02c6", "query": "Lors du développement d'une idée, des ajustements et révisions sont effectués en fonction des <blank> pour l'améliorer.", "answers": ["commentaires reçus"], "distractors": [["besoins initiaux", "prototypes inutilisés", "étapes antérieures", "médias choisis", "croquis finaux", "variations imaginées"]], "feedback": "Les ajustements et révisions sont basés sur les commentaires reçus, car ceux-ci permettent de prendre en compte les retours pertinents et d'affiner l'idée. Les autres options mentionnent des éléments qui interviennent dans le processus, mais qui ne déclenchent pas directement les révisions.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8e9aa736eca04851a74ace1c5b1e9555", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Une fois les idées sélectionnées, elles sont développées plus en détail. Cela peut impliquer la recherche de références, la création de croquis, la réalisation de prototypes, l'expérimentation avec différents médias ou matériaux, et l'exploration de différentes variations et itérations de l'idée. Les idées développées sont évaluées en fonction des objectifs, des contraintes et des critères spécifiques du projet. Des tests, des feedbacks et des itérations peuvent être effectués pour améliorer et affiner davantage les idées. Des ajustements et des révisions sont apportés en fonction des commentaires reçus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "1a242c7908be4f788f91cd4289b2110e", "prev_id": "527169e94e4f4781b422e49dc6bb42a9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé teste la compréhension de l'importance des retours et des commentaires dans le processus de développement d'une idée, ce qui est pertinent pour la phase de conception mentionnée dans la référence. Cependant, il pourrait être amélioré en intégrant davantage d'éléments spécifiques à la conception d'équipements selon leurs usages et contraintes, comme l'analyse des besoins du client ou l'éco-conception. Bien que l'exercice soit lié au processus de révision et d'amélioration, il ne couvre pas entièrement les divers aspects clés évoqués dans la synthèse."}, {"exercise": {"id": "e11c2ad84ac74e07a8f72c3b516e8280", "statement": "Un design system ne concerne que les éléments graphiques d'un produit.", "veracity": false, "feedback": "Un design system englobe non seulement les éléments graphiques, mais aussi des aspects comme les règles, le branding et le ton, afin de créer un système standardisé réunissant tous les points de contact entre les acteurs du développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception d'équipements, en particulier le Design System, qui est mentionné dans la synthèse. Bien que l'affirmation porte sur un aspect spécifique du Design System, elle touche à des éléments importants de la conception et de l'esthétique, qui sont essentiels pour concevoir un équipement selon ses usages et contraintes. Cependant, l'exercice pourrait être amélioré en intégrant des questions plus directement liées aux processus de conception ou aux contraintes spécifiques évoquées dans la référence."}, {"exercise": {"id": "8f28a9f88d34427b97ac8306108b18b3", "statement": "Le but principal d'un design system est de standardiser les éléments liés au développement d'un produit pour garantir la cohérence.", "veracity": true, "feedback": "Le but d'un design system est effectivement de regrouper graphiques, règles, branding, ton, etc. en un seul système, assurant ainsi une cohérence dans le contact avec les différents acteurs participant au développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension du concept de Design System, qui est un élément clé dans le processus de conception d'équipements selon leurs usages et contraintes. Bien que l'affirmation soit pertinente et que la véracité soit correcte, l'exercice ne couvre pas directement tous les aspects mentionnés dans la référence, tels que l'analyse des besoins du client ou l'éco-conception. Il se concentre principalement sur la standardisation et la cohérence visuelle, ce qui est important mais ne représente qu'une partie de l'ensemble du processus de conception. Ainsi, bien qu'il soit pertinent, il manque une portée plus large pour obtenir une note maximale."}, {"exercise": {"id": "cfb5a24978ac4fb2bf3fa2db59ed0ebe", "question": "Quelle est l'utilité des wireframes dans le processus de création web?", "answers": ["Ils servent de base à la conception des maquettes web"], "distractors": ["Ils déterminent exclusivement les couleurs du site.", "Ils fournissent uniquement le texte du contenu.", "Ils remplacent les graphiques finaux sur le site.", "Ils sont créés en dernier après la conception graphique.", "Ils indiquent exactement où placer les images.", "Ils proposent les logos nécessaires pour le site web.", "Ils permettent d'ajuster uniquement la navigation visuelle.", "Ils représentent essentiellement l'esthétique finale du site.", "Ils s'occupent de la gestion du back-end du projet."], "feedback": "Les wireframes servent de base pour la conception des maquettes web en organisant les éléments et la navigation du site. Ils ne déterminent pas exclusivement l'esthétique finale du site, mais sont plutôt un guide pour respecter les fonctionnalités souhaitées par le client et le budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'utilité des wireframes dans le processus de création web, ce qui est pertinent par rapport à la référence sur la conception d'équipements selon leurs usages et contraintes. Les wireframes sont effectivement un outil clé dans la phase de conception, permettant de clarifier la structure et les fonctionnalités avant le développement final. Cependant, l'exercice se concentre uniquement sur un aspect spécifique (les wireframes) sans aborder d'autres éléments cruciaux mentionnés dans la synthèse, tels que l'analyse des besoins du client ou l'éco-conception. Cela limite légèrement sa portée par rapport à l'ensemble des concepts couverts dans la référence."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de la conception d'une interface utilisateur, en se concentrant sur la visibilité des fonctions essentielles. Cela est pertinent par rapport à la référence qui aborde la conception d'équipements selon leurs usages et contraintes, notamment en ce qui concerne l'expérience utilisateur (UX). Cependant, bien que l'exercice touche un aspect clé de la conception (la priorisation des fonctionnalités), il ne couvre pas entièrement les autres éléments mentionnés dans la synthèse, tels que l'analyse des besoins du client ou l'éco-conception. Ainsi, il est pertinent mais pas exhaustif."}, {"exercise": {"id": "cd8a0febad024bf98afbf360cdf852c3", "question": "Qu'est-ce que la mise en œuvre des idées peut inclure dans le domaine créatif ?", "answers": ["La création d'un prototype ou d'une campagne publicitaire"], "distractors": ["La révision des concepts de base", "L'analyse statistique des résultats", "L'évaluation finale du produit", "La suppression des idées principales", "L'analyse des tendances passées", "Le test utilisateur basé sur des données", "La formation des nouveaux employés", "La collecte du feedback des clients", "La recherche des matériaux utilisés"], "feedback": "La création d'un prototype ou d'une campagne publicitaire sont des exemples concrets de mise en œuvre des idées dans le domaine créatif. Ces activités nécessitent des compétences techniques spécifiques et une bonne compréhension du marché et des consommateurs pour réussir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d0c638e4cfdb4ff595dcc222494f8b01", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "C'est l'étape où les idées sont mises en œuvre concrètement. Selon le domaine créatif, cela peut impliquer la création d'un prototype, la production d'une œuvre d'art, la conception d'un produit, la réalisation d'une campagne publicitaire, etc. Les compétences techniques et l'expertise nécessaires pour concrétiser l'idée sont mises en jeu.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "b5b908ef693b41688cbe928d7eac863b", "prev_id": "6d29738638fa40a89c39d251e222da24", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la mise en œuvre des idées dans le domaine créatif, ce qui est pertinent pour le processus de conception d'équipements selon leurs usages et contraintes. Cependant, il ne teste pas directement les concepts clés tels que l'analyse des besoins du client, l'esthétique ou l'éco-conception mentionnés dans la synthèse. Bien que la création d'un prototype soit liée à la conception, la question est trop générale et ne se concentre pas suffisamment sur les aspects spécifiques de la référence. Une note de 6 reflète une pertinence modérée mais insuffisante pour évaluer pleinement la compréhension des éléments clés de la référence."}, {"exercise": {"id": "7a9bfae2718c4ec894908d42d69a0337", "question": "Quel est l'objectif principal d'un design system ?", "answers": ["Créer un système standardisé englobant tous les éléments graphiques et visuels"], "distractors": ["Faciliter uniquement la communication entre développeurs sans autres éléments.", "Améliorer la sécurité des données en développement produit.", "Se concentrer sur le développement du backend d'un produit.", "Optimiser exclusivement la performance technique des produits numériques.", "Gérer les bugs et correctifs de manière centralisée.", "Automatiser entièrement le processus de développement logiciel.", "Organiser tous les tests de performance pour un projet donné.", "Encourager l’utilisation des frameworks open-source dans le produit.", "Développer des environnements virtuels pour les phases de tests."], "feedback": "L'objectif principal d'un design system est de regrouper tous les éléments visuels et graphiques, ainsi que les règles, le branding et le ton dans un système standardisé pour faciliter le processus de développement et assurer cohérence et efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception, en l'occurrence le design system, qui est mentionné dans la synthèse comme un élément essentiel pour assurer une cohérence visuelle dans les produits développés. Cependant, bien que pertinent, cet exercice ne couvre pas directement l'ensemble des aspects de la référence qui inclut également des éléments tels que l'analyse des besoins du client, l'éco-conception et l'esthétique. Il aurait été plus pertinent de poser une question qui relie directement ces concepts à la conception d'équipements selon leurs usages et contraintes. Ainsi, bien qu'il soit pertinent, il n'évalue pas complètement tous les objectifs d'apprentissage couverts par la référence."}, {"exercise": {"id": "4c03f6a0173c41d68cc1d8eb88688d21", "question": "Qu'englobe généralement un design system dans le processus de création d'un produit ?", "answers": ["Les éléments graphiques, visuels, règles, ton, branding, etc"], "distractors": ["Les fonctionnalités techniques, algorithmes et optimisation de performances.", "Les vecteurs de sécurité et protocoles cryptographiques pour le produit.", "Le suivi exclusif des tests utilisateurs et retours clients.", "La gestion complète des bases de données et serveurs.", "Les diagrammes UML et documentation interne sur l’architecture produit.", "La conception des interfaces hardware et leurs connectiques.", "Les outils de déploiement cloud et gestion continue du produit.", "La rédaction de contrats juridiques et gestion de licences.", "L'analyse des statistiques de vente et tendances du marché."], "feedback": "Un design system englobe généralement tous les éléments liés à l'apparence et l'identité d'un produit, tels que les graphiques, les règles de style, le ton et le branding. Cela permet une création plus cohérente et efficace du produit, en assurant une identité visuelle unifiée et identifiable par les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur le concept de design system, qui est un aspect important du processus de conception d'un équipement. Bien que cela soit pertinent pour la référence concernant la conception selon les usages et contraintes, l'exercice ne teste pas directement la capacité à concevoir ou améliorer un équipement en tenant compte des besoins spécifiques des utilisateurs ou des contraintes techniques. Il se concentre plutôt sur les éléments graphiques et visuels, ce qui est une partie du processus mais ne couvre pas entièrement l'objectif pédagogique de conception globale. Ainsi, bien qu'il soit lié au sujet, il n'évalue pas complètement la compréhension des concepts clés liés à la conception d'équipements."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension du concept de design system, qui est un élément clé dans le processus de conception d'équipements selon leurs usages et contraintes. Bien que la question ne couvre pas directement tous les aspects de la conception mentionnés dans la référence, elle touche à l'importance de la cohérence visuelle et fonctionnelle dans le développement d'un produit. Cependant, l'exercice pourrait être amélioré en intégrant des questions sur d'autres concepts essentiels tels que l'analyse des besoins du client ou l'éco-conception, afin de mieux refléter l'ensemble des compétences nécessaires pour concevoir efficacement un équipement."}, {"exercise": {"id": "388525c44d4749319aec5fc378adefa3", "statement": "Un design system se limite uniquement aux éléments graphiques et visuels d'un produit.", "veracity": false, "feedback": "Un design system ne se limite pas uniquement aux éléments graphiques et visuels. Il inclut également des règles, des éléments de branding, le ton, et d'autres points de contact relatifs au produit, afin de créer un système cohérent et standardisé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de Design System, qui est mentionné dans la synthèse comme un élément essentiel pour assurer la cohérence visuelle des produits développés. Cependant, bien que cela soit pertinent pour la conception d'équipements selon leurs usages et contraintes, l'exercice ne teste pas directement la compréhension des processus de conception ou d'amélioration d'un équipement en lien avec les besoins du client ou l'éco-conception. Il se concentre plutôt sur une définition spécifique du Design System, ce qui limite son évaluation à un aspect plus étroit du sujet global. Ainsi, il est pertinent mais pas entièrement représentatif des objectifs d'apprentissage globaux."}, {"exercise": {"id": "1bf21415cd54487f998180c1dc6c9788", "statement": "L'efficience dans l'éco-conception consiste à réduire au maximum l'utilisation des ressources comme la mémoire, le CPU et la bande passante.", "veracity": true, "feedback": "En effet, l'efficience dans l'éco-conception signifie utiliser le moins de ressources possibles, telles que la mémoire, le CPU, le stockage, et la bande passante, tout en maintenant un compromis avec d'autres critères importants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7fd2dfc8eaaa465f9363402ce9492498", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif de cette démarche n'est pas la performance mais l'efficience : (Consommer le moins de mémoire, CPU, Stockage, Bande passante) L'éco-conception recherche le juste compromis de l'environnement avec toutes les autres contraintes liées à la conception du produit. Ainsi, elle intègre les réflexions environnementales au même titre que la faisabilité technique, la maîtrise des coûts et délais, la commercialisation, ainsi que la performance d'usage, etc.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "51b2faf1dccf4c88a474ccace8951217", "next_id": "4b2cf00ad8b24049accfa4ddbbced494", "prev_id": "1ce45de7c77c4f7882ffa6a2781ce4fb", "associated_block_ids": [], "first_page": 4, "last_page": 9, "start_time": null, "end_time": null, "doc_id": 13705, "doc_label": "QUALITE-WEB-_C2", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept d'éco-conception, qui est un thème central dans la synthèse fournie. Il teste la compréhension de l'efficience en matière d'utilisation des ressources, ce qui est pertinent pour concevoir un équipement selon ses usages et contraintes. Cependant, l'exercice se concentre principalement sur un aspect spécifique (l'efficience des ressources) sans explorer d'autres éléments clés tels que l'esthétique, l'analyse des besoins du client ou la conception UX. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement les divers aspects de la référence."}, {"exercise": {"id": "f8a348db2e134fde933360f12b2abad6", "statement": "Un site éco-conçu permet de réduire l'empreinte carbone des pages web d'au moins 70%.", "veracity": true, "feedback": "Il est correctement indiqué qu'un site éco-conçu permet une réduction minimale de 70% de l'empreinte carbone des pages web, ce qui est mentionné comme un des avantages majeurs de cette approche pour optimiser les ressources en ligne.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a72801bceb40496dad8d7c9127908540", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Elle permet de réduire l'empreinte carbone des pages web d'au moins 70% sachant que 39% des sites internet dans le monde utilisent Wordpress. Un site éco-conçu, c'est d'abord : un site plus léger, fait d'essentiels. Moins d'octets (unité de mesure du poids sur le web) sur le serveur, c'est un hébergement moins cher, des économies d'un côté. C'est aussi moins d'aller-retours de données (requêtes) entre serveurs, routeurs, ordinateurs, navigateurs ... A l'arrivée c'est un site plus rapide Les moteurs de recherches comme Google et Bing souhaitent : l'éco- conception croise l'un des pré-requis d'un bon référencement naturel.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c37ee8317fdd4f0c801a4c91e0225af1", "next_id": "e3c4624026674c2fa0625bab1305f2f6", "prev_id": "5d71586592d149a594e5840da8d6286b", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13705, "doc_label": "QUALITE-WEB-_C2", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept d'éco-conception, qui est un thème central dans la référence. Cependant, il se concentre uniquement sur l'impact environnemental des sites web et ne couvre pas les autres aspects de la conception d'équipements selon leurs usages et contraintes, tels que le processus de conception initiale, l'analyse des besoins du client ou l'esthétique. Bien qu'il soit pertinent pour une partie de la référence, il ne teste pas suffisamment la compréhension globale des différents éléments clés liés à la conception d'un équipement."}, {"exercise": {"id": "d98bc70a159f4f99ada0181438d991b5", "query": "Le wireframe se concentre principalement sur <blank>, sans s'occuper de l'aspect visuel ou du graphisme.", "answers": ["l'organisation des éléments et des formes"], "distractors": [["la création des images et vidéos finales", "la mise en forme graphique", "la palette de couleurs et typographie", "la réalisation des animations interactives", "l'optimisation des performances", "le développement du code fonctionnel"]], "feedback": "La bonne réponse est 'l'organisation des éléments et des formes' car le wireframe a pour but de déterminer la disposition structurelle des blocs comme les textes, images, ou vidéos, tout en ne tenant pas compte des détails graphiques qui seront travaillés ultérieurement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept clé lié à la conception, en particulier le wireframing, qui est mentionné dans la synthèse comme un outil essentiel pour clarifier la structure d'une interface utilisateur. Cependant, bien que cela soit pertinent pour le processus de conception d'équipements et d'installations, l'exercice ne couvre pas directement les aspects liés aux usages et contraintes spécifiques de l'équipement ou machine à concevoir. Il se concentre davantage sur une étape technique plutôt que sur l'ensemble du processus de conception qui inclut également des considérations esthétiques, fonctionnelles et environnementales. Ainsi, bien qu'il soit pertinent, il ne teste pas complètement tous les éléments clés de la référence."}, {"exercise": {"id": "da35feb49e864dec9be4a552fb20bd03", "query": "Les wireframes servent de base aux web designers pour <blank>, tout en respectant les souhaits et contraintes validés par le client.", "answers": ["la conception des maquettes"], "distractors": [["la gestion du budget", "le développement des fonctionnalités", "la maintenance du site", "la création du contenu", "l'organisation des réunions", "l'élaboration de scripts"]], "feedback": "Les wireframes sont des schémas représentant la structure d'une page web. Ils guident les web designers dans la phase créative appelée 'conception des maquettes', qui consiste à traduire ces schémas en une interface visuelle définitive. Les autres options, comme la maintenance du site ou la gestion du budget, relèvent de processus différents qui n’interviennent pas directement dans cette phase.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des wireframes, qui sont un outil essentiel dans le processus de conception d'équipements et d'interfaces. Cependant, il se concentre principalement sur un aspect spécifique (la création de maquettes) sans aborder directement les autres éléments clés mentionnés dans la référence, tels que l'analyse des besoins du client, l'esthétique ou l'éco-conception. Bien qu'il soit pertinent pour le sujet de la conception, il ne couvre pas suffisamment les usages et contraintes globaux liés à la conception d'un équipement selon ses spécificités."}, {"exercise": {"id": "df6d8e1ef0c24891972ea92c71fd1f92", "statement": "Le contenu utilisé dans le wireframe peut être fictif si les informations finales ne sont pas encore disponibles.", "veracity": true, "feedback": "Il est mentionné que les informations finales ne sont pas toujours connues à ce stade du projet, donc un contenu fictif peut être utilisé pour organiser le wireframe.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect spécifique du processus de conception, à savoir l'utilisation de contenu fictif dans le wireframing. Cela est pertinent car le wireframing est mentionné dans la synthèse comme un outil crucial pour clarifier la structure d'une interface utilisateur. Cependant, l'exercice ne couvre pas directement les autres éléments clés tels que l'analyse des besoins du client, l'esthétique ou l'éco-conception qui sont également essentiels pour concevoir un équipement selon ses usages et contraintes. Ainsi, bien que pertinent, il ne teste pas complètement tous les aspects de la référence."}, {"exercise": {"id": "a286d7d9d1844bed865e42b39a918f65", "statement": "Les wireframes valides sont immuables et ne peuvent en aucun cas être modifiés par les créatifs.", "veracity": false, "feedback": "Bien que les wireframes valides constituent la base du travail, ils ne sont pas immuables. Les web designers peuvent ajuster l'organisation des éléments et le système de navigation, tant qu'ils respectent les fonctionnalités validées par le client et restent dans les limites du budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des wireframes, qui sont un outil clé dans le processus de conception mentionné dans la référence. Cependant, bien qu'il aborde un aspect important de la phase de conception, il ne couvre pas directement l'ensemble des concepts liés à la conception d'équipements selon leurs usages et contraintes. L'exercice pourrait être amélioré en intégrant des éléments sur l'analyse des besoins du client ou sur l'éco-conception, qui sont également cruciaux dans le contexte donné."}, {"exercise": {"id": "77e6dd83078044cda5421815c880977b", "question": "Quelle est la conséquence du mauvais design du parc ?", "answers": ["Une pelouse défoncée qui ne sert pas les utilisateurs"], "distractors": ["Le parc devient un espace réservé à certaines activités.", "Les utilisateurs ne respectent pas les règles du parc.", "Trop peu de visiteurs viennent au parc.", "Le mobilier n'est pas adapté à la fréquentation.", "Le parc est devenu un lieu de rassemblement nocturne.", "Il y a trop de déchets éparpillés dans le parc.", "Les plantes n’ont pas survécu au climat.", "Les chemins piétonniers sont devenus glissants.", "Les zones de jeux sont constamment endommagées."], "feedback": "Le mauvais design du parc a eu pour conséquence une pelouse défoncée et inutilisable pour les utilisateurs. Comme le design ne répond pas aux besoins des utilisateurs, il n'est pas fonctionnel et n'offre pas une expérience agréable. Cela montre l'importance de prendre en compte les besoins des utilisateurs lors de la conception d'un espace public.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2c4b62c1aa1040448a44f65447c280ad", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Ceux qui ont fait les plans de ce parc n'ont pas tenu compte des besoins et des habitudes des utilisateurs. Conséquence : la Mairie se retrouve avec une pelouse défoncée le design est inutile, il ne sert pas les intérêts de l'utilisateur, et donc ne provoque pas une bonne expérience.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "db25a3a44a5541b3971bc88b34b5e8e8", "next_id": "a7bea124ca294272b21916e08d6d07cb", "prev_id": "db25a3a44a5541b3971bc88b34b5e8e8", "associated_block_ids": [], "first_page": 202, "last_page": 202, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'impact d'un mauvais design sur un espace public, ce qui est pertinent pour le concept de concevoir un équipement selon ses usages et contraintes. La réponse fournie met en lumière les conséquences d'une conception inappropriée, soulignant l'importance de répondre aux besoins des utilisateurs. Cependant, l'exercice pourrait être amélioré en intégrant des éléments spécifiques liés à la phase de conception mentionnée dans la synthèse, tels que l'analyse des besoins du client ou l'évaluation rigoureuse des propositions. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement les aspects clés de la référence."}, {"exercise": {"id": "6402f767267d44f48ab11d266f6cc909", "question": "Quelle est la principale raison des problèmes rencontrés avec ce parc ?", "answers": ["Les plans n'ont pas considéré les besoins des utilisateurs"], "distractors": ["Des erreurs ont été commises lors de la construction.", "Le parc est mal surveillé par les autorités.", "La maintenance du parc est insuffisante.", "Le design du parc est trop moderne pour la ville.", "Les matériaux utilisés sont inadaptés aux conditions météorologiques.", "L'accès au parc est limité pour les utilisateurs.", "Le parc n'a pas assez d'espaces verts.", "Les arbres plantés sont trop jeunes pour offrir de l'ombre.", "Le coût du parc a été mal géré."], "feedback": "La principale raison des problèmes rencontrés avec ce parc est que les concepteurs n'ont pas pris en compte les besoins et les habitudes des utilisateurs lors de la création des plans. Cela a entraîné une conception inadaptée qui ne répond pas aux attentes des utilisateurs, ce qui affecte leur expérience dans le parc.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2c4b62c1aa1040448a44f65447c280ad", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Ceux qui ont fait les plans de ce parc n'ont pas tenu compte des besoins et des habitudes des utilisateurs. Conséquence : la Mairie se retrouve avec une pelouse défoncée le design est inutile, il ne sert pas les intérêts de l'utilisateur, et donc ne provoque pas une bonne expérience.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "db25a3a44a5541b3971bc88b34b5e8e8", "next_id": "a7bea124ca294272b21916e08d6d07cb", "prev_id": "db25a3a44a5541b3971bc88b34b5e8e8", "associated_block_ids": [], "first_page": 202, "last_page": 202, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de la prise en compte des besoins des utilisateurs dans le processus de conception, ce qui est un aspect clé de la référence. Cependant, il se concentre spécifiquement sur un parc et ne couvre pas d'autres éléments importants tels que l'éco-conception, l'esthétique ou les spécifications techniques mentionnées dans la synthèse. Bien qu'il teste une compréhension pertinente du concept de conception centrée sur l'utilisateur, il manque une portée plus large pour atteindre une évaluation parfaite."}, {"exercise": {"id": "87c2b33f5503487ebf5bb50b8dbb6746", "question": "Quel concept permet à l'utilisateur de comprendre comment utiliser un objet avant utilisation ?", "answers": ["L'affordance offre une compréhension intuitive d'un objet avant son utilisation"], "distractors": ["L'utilisabilité repose sur la compréhension immédiate de l'objet", "Le feedback permet d’interagir avec l’objet après l’avoir utilisé", "L’ergonomie se focalise uniquement sur l'aspect esthétique de l'objet", "La signalisation guide l'utilisation mais implique une lecture préalable", "La redondance renforce l'accessibilité des objets via répétition", "La ludification transforme l’interaction en jeu pour meilleure accessibilité", "L'anthropomorphisme associe des caractéristiques humaines aux objets", "L'accessibilité concerne uniquement les personnes à mobilité réduite dans le design", "La modularité permet de personnaliser un objet selon les besoins spécifiques"], "feedback": "L'affordance est un concept qui permet à l'utilisateur de comprendre intuitivement comment utiliser un objet avant même de l'avoir utilisé. Cela se fait par le biais de signes et de stimuli visuels, tels que la forme d'un objet ou les actions qu'il inspire, qui suggèrent à l'utilisateur comment interagir avec l'objet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "59cb83373938401799c6f1b0cb7895c0", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Cela peut être le noms des pages, des choses importantes a mètre en avant, des fonctionnalités, des idées de visuels, Des mots clés pour rendre le site plus complet L'affordance offre à l'utilisateur les moyens de se servir d'un objet et de le comprendre avant même s'en être servie. Les affordances sont donc des appels à l'action, au sens large. Tirer, pousser, appuyer, tapoter, cliquer, effleurer, porter sont autant de moyen d'interagir avec un objet ou une interface. Par exemple, la poignée d'une porte incite l'individu à appuyer dessus pour ouvrir la porte, la forme de la chaise lui suggère de s'asseoir dessus.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "624d0e1889004fabafda5205ff4fca95", "next_id": "5b2a5209430c44c4b4fe9e0fd3f9d6f1", "prev_id": "13f4db6f4fe74757a4b76f4a2a06cb98", "associated_block_ids": [], "first_page": 148, "last_page": 165, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept d'affordance, qui est pertinent dans le cadre de la conception d'équipements en lien avec l'expérience utilisateur (UX). Bien que cela touche à l'esthétique et à la fonctionnalité, qui sont des éléments clés de la référence, l'exercice ne couvre pas directement les aspects liés à la conception selon les usages et contraintes spécifiques mentionnés dans la référence. Il aurait été plus pertinent d'inclure des questions sur le processus de conception, l'analyse des besoins du client ou l'éco-conception pour mieux évaluer la compréhension des concepts clés liés à la conception d'équipements. Ainsi, bien que l'exercice soit en rapport avec certains éléments de la synthèse, il ne teste pas pleinement tous les aspects essentiels de la référence."}, {"exercise": {"id": "b478036433374d069dc24183c069ea0b", "query": "Le parc souffre de problèmes d'aménagement car les concepteurs n'ont pas pris en compte <blank> des utilisateurs.", "answers": ["les besoins et les habitudes"], "distractors": [["les finances et la météo", "les animaux et la végétation", "la rue et les bâtiments voisins", "les règlements et les lois", "les plantes et les fleurs", "les goûts et les tendances"]], "feedback": "La bonne réponse est 'les besoins et les habitudes' car l'aménagement inefficace du parc est dû au fait que les créateurs n'ont pas réfléchi à la façon dont les utilisateurs interagissent avec l'espace. Cela a conduit à une mauvaise utilisation du design et à une expérience utilisateur insatisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2c4b62c1aa1040448a44f65447c280ad", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Ceux qui ont fait les plans de ce parc n'ont pas tenu compte des besoins et des habitudes des utilisateurs. Conséquence : la Mairie se retrouve avec une pelouse défoncée le design est inutile, il ne sert pas les intérêts de l'utilisateur, et donc ne provoque pas une bonne expérience.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "db25a3a44a5541b3971bc88b34b5e8e8", "next_id": "a7bea124ca294272b21916e08d6d07cb", "prev_id": "db25a3a44a5541b3971bc88b34b5e8e8", "associated_block_ids": [], "first_page": 202, "last_page": 202, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des besoins des utilisateurs, ce qui est pertinent pour la conception d'équipements selon leurs usages et contraintes. Cependant, il se concentre principalement sur un aspect spécifique (les besoins et habitudes) sans aborder d'autres éléments clés mentionnés dans la synthèse, tels que l'esthétique, l'éco-conception ou les spécifications techniques. Bien qu'il soit utile pour évaluer une partie de la compétence visée, il ne couvre pas l'ensemble du processus de conception décrit dans la référence."}, {"exercise": {"id": "2e8282503d8d465cb75918606843cf30", "statement": "Un bouton d'appel à l'action trop grand peut nuire à la hiérarchie visuelle d'une mise en page.", "veracity": true, "feedback": "Un bouton trop grand peut effectivement perturber la composition visuelle et altérer la hiérarchie de la mise en page, ce qui rendrait l'interface utilisateur moins harmonieuse et ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de l'esthétique et de la hiérarchie visuelle dans la conception d'une interface utilisateur, ce qui est pertinent par rapport à la référence sur la conception d'équipements selon leurs usages et contraintes. Cependant, il ne couvre pas directement les aspects liés à l'analyse des besoins du client, aux spécifications techniques ou à l'éco-conception mentionnés dans la synthèse. Bien qu'il touche un aspect clé de la conception UX, il aurait pu être plus complet en intégrant d'autres éléments essentiels du processus de conception."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'équipements, à savoir l'importance de la clarté et de la cohérence dans l'interface utilisateur, ce qui est en lien avec les concepts de conception d'expérience utilisateur (UX) mentionnés dans la synthèse. Cependant, il ne couvre pas directement les autres éléments clés tels que le Prototype Mockup, l'analyse des besoins du client ou l'éco-conception. Bien qu'il soit pertinent pour une partie des objectifs d'apprentissage, il ne teste pas suffisamment la compréhension globale des processus de conception évoqués dans la référence."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'équipements, à savoir l'étude des usagers, qui est essentielle pour répondre aux usages et contraintes. Cependant, il se concentre principalement sur un élément spécifique de l'ergonomie sans couvrir d'autres concepts clés mentionnés dans la référence, tels que le Prototype Mockup, le Wireframing ou l'éco-conception. Bien qu'il soit pertinent pour la compréhension des besoins utilisateurs, il ne teste pas de manière exhaustive les compétences nécessaires pour concevoir un équipement selon ses usages et contraintes."}, {"exercise": {"id": "d4e9ab91b0d543e59d4284af6b4ebc5f", "question": "Pourquoi la taille de l'écran mobile peut poser problème lors de la conception ?", "answers": ["La taille restreinte complique la créativité et le webdesign"], "distractors": ["Les smartphones n'ont pas assez de performances pour un bon design.", "Les sites mobiles ne peuvent pas contenir de contenu multimédia.", "La navigation mobile impose toujours deux mains pour interagir.", "L'amélioration des visuels pour mobile est plus simple qu'avec un ordinateur.", "La taille d’écran mobile améliore toujours l'expérience utilisateur.", "Les écrans de téléphone n'affichent pas les images en haute qualité.", "Le responsive design supprime tout besoin de réflexion créative.", "Les couleurs doivent changer entre les versions mobile et desktop.", "Toutes les interfaces mobiles doivent être monochromes pour optimiser le design."], "feedback": "La taille de l'écran d'un terminal mobile peut poser problème pour les créateurs de sites web, car cela limite leur capacité à être créatif et à concevoir des designs complexes et esthétiques. La limitation de l'espace sur un petit écran peut également poser des problèmes pour l'optimisation de la navigation et de l'expérience utilisateur globale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent de la conception d'équipements, en se concentrant sur les contraintes liées à la taille de l'écran mobile. Cela touche à la nécessité de prendre en compte les usages et les limitations techniques lors de la conception, ce qui est en ligne avec l'objectif pédagogique. Cependant, il ne couvre pas directement d'autres éléments clés mentionnés dans la synthèse, tels que l'analyse des besoins du client ou l'éco-conception. De plus, bien que le sujet soit pertinent, il pourrait être élargi pour inclure des considérations plus variées sur le design et l'expérience utilisateur. Ainsi, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects importants de la référence."}, {"exercise": {"id": "f73b609c41224a5eb611f366c35d9a2a", "question": "Quel critère doit être respecté pour rendre une application intuitive ?", "answers": ["Son fonctionnement doit être familier aux utilisateurs"], "distractors": ["Elle doit offrir de nombreuses options uniques d'interface", "Elle doit suivre les dernières tendances du marché", "Elle doit être visuellement impressionnante", "Sa conception doit ignorer les habitudes des utilisateurs", "Elle doit inclure toutes les fonctionnalités demandées par les développeurs", "Elle doit intégrer au moins deux modes de navigation", "Son design doit être avant-gardiste et innovant", "Son utilisation doit être complexe mais enrichissante", "Elle doit simuler des défis d’apprentissage pour les utilisateurs"], "feedback": "Respecter les habitudes des utilisateurs permet de rendre l'application intuitive car les utilisateurs seront familiers avec son fonctionnement et pourront l'utiliser facilement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un critère important pour la conception d'une application, à savoir l'intuitivité et la familiarité du fonctionnement pour les utilisateurs. Cela est en lien avec le concept de Conception d'Expérience Utilisateur (UX) mentionné dans la synthèse, qui vise à optimiser les interactions entre utilisateurs et produits. Cependant, l'exercice ne couvre pas directement les autres aspects clés de la référence, tels que l'analyse des besoins du client ou l'éco-conception. Il se concentre principalement sur un aspect spécifique de l'expérience utilisateur sans aborder les contraintes et usages globaux liés à la conception d'équipements. C'est pourquoi il obtient une note intermédiaire."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'expérience utilisateur (UX) et de la cohérence visuelle, qui sont des éléments importants dans le processus de conception d'un équipement selon ses usages et contraintes. Cependant, il se concentre principalement sur les aspects esthétiques et d'interaction plutôt que sur l'ensemble du processus de conception, y compris l'analyse des besoins du client ou l'éco-conception. Bien qu'il teste une compréhension pertinente des normes de référence en design, il ne couvre pas suffisamment les autres dimensions essentielles mentionnées dans la synthèse, ce qui limite sa pertinence globale par rapport à la référence."}, {"exercise": {"id": "5e5e624e0c9749189df302e3a469edd0", "statement": "Une application intuitive fonctionne de manière proche des habitudes déjà acquises par les utilisateurs.", "veracity": true, "feedback": "L'énoncé est correct car il est recommandé de concevoir une application qui se rapproche du mode de fonctionnement auquel les utilisateurs sont déjà habitués, pour éviter des difficultés inutiles dans l'utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de concevoir des équipements en tenant compte des habitudes des utilisateurs, ce qui est pertinent pour le contexte de la conception d'un équipement selon ses usages. Cependant, il ne couvre pas directement les autres aspects clés mentionnés dans la référence, tels que l'analyse des besoins du client, l'esthétique ou l'éco-conception. Bien qu'il soit lié à la conception centrée sur l'utilisateur, il manque une approche plus globale et intégrée qui engloberait tous les éléments essentiels du processus de conception."}, {"exercise": {"id": "e0cf9089b85645619bd302248b95be28", "query": "L'accent est mis sur <blank> d'idées plutôt que sur leur qualité à ce stade.", "answers": ["la quantité"], "distractors": [["la pertinence", "la compréhension", "la structure", "la cohérence", "l'originalité", "la précision"]], "feedback": "La bonne réponse est 'quantité', car lors de cette étape, l'objectif est de générer un maximum d'idées sans se soucier de leur qualité ou pertinence immédiate. Les autres options comme 'pertinence' et 'précision' peuvent être importantes dans d'autres étapes, mais ici, seule la quantité compte.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "67fdbe4693c44dc0b365739538de5681", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade. C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "7b247f5a093543c99523d6dbff408ebd", "prev_id": "5b1cde7d85cf49db99d962eaff61fd45", "associated_block_ids": [], "first_page": 4, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'une phase du processus de conception, en se concentrant sur l'importance de générer un grand nombre d'idées. Cela est pertinent pour le contexte de la référence qui aborde la conception et l'amélioration d'équipements. Cependant, il ne couvre pas directement les autres aspects clés mentionnés dans la synthèse, tels que l'analyse des besoins du client ou l'esthétique. Bien qu'il soit lié à une étape du processus créatif, il n'évalue pas pleinement la capacité à concevoir selon les usages et contraintes spécifiques évoqués dans la référence."}, {"exercise": {"id": "fe4bdd02dd44424eb169f80a0ba62dcf", "statement": "L'objectif principal de cette étape est de générer un maximum d'idées sans se soucier d'évaluer leur pertinence immédiate.", "veracity": true, "feedback": "Cette affirmation est correcte. L'étape décrite met clairement l'accent sur la génération d'un grand nombre d'idées, sans jugement ni évaluation de leur qualité à ce stade, afin de favoriser la créativité et la diversité des propositions.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "67fdbe4693c44dc0b365739538de5681", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade. C'est l'étape où les idées sont générées de manière large et sans jugement. Cela peut se faire à travers des techniques comme le brainstorming, le mind mapping, les listes d'idées, les jeux de rôle, etc. L'accent est mis sur la quantité d'idées plutôt que sur leur qualité à ce stade.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9172ce1a2533465bb7c6c5edb282ac9e", "next_id": "7b247f5a093543c99523d6dbff408ebd", "prev_id": "5b1cde7d85cf49db99d962eaff61fd45", "associated_block_ids": [], "first_page": 4, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13697, "doc_label": "Sequence 3_Comprendre méthodologies idéation", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'une étape du processus de conception, qui est effectivement importante pour concevoir un équipement selon ses usages et contraintes. Cependant, il se concentre uniquement sur la phase de génération d'idées sans aborder les autres aspects cruciaux mentionnés dans la référence, tels que l'analyse des besoins du client, l'esthétique ou l'éco-conception. Bien qu'il soit pertinent, il ne couvre pas suffisamment les différents éléments clés nécessaires à une conception complète et efficace."}, {"exercise": {"id": "52606c0f2a784a0f8bab387798a3f493", "query": "Le Stylescape permet de communiquer efficacement avec les clients en leur donnant une idée claire de <blank> du projet final.", "answers": ["l'apparence et de la sensation"], "distractors": [["la rentabilité et de l'ergonomie", "le public cible et des délais", "les étapes de production et de l'esthétique", "les contraintes techniques et de l'interface", "la palette de couleurs et des typographies", "les technologies utilisées et des coûts"]], "feedback": "Le Stylescape communique aux clients une vision globale du projet, notamment en ce qui concerne 'l'apparence et la sensation', car cela reflète l'émotion et l'ambiance que le projet de design doit transmettre. Les autres options ne mentionnent pas directement cet aspect visuel et émotionnel clé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé évalue la compréhension de l'importance de l'esthétique dans le processus de conception, ce qui est un aspect clé de la référence. Cependant, il se concentre principalement sur le Stylescape et son rôle dans la communication visuelle avec les clients, sans aborder directement d'autres éléments cruciaux tels que l'analyse des besoins du client ou l'éco-conception. Bien qu'il teste une compétence pertinente, il ne couvre pas entièrement les usages et contraintes liés à la conception d'un équipement dans son ensemble. Par conséquent, bien qu'il soit pertinent, il n'évalue pas tous les aspects clés mentionnés dans la référence."}], "sources": [{"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}, "is_teacher": null}, "score": 10.6, "top_pages": [201, 202], "top_minutes": []}, {"document": {"id": 13679, "label": "ON_SE_FAIT_UN_BRIEF", "authors": [], "title": "Création et Design Digital : Stratégies de Communication", "content": [], "mime_type": "application/pdf", "short_summary": "Le texte aborde les stratégies de communication efficaces pour le design de marque, en mettant l'accent sur l'écoute active et l'analyse des besoins du client. Il souligne également l'importance d'une préparation approfondie avant les rencontres avec les clients.", "long_summary": "- Introduction à la communication efficace avec les clients : écoute active et clarification des attentes.\n- Analyse du brief créatif : décomposition en éléments clés et identification des objectifs principaux.\n- Évaluation des besoins du client, y compris ceux non exprimés.\n- Importance de la phase de veille avant le brief pour comprendre l'univers du client.\n- Rassembler un maximum d'informations sur le client avant la rencontre.\n- Utilisation d'outils comme Miro pour le brainstorming et exploration de différentes directions.\n- Méthode de l'entonnoir : collecte d'informations suivie d'une note d'intention concise.\n- Défense de son point de vue face aux exigences du client avec un argumentaire solide.\n- Définition claire de la marque avec une identité distincte et tangible.\n- Diagnostic similaire à celui d'un médecin pour établir un état des lieux et recommandations.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/0D0xJo5p6o8h3dJ8/documents/9e99bfb_on_se_fait_un_brief.pdf", "external_url": null, "path": null, "corpus_id": 639, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- OBJECTIFS DE CE COURS\n===\n\n  - ## 1. PREMIER CONTACT\n\n  - ## 2. IMMERSION\n\n  - ## 3. PAS DE PRÉCIPITATIONS\n\n  - ## 4. L'ENTONNOIR\n\n  - ## 5. DÉFENDRE VOTRE POINT DE VUE\n\n  - ## 6. DÉFINIR LA MARQUE\n\n  - ## 7. LE DIAGNOSTIC\n\n  - ## 8. EXEMPLE QUESTIONNAIRE CLIENT\n", "number_of_pages": 12, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}, "is_teacher": null}, "score": 7.3, "top_pages": [1, 2], "top_minutes": []}, {"document": {"id": 13697, "label": "Sequence 3_Comprendre méthodologies idéation", "authors": [], "title": "Le Processus Créatif : Étapes et Techniques", "content": [], "mime_type": "application/pdf", "short_summary": "Le processus créatif comprend plusieurs étapes essentielles allant de la préparation à la réalisation. Des techniques comme le brainstorming et le mind mapping sont utilisées pour générer et organiser des idées.", "long_summary": "- Le processus créatif se compose de plusieurs étapes clés :\n  - **Préparation** : Collecte d'informations et compréhension du contexte.\n  - **Génération d'idées (idéation)** : Production d'un grand nombre d'idées sans jugement, via des techniques comme le brainstorming.\n  - **Exploration et sélection** : Évaluation des idées pour choisir celles à développer.\n  - **Développement** : Affinage des idées par recherche, croquis, prototypes, etc.\n  - **Évaluation et révision** : Test des idées selon les objectifs avec ajustements basés sur les retours.\n  - **Réalisation** : Mise en œuvre concrète des idées choisies.\n  - **Présentation et diffusion** : Partage de la création pour recueillir des réactions.\n- Règles du brainstorming incluent liberté d'expression, créativité encouragée, interdiction de critiques.\n- Importance de définir clairement l'objectif ou le problème à résoudre (ex: logo, campagne publicitaire).\n- Techniques comme le brainwriting favorisent une réflexion indépendante en évitant les biais de groupe.\n- Introduction au mind mapping pour organiser visuellement les idées autour d'un sujet central avec branches principales et secondaires.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/0D0xJo5p6o8h3dJ8/documents/6de617e_sequence-3_comprendre-methodologies-ideation.pdf", "external_url": null, "path": null, "corpus_id": 639, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- COMPRENDRE LES MÉTHODOLOGIES D'IDÉATION\n===\n\n- Établir des règles\n===\n\n- Distribution de fiches\n===\n\n- Projet fil rouge\n===\n", "number_of_pages": 46, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}, "is_teacher": null}, "score": 7.3, "top_pages": [13, 1], "top_minutes": []}]}