{"introduction": "Dans le cadre du déploiement et de l'intégration de logiciels, systèmes d'information et applications, il est essentiel de comprendre les différentes étapes et concepts qui garantissent une mise en œuvre réussie. Cette synthèse aborde des thèmes clés tels que la gestion de projet, l'expérience utilisateur, la collaboration dans le développement logiciel et les bonnes pratiques à suivre pour assurer un produit final conforme aux attentes des clients.", "synthesis": "La gestion de projet est fondamentale pour orchestrer toutes les phases d'un projet logiciel. Elle implique une planification rigoureuse, l'organisation des ressources et le suivi régulier des progrès. Le dossier d'exécution joue un rôle crucial en fournissant un cadre technique détaillé qui guide chaque étape du processus. Les dépendances doivent également être gérées avec soin pour éviter les conflits lors de l'intégration des différents composants du système.\n\nL'expérience utilisateur (UX) est au cœur du succès d'une application ou d'un système d'information. La conception UX vise à optimiser les interactions entre l'utilisateur et le produit en créant des interfaces intuitives et agréables. Cela inclut non seulement l'esthétique mais aussi la fonctionnalité, influençant directement la satisfaction des utilisateurs finaux. Les bonnes pratiques UI sont essentielles pour garantir que les éléments graphiques contribuent positivement à cette expérience.\n\nLa collaboration dans le développement logiciel favorise une approche intégrée où équipes de développement et d'exploitation travaillent ensemble pour atteindre des objectifs communs. Cette synergie permet une meilleure compréhension mutuelle et une résolution rapide des problèmes rencontrés durant le processus de création. Des outils numériques facilitent cet échange d'idées enrichissant.\n\nEnfin, la validation client est une étape clé qui assure que le produit final répond aux attentes définies au départ. Ce processus inclut souvent la collecte de retours via des réunions post-brief ou par le biais de questions essentielles posées au client tout au long du projet. En intégrant ces concepts dans un cadre structuré comme celui proposé par la méthodologie Design Thinking, on peut s'assurer que chaque aspect du projet est aligné sur les besoins réels des utilisateurs.", "concepts": [{"concept": {"id": "e3db3cdb-5474-48f7-833c-0bdae33ed61a", "label": "Dossier d'Exécution", "definition": "Document technique détaillant les spécifications et les éléments nécessaires à la réalisation d'un projet, crucial pour assurer sa bonne mise en œuvre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": {"label": "Dossier des ouvrages exécutés", "definition": "Le dossier des ouvrages exécutés, ou DOE, est un document contractuel de la construction immobilière en France.", "page_id": "3606988", "wikidata_id": "Q3037354", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "'Dossier d'Exécution' est fondamental pour tester un logiciel car il contient toutes les spécifications nécessaires pour assurer une bonne mise en œuvre et vérification du système développé."}, {"concept": {"id": "4c7bd337-41a5-4fa5-be76-8ba4d625aba3", "label": "Dépendances", "definition": "Les dépendances désignent les relations entre différentes tâches dans un projet, où certaines doivent être complétées avant que d'autres puissent commencer. Elles incluent également les bibliothèques, modules ou packages externes nécessaires au bon fonctionnement d'un logiciel, gérées par des outils comme Composer ou d'autres gestionnaires de paquets pour éviter les conflits et assurer une intégration harmonieuse. La gestion des dépendances est cruciale lors de la construction d'images Docker, garantissant que toutes les ressources nécessaires sont disponibles et correctement configurées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13616, 13682, 13629, 13646], "aliases": ["9bea9086-d32a-43ce-9c7b-b43fa8ca722f", "5b3faef6-87f6-4964-b875-afcd1b03f286", "73db64f4-c345-4052-964e-c6f9e45c0b54"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les dépendances sont cruciales pour assurer que toutes les parties nécessaires fonctionnent correctement lors des tests, rendant ce concept hautement pertinent."}, {"concept": {"id": "44ac33ba-9d4f-4b84-b241-38468732b7e0", "label": "Suivi et mise à jour", "definition": "Le suivi et la mise à jour consistent à surveiller régulièrement l'avancement du projet et ajuster le plan en fonction des imprévus.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le suivi et la mise à jour sont cruciaux pour s'assurer que le système fonctionne comme prévu après son déploiement et permettent d'ajuster les processus en fonction des résultats des tests."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'expérience utilisateur et client est centrale au testing et à l'intégration des logiciels, car elle vise à optimiser la satisfaction des utilisateurs lors de leur interaction avec les systèmes."}, {"concept": {"id": "9c7cbcbd-6820-4fcd-bd00-88a36b11fe80", "label": "Analyse des Besoins du Client", "definition": "Processus d'évaluation des exigences explicites et implicites d'un client afin de fournir des solutions adaptées à ses attentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Analyse des Besoins du Client' est cruciale pour tester un système car comprendre les besoins permet de s'assurer que le produit final répond aux attentes avant son déploiement."}, {"concept": {"id": "4a2ec939-5551-43b9-bb1b-4138b81561a9", "label": "Raccourci Contrôle en amont", "definition": "Fonction qui permet d'identifier rapidement les erreurs potentielles dans un document avant sa publication, comme le texte en excès ou les liens rompus.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13687], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le raccourci contrôle en amont est très pertinent car il permet d'identifier les erreurs avant la publication, ce qui est essentiel dans le cadre du testing."}, {"concept": {"id": "baebe016-d0cc-4e32-9346-f7e1124193a3", "label": "Conception d'Expérience Utilisateur (UX)", "definition": "La conception d'expérience utilisateur (UX) est une discipline centrée sur l'optimisation des interactions entre les utilisateurs et les produits ou services numériques. Elle vise à améliorer la satisfaction et l'efficacité de l'utilisation en créant des interfaces utilisateur intuitives et attrayantes, tout en tenant compte des comportements, besoins cognitifs et préférences des utilisateurs finaux. Ce processus englobe à la fois l'esthétique et la fonctionnalité, influençant ainsi l'expérience globale par des choix visuels et structurels. Les professionnels tels que les designers UX et UI travaillent à établir des interactions significatives, simplifiant l'interaction utilisateur tout en gérant la complexité sous-jacente du système.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13609, 13709], "aliases": ["dbb0eb49-384a-4835-8a27-f3df10e75759", "91010b14-36ae-419d-bf38-a846de1275f6", "574e83b8-4354-48fa-850e-93c5120ebc83", "ecf19b49-88ec-4c4c-a1b6-95ffa690e97f", "25934ed3-33c1-4498-8e65-074291667094", "796f5e0a-7a74-4541-adfb-b2193ad73b61", "a23c6da5-a4ab-4891-991e-7b937aa0abdc", "37ee1509-2635-464b-9584-a9b0c9d9c8ad", "c00973e6-b1c9-4905-942b-5be484cb15c3", "d4bcea8d-2203-4129-9886-2b5a3d013def", "10afcc11-a32f-4ff7-b2c9-b91fd8f41279", "bfa65925-0083-4475-bf52-1b49b880a8ef", "172c8581-4218-4949-9879-3623e9c81b76", "84c2a388-034d-4adb-8881-3d024eed3a5c", "54158781-d4d4-4026-a63f-e0e8693a8902", "9f681d3a-0c7c-4485-9bcf-e52381ff9719", "da83989a-f0e2-4e84-b8e1-dbb6cfe0e312"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La conception d'expérience utilisateur (UX) est essentielle pour tester et optimiser les interactions dans un logiciel, ce qui en fait un concept très pertinent."}, {"concept": {"id": "c046e017-bd93-494e-935f-03880b12ef92", "label": "Spécifications du produit", "definition": "Détails techniques et exigences précises concernant un produit ou service demandé par le client.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": {"label": "Spécification (norme technique)", "definition": "Une spécification est un ensemble explicite d'exigences à satisfaire par un matériau, produit ou service. Si un matériau, produit ou service ne parviennent pas à satisfaire à une ou plusieurs des spécifications applicables, il peut être désigné comme étant hors spécification.\nUne spécification technique peut être développée en privé, par exemple, par une société, un organisme de réglementation, ou une organisation militaire, ou bien elle peut être développée par des organismes de normalisation qui sont souvent plus amenés à développer des normes volontaires (ces normes volontaires pouvant devenir obligatoires si elles sont adoptées par un du gouvernement ou un contrat d'entreprise).", "page_id": "79499", "wikidata_id": "Q2101564", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les spécifications du produit sont cruciales lors des tests car elles définissent les critères à vérifier et valider durant le processus de test."}, {"concept": {"id": "008d5789-6187-488a-86aa-9faf7453aed1", "label": "Questions Essentielles", "definition": "Interrogations clés posées au client pour clarifier ses besoins et attentes avant le début d'un projet créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les questions essentielles sont cruciales pour comprendre les besoins du client avant le déploiement et l'intégration, ce qui en fait un concept hautement pertinent."}, {"concept": {"id": "a4a41759-7c2c-4b83-a087-a1208930885a", "label": "Réunion post-brief", "definition": "Rencontre organisée après la présentation initiale du brief pour clarifier les attentes et recueillir les réactions du client sur les premières idées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Réunion post-brief' est essentielle pour clarifier les attentes après la présentation initiale, ce qui a un impact direct sur le succès du test et de l'intégration."}, {"concept": {"id": "d49ca571-1985-46c8-a1ee-1a21d7b40165", "label": "Finalisation", "definition": "Étape finale dans le processus de création où les détails sont peaufinés avant la livraison ou la mise en œuvre du produit final.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681, 13696], "aliases": ["3216d7fb-388c-4939-9510-87d2bb0f74db"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Finalisation' est très pertinent car elle représente une étape clé où les résultats des tests sont intégrés avant la livraison finale du produit."}, {"concept": {"id": "a99118f8-3d0e-4517-88a1-b6e4a98947bc", "label": "Collaboration dans le développement logiciel", "definition": "La collaboration dans le développement logiciel désigne le processus par lequel plusieurs individus ou équipes, y compris les équipes de développement et d'exploitation, interagissent étroitement pour atteindre des objectifs communs. Ce partenariat actif favorise une responsabilité partagée pour les livraisons logicielles et améliore la compréhension mutuelle, permettant ainsi de résoudre rapidement les problèmes. La collaboration implique un échange d'idées enrichissant, facilitée par des outils numériques, qui transforme les relations traditionnelles en un environnement d'innovation et de partage. Elle se caractérise également par une interaction continue entre membres d'une équipe, favorisant le partage de code et la résolution rapide des conflits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697, 13698, 13639, 13609, 13642, 13644, 13679], "aliases": ["6b2d0d61-bbc2-483a-9010-65679e414f4e", "67c9c2cc-8f9b-438a-9473-51116617429e", "baeae1c8-e8b7-4df0-a247-1b2fbcc50f47", "fa6521ce-6e4a-4aa4-b28b-2b80db1c075a", "795c3c40-5626-4e38-93f5-187486671c03", "300b92cd-5329-4dda-8ecb-d8f1026344e4", "552493e2-b80a-4ed6-a462-ffd54ddeb69a", "0a19e2ae-f21e-40e1-93a8-51f1b84ba106"], "wikientity": {"label": "Collaboration", "definition": "La collaboration est l'acte de travailler ou de réfléchir ensemble pour atteindre un objectif. \nDans son sens commun, la collaboration est un processus par lequel deux ou plusieurs personnes ou organisations s’associent pour effectuer un travail  intellectuel suivant des objectifs communs.\nDes méthodes structurées de collaboration encouragent l'introspection de comportements et communication.", "page_id": "1104659", "wikidata_id": "Q1145523", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Collaboration", "definition": "a cooperative relationship between people or groups who agree to share responsibility for achieving some specific goal", "name": "partnership.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La collaboration dans le développement logiciel est essentielle pour tester et intégrer efficacement un logiciel, car elle favorise la communication entre les équipes et permet de résoudre rapidement les problèmes rencontrés lors du déploiement."}, {"concept": {"id": "4ea86225-9e30-4861-95f0-0ae6616673ad", "label": "Bonnes pratiques UI", "definition": "Des recommandations pour optimiser l'utilisation des couleurs et autres éléments graphiques afin d'améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les bonnes pratiques UI sont très pertinentes pour tester un logiciel afin d'assurer une expérience utilisateur optimale lors du déploiement et intégration d'applications."}, {"concept": {"id": "6f331ec9-8301-4698-be14-1c6426cb04e9", "label": "Techniques de Production", "definition": "Méthodes utilisées pour réaliser des projets graphiques, incluant les normes prépresse et les fichiers de fabrication adaptés aux différents supports.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13701], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Techniques de Production' sont très pertinentes car elles englobent les méthodes nécessaires pour réaliser et tester efficacement un projet graphique ou logiciel."}, {"concept": {"id": "ae467590-b74a-463a-8b8f-0d480a17c50a", "label": "Gestion de projet", "definition": "La gestion de projet est une discipline qui consiste à appliquer des connaissances, compétences et techniques pour planifier, exécuter et superviser des projets afin d'atteindre des objectifs spécifiques dans un cadre temporel défini. Elle implique l'organisation et la planification des ressources tout en respectant les contraintes budgétaires, et elle est particulièrement cruciale dans divers domaines, y compris le domaine créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13698, 13682, 13701], "aliases": ["232cece6-e141-4a95-9074-9c0f3fa70420", "4e6d523f-1898-42bd-8663-8d1982f44771", "14b98af1-6aaa-43a4-b8a5-8b6c40a54ef9"], "wikientity": {"label": "Gestion de projet", "definition": "La gestion de projet, est l'ensemble des activités visant à organiser le bon déroulement d’un projet et à en atteindre les objectifs en temps et en heures selon les objectifs visés. Elle consiste à appliquer les méthodes, techniques, et outils de gestion spécifiques aux différentes étapes du projet, de l'évaluation de l'opportunité jusqu'à l'achèvement du projet.\nCette activité porte également le nom de conduite de projet, pilotage de projet, ingénierie de projet, ou encore management de projet.", "page_id": "27967", "wikidata_id": "Q179012", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La gestion de projet est cruciale pour le déploiement et l'intégration de systèmes d'information, car elle assure que les objectifs sont atteints dans les délais impartis."}, {"concept": {"id": "5d7d25af-0d81-4a1a-9fc1-c3d8e20c5b55", "label": "Synthèse de projet", "definition": "Résumé des étapes clés et des résultats d'un projet, permettant une évaluation rapide de son déroulement et de ses conclusions.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13690], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La synthèse de projet permet une évaluation rapide des résultats et étapes clés, ce qui est utile lors du test et du suivi des projets informatiques."}, {"concept": {"id": "dfa4d6bf-809a-47df-9cc9-6aa99fb516b2", "label": "Cloud computing", "definition": "Un service permettant le stockage et l'accès à des données via Internet, facilitant la collaboration et la sauvegarde des fichiers entre équipes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": {"label": "Cloud computing", "definition": "Le cloud computing (/klaʊd kəmˈpjuːtɪŋ/), en français l'informatique en nuage, (ou encore l'infonuagique au Canada), est la pratique consistant à utiliser des serveurs informatiques à distance, hébergés dans des centres de données connectés à Internet pour stocker, gérer et traiter des données, plutôt qu'un serveur local ou un ordinateur personnel.\nLes principaux services proposés en cloud computing sont le SaaS (Software as a Service), le PaaS (Platform as a Service) et le IaaS (Infrastructure as a Service) ou le MBaaS (Mobile Backend as a Service (en)). On distingue généralement trois types de cloud : le cloud public — accessible par Internet —, le cloud d'entreprise ou privé — accessible uniquement sur un réseau privé —, le cloud intermédiaire ou hybride — qui est une combinaison entre le cloud public et le cloud privé.", "page_id": "3166139", "wikidata_id": "Q483639", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le cloud computing est très pertinent car il facilite la collaboration et le stockage lors du déploiement et de l'intégration d'applications logicielles."}, {"concept": {"id": "b7526477-65bb-452f-a068-5d83bd100ed1", "label": "Projet web", "definition": "Ensemble des activités liées à la création et au développement d'un site internet ou d'une application en ligne.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13681], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un projet web inclut souvent des phases de tests pour les applications et systèmes développés, ce qui en fait un concept pertinent."}, {"concept": {"id": "16384365-b375-49f3-af7d-26f647af9d38", "label": "Real Time Clarity", "definition": "Capacité à obtenir une compréhension immédiate et précise des données ou situations actuelles pour une prise de décision rapide.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La Real Time Clarity est très pertinente car elle permet une prise de décision rapide lors des tests et de l'intégration d'un logiciel, ce qui est crucial dans le contexte donné."}, {"concept": {"id": "3c0fff2a-064d-4ce2-803c-abb4d7b1c5ed", "label": "dossier de présentation", "definition": "Document structuré présentant un projet ou une entreprise, essentiel pour communiquer des idées et convaincre des clients potentiels.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13683], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Dossier de présentation' est pertinent car il aide à communiquer efficacement sur le projet avant son déploiement et peut influencer les tests initiaux."}, {"concept": {"id": "744dcb82-ca7e-480c-9ecc-b25dbb06ed5e", "label": "Rendu Noté", "definition": "Évaluation formelle d'un travail ou projet soumis, souvent accompagnée de commentaires sur sa qualité et son adéquation aux attentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le rendu noté est très pertinent car il implique l'évaluation des résultats des tests effectués sur un logiciel ou système."}, {"concept": {"id": "780d4fd9-d834-412c-afbb-91000931380c", "label": "Table des matières", "definition": "Liste structurée des sections d'un document, permettant aux lecteurs de naviguer facilement entre les différentes parties.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13687], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Table des matières", "definition": "a list of divisions (chapters or articles) and the pages on which they start", "name": "contents.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Une table des matières aide à naviguer dans un document technique, ce qui est très pertinent pour tester et intégrer un logiciel ou un système d'information."}, {"concept": {"id": "bf9dcd29-03f3-4cd8-a076-8331895e019d", "label": "KPI (Indicateurs Clés de Performance)", "definition": "Les KPI, ou Indicateurs Clés de Performance, sont des mesures quantifiables utilisées pour évaluer le succès et l'efficacité d'un produit, service ou stratégie marketing. Ils jouent un rôle essentiel dans le suivi des performances des équipes, notamment dans les objectifs DevOps, en facilitant la prise de décisions éclairées et en permettant d'ajuster les actions si nécessaire.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676, 13644], "aliases": ["87e70941-61ac-4056-9449-16f5a2eb30de", "73f1aa64-cede-40bc-b84c-46a66b3d5549"], "wikientity": {"label": "Indicateur clé de performance", "definition": "Un indicateur clé de performance (ICP) – en anglais : key performance indicator (KPI) – est un indicateur utilisé pour l'aide à la décision dans les organisations. Les ICP sont utilisés particulièrement en gestion de la performance organisationnelle.", "page_id": "1432151", "wikidata_id": "Q860554", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les KPI sont essentiels pour évaluer l'efficacité des tests et le succès du déploiement d'un logiciel ou d'un système d'information, ce qui en fait un concept très pertinent."}, {"concept": {"id": "00522abb-60ff-48e1-b79b-47f8a1110004", "label": "Validation client", "definition": "La validation client est le processus par lequel un client approuve une proposition ou un projet avant sa finalisation, garantissant que ses attentes sont satisfaites.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13694], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La validation client est pertinente car elle assure que le logiciel ou système développé répond aux attentes des utilisateurs avant sa mise en production, ce qui est crucial dans le contexte de tests."}, {"concept": {"id": "46f98aa1-718b-4130-a429-5e0c698e2f72", "label": "Design Thinking", "definition": "Méthodologie centrée sur l'utilisateur visant à résoudre des problèmes complexes par l'empathie, la définition, l'idéation, le prototypage et le test.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680], "aliases": [], "wikientity": {"label": "Démarche design", "definition": "Une démarche design ou conception créative (en anglais : design thinking) est une méthode de gestion de l'innovation élaborée à l'université Stanford aux États-Unis dans les années 1980 par Rolf Faste.\nCette méthode, qui se veut une synthèse entre pensée analytique et pensée intuitive, relève du design collaboratif, pratique du design qui implique les usagers dans un processus de co-créativité.", "page_id": "7876435", "wikidata_id": "Q1200670", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le Design Thinking est pertinent car il inclut des étapes comme le test qui sont essentielles dans le cadre du développement et de l'intégration de logiciels, en mettant l'accent sur l'utilisateur."}, {"concept": {"id": "0edf2749-c81c-43eb-9df3-80cccb6cce55", "label": "Organiser", "definition": "Disposer des éléments de manière structurée pour améliorer la clarté et la lisibilité des informations présentées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13691], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Organiser", "definition": "put into a proper or systematic order", "name": "arrange.v.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "'Organiser' est essentiel dans le cadre du déploiement et de l'intégration, car une bonne organisation améliore la clarté et la lisibilité des informations à tester."}, {"concept": {"id": "04b4d2d3-d76f-4351-9ee6-3cab4d64baeb", "label": "Bons à Tirer (BAT)", "definition": "Documents finaux approuvés et validés par le client avant impression, garantissant que tous les éléments sont corrects, conformes aux attentes et servant de référence pour la qualité et les spécifications du produit final.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13698, 13684], "aliases": ["796ffff5-ffc0-4de5-88fc-806bbf131e9f"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les Bons à Tirer (BAT) sont importants pour valider les éléments avant le lancement, ce qui a une certaine pertinence dans le cadre des tests finaux."}, {"concept": {"id": "e7135db8-6662-4cf1-a1eb-f53f50d8cb30", "label": "Évaluation des coûts", "definition": "Analyse des dépenses liées à un projet, incluant matériaux et main-d'œuvre, pour assurer la viabilité financière.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13682], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'évaluation des coûts est pertinente pour s'assurer que le projet reste viable financièrement lors du déploiement d'un système d'information."}, {"concept": {"id": "18cac88f-1d4a-42aa-9aa0-7e7d69d7d9b1", "label": "PréPresse", "definition": "Phase de préparation des fichiers avant impression, où les fichiers sont vérifiés et ajustés selon les normes spécifiques et techniques pour garantir une qualité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13701], "aliases": ["de12ea14-2a9e-4184-aed3-cee837d5fc32"], "wikientity": {"label": "Prépresse", "definition": "Le prépresse (ou préimpression) regroupe l’ensemble des opérations qui précèdent l’impression d’un document. Ces diverses opérations consistent à mettre en page et assembler des documents graphiques afin de produire des plaques d'impression ou autres formes imprimantes qui seront montées sur une presse à imprimer. Les documents graphiques sont assemblés sur ordinateur à l’aide de logiciels de PAO (publication assistée par ordinateur), réservés à cet effet.", "page_id": "854800", "wikidata_id": "Q389675", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La phase PréPresse est importante pour garantir la qualité avant impression, mais elle a une pertinence limitée par rapport aux tests logiciels."}, {"concept": {"id": "8c7b17fe-658b-45cc-a0d4-1d71af2d91bf", "label": "Prototype Mockup", "definition": "Un prototype mockup est une représentation visuelle ou interactive d'un produit qui simule son apparence et son fonctionnement réel. Il permet aux utilisateurs de tester des concepts et de fournir des retours avant le développement final. Contrairement à un mockup statique, qui illustre uniquement l'impact visuel sans interactivité, le prototype mockup intègre des éléments de design tout en offrant une expérience utilisateur plus immersive, servant ainsi à démontrer le design et les fonctionnalités potentielles avant la production finale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13683], "aliases": ["4a71ddc6-3b7c-423d-8a1c-69128fe83586", "0b196773-99b7-4918-9cfc-5deb0a101c35", "e74bec6f-5a73-49fd-b5eb-b8046119c179"], "wikientity": {"label": "Mock-up", "definition": "En informatique, le terme mock-up (qui vient du même mot anglais qui signifie une maquette à l'échelle 1:1) désigne un prototype d'interface utilisateur. Un mock-up a ainsi pour rôle de présenter les idées sur l'utilisation d'un logiciel.\nDu point de vue matériel, un mock-up se caractérise par le fait d'être un modèle visuel esthétique, fixe ou sous forme de vidéo, qui peut être modifié aux fins de personnalisation, souvent des textes.", "page_id": "1258223", "wikidata_id": "Q1933427", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Un prototype mockup est essentiel pour tester une application avant son développement final, ce qui en fait un concept pertinent dans le contexte du déploiement et de l'intégration."}, {"concept": {"id": "c3fa5716-aedd-4faf-a2f9-b805c8102d83", "label": "Lexique client", "definition": "Ensemble de termes spécifiques utilisés par le client, révélant ses priorités et nuances essentielles pour comprendre son brief.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13679], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un lexique client peut aider à comprendre les attentes et exigences lors du test d'un logiciel, bien qu'il ne soit pas central au processus lui-même."}, {"concept": {"id": "75c8d589-3901-4dbd-b388-fb848cac44ad", "label": "Nommer les Dossiers", "definition": "Pratique d'attribuer des noms clairs et logiques aux fichiers numériques pour faciliter leur identification et leur organisation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13698], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Nommer les dossiers aide à organiser les fichiers liés au projet, ce qui est important pour la gestion efficace lors du test et du déploiement des systèmes."}, {"concept": {"id": "1ef72a7e-5e74-4275-8671-d3b08e7e6482", "label": "Design System", "definition": "Un design system est une bibliothèque standardisée d'éléments graphiques, de composants réutilisables et de règles de branding unifiées, qui assurent la cohérence visuelle et fonctionnelle dans le développement de produits, sites ou applications. Il vise à standardiser le développement et à garantir une expérience utilisateur homogène à travers plusieurs produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13700], "aliases": ["9dbaffae-3852-4454-b66b-2adfc8c61863", "959c321e-cd66-4ef2-beec-74a58976030e"], "wikientity": {"label": "Système de design", "definition": "Un système de design, un système de conception ou un design system est un ensemble de composants réutilisables et de normes claires qui peuvent être assemblés pour créer un nombre illimité d'applications. Les systèmes de design aident à la conception de produits numériques et au développement de produits tels que des applications mobiles ou des sites Web. Ils peuvent contenir, sans toutefois s'y limiter, des bibliothèques de modèles/composants, des dictionnaires de conception, des guides de style (police, couleur, espacement, placement), des composants codés, des langages de marque et de la documentation.", "page_id": "16328891", "wikidata_id": "Q81875083", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Un design system peut influencer l'expérience utilisateur et donc les tests d'interface, ce qui en fait un concept pertinent dans ce contexte."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La lisibilité est importante pour assurer une bonne communication dans les documents relatifs aux tests et intégrations, facilitant ainsi la compréhension des utilisateurs."}], "exercises": [{"exercise": {"id": "f73b609c41224a5eb611f366c35d9a2a", "question": "Quel critère doit être respecté pour rendre une application intuitive ?", "answers": ["Son fonctionnement doit être familier aux utilisateurs"], "distractors": ["Elle doit offrir de nombreuses options uniques d'interface", "Elle doit suivre les dernières tendances du marché", "Elle doit être visuellement impressionnante", "Sa conception doit ignorer les habitudes des utilisateurs", "Elle doit inclure toutes les fonctionnalités demandées par les développeurs", "Elle doit intégrer au moins deux modes de navigation", "Son design doit être avant-gardiste et innovant", "Son utilisation doit être complexe mais enrichissante", "Elle doit simuler des défis d’apprentissage pour les utilisateurs"], "feedback": "Respecter les habitudes des utilisateurs permet de rendre l'application intuitive car les utilisateurs seront familiers avec son fonctionnement et pourront l'utiliser facilement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la référence, à savoir l'importance de l'expérience utilisateur (UX) dans le développement d'applications et de systèmes d'information. La question cible spécifiquement un critère fondamental pour rendre une application intuitive, ce qui est directement lié à la conception UX mentionnée dans la synthèse. La réponse correcte souligne que le fonctionnement doit être familier aux utilisateurs, ce qui reflète bien les principes de conception centrée sur l'utilisateur. Cependant, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à la gestion de projet ou à la validation client pour couvrir plus largement les concepts abordés dans la référence."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. La question cible un aspect clé mentionné dans la synthèse, qui souligne que l'UX est au cœur du succès d'une application. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires liés à la gestion de projet ou à la validation client pour couvrir plus largement les concepts abordés dans la référence."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du déploiement et de l'intégration d'un logiciel ou d'un système d'information. En demandant à l'apprenant de valider une affirmation sur les éléments ergonomiques en lien avec les usagers, il teste leur capacité à relier la conception UX aux besoins des utilisateurs, ce qui est un aspect clé mentionné dans la synthèse. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects du déploiement et de l'intégration, comme la gestion de projet ou la validation client, ce qui empêche une note parfaite."}, {"exercise": {"id": "5e5e624e0c9749189df302e3a469edd0", "statement": "Une application intuitive fonctionne de manière proche des habitudes déjà acquises par les utilisateurs.", "veracity": true, "feedback": "L'énoncé est correct car il est recommandé de concevoir une application qui se rapproche du mode de fonctionnement auquel les utilisateurs sont déjà habitués, pour éviter des difficultés inutiles dans l'utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. L'affirmation met en avant un aspect clé de la conception UX, qui est d'adapter les interfaces aux habitudes des utilisateurs pour faciliter leur utilisation. Cependant, bien que pertinent, l'exercice ne couvre pas entièrement tous les aspects mentionnés dans la référence, tels que la gestion de projet ou la validation client. Il se concentre principalement sur un seul élément (l'intuitivité), ce qui limite légèrement sa portée par rapport à l'ensemble des concepts abordés dans la synthèse."}, {"exercise": {"id": "5c99b0872ad447488fc21208ec035890", "statement": "La constance dans l'utilisation d'icônes universelles permet d'améliorer l'intuitivité d'une interface.", "veracity": true, "feedback": "L'emploi d'icônes avec une signification établie, connue des utilisateurs, permet de maintenir une interface intuitive. Cela évite de réinventer sans raison des éléments qui ont déjà fait leurs preuves dans la compréhension utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) et des bonnes pratiques UI dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. En se concentrant sur l'utilisation d'icônes universelles pour améliorer l'intuitivité d'une interface, il touche directement à un aspect clé de la conception UX mentionné dans la synthèse. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects liés à la gestion de projet ou à la validation client, ce qui empêche une note parfaite."}, {"exercise": {"id": "f7db6816b25d40e7b88284be2d31d0ac", "statement": "Les utilisateurs préfèrent des icônes nouvelles et originales plutôt que celles établies pour mieux comprendre leur fonction.", "veracity": false, "feedback": "Au contraire, il est mentionné que les icônes ayant une signification établie sont déjà connues des utilisateurs et qu'il est risqué d'en créer de nouvelles. Le changement pourrait rendre l'interface moins intuitive et désorienter les utilisateurs, ce qui est à éviter pour ne pas les faire fuir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de l'expérience utilisateur (UX) et de l'importance d'utiliser des icônes établies pour garantir une interface intuitive. Cela est en lien direct avec la référence qui aborde la conception UX et son impact sur la satisfaction des utilisateurs finaux. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments relatifs à la gestion de projet ou à l'intégration des systèmes, ce qui lui aurait permis d'obtenir un score parfait."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) et des bonnes pratiques d'interface utilisateur (UI), qui sont des concepts clés mentionnés dans la synthèse. En affirmant que le respect des normes de clarté et de cohérence est essentiel pour éviter de perdre l'utilisateur, l'exercice touche directement à la notion d'optimisation des interactions entre l'utilisateur et le produit. Cependant, il pourrait être amélioré en intégrant davantage d'aspects liés à la gestion de projet ou à la validation client, ce qui lui aurait permis d'obtenir une note plus élevée."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception UX, qui sont essentiels pour tester et déployer un logiciel ou une application. En se concentrant sur l'importance de la visibilité des fonctions clés d'une interface, il touche directement à l'objectif d'optimiser l'expérience utilisateur, un concept central dans la référence. Cependant, bien que pertinent, l'exercice ne couvre pas explicitement tous les aspects liés à la gestion de projet ou à l'intégration des systèmes d'information, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "0795d63dad7948209328243c6629257d", "question": "Quel aspect encourage DevOps entre les différentes équipes ?", "answers": ["Il favorise une collaboration étroite pour une meilleure compréhension mutuelle"], "distractors": ["Il diminue la collaboration pour améliorer l'efficacité individuelle.", "Il encourage les équipes à travailler en isolation pour réduire les conflits internes.", "Il impose une stricte hiérarchie pour éviter les malentendus.", "Il augmente la distance entre les équipes pour préserver leur spécialisation.", "Il se concentre sur la soumission rapide sans prise en compte des autres équipes.", "Il crée des barrières pour protéger chaque équipe dans ses propres protocoles.", "Il garantit l'anonymat des membres d'équipe pour maximiser la concentration.", "Il perfectionne les procédures de validation individuelle, avant d'impliquer les autres.", "Il encourage uniquement la communication formelle et évite les échanges informels."], "feedback": "Une collaboration étroite entre les équipes permet une meilleure compréhension mutuelle et une résolution plus rapide des problèmes grâce à un échange d'informations et d'idées plus régulier et efficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "0fbe813d64e547118a1a4c3d83b34654", "order": 14.0, "image_url": null, "origin_type": "document_content", "text": "L'automatisation réduit la dépendance à l'égard des tâches manuelles, réduisant ainsi les erreurs humaines et améliorant la stabilité du système. DevOps encourage la collaboration étroite entre les équipes, ce qui améliore la compréhension mutuelle et la résolution rapide des problèmes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fc16ad597b574399807e7ead06da6884", "next_id": null, "prev_id": "fc16ad597b574399807e7ead06da6884", "associated_block_ids": [], "first_page": 1, "last_page": 2, "start_time": null, "end_time": null, "doc_id": 13642, "doc_label": "A4 - Cours Intro Culture Devops", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la collaboration entre les équipes dans le contexte du développement logiciel, ce qui est un aspect clé de la référence sur le déploiement et l'intégration des systèmes d'information. La question cible spécifiquement comment DevOps encourage cette collaboration, ce qui est pertinent pour assurer une intégration réussie des logiciels. Cependant, bien que cela soit lié à la gestion de projet et à l'expérience utilisateur, l'exercice pourrait être amélioré en incluant des éléments plus directement liés à la validation client ou aux bonnes pratiques UX mentionnées dans la synthèse."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'étude des usagers dans le cadre d'un référentiel ergonomique, ce qui est pertinent pour le contexte de déploiement et d'intégration d'un logiciel ou d'une application. L'expérience utilisateur (UX) est un aspect clé mentionné dans la synthèse, et cet exercice teste la connaissance des priorités en matière de conception UX. Cependant, il pourrait être amélioré en intégrant des éléments plus directement liés à la gestion de projet ou à l'intégration technique, car il se concentre principalement sur un aspect spécifique de l'ergonomie sans aborder les autres dimensions importantes du déploiement et de l'intégration."}, {"exercise": {"id": "e846ef0159d94e02a46b826e22c81e6b", "question": "Pour améliorer la compréhension d'une interface, que faut-il respecter principalement ?", "answers": ["La hiérarchie visuelle et l'ordre de lecture de l'utilisateur"], "distractors": ["Les polices de caractères artistiques et les animations interactives.", "Les couleurs de fond claires avec des éléments graphiques complexes.", "L'intégration de plusieurs menus déroulants imbriqués.", "L'affichage direct de plusieurs options techniques avancées.", "La quantité maximale d'informations sur une seule ligne.", "L'utilisation d'icônes réduites pour chaque section.", "Le positionnement aléatoire des boutons d'action.", "L'ajout de contenu vidéo en arrière-plan.", "La mise en place d'un menu global en bas de page."], "feedback": "Pour améliorer la compréhension d'une interface, il est important de respecter la hiérarchie entre les éléments visuels et de suivre l'ordre de lecture de l'utilisateur. Cela permet une meilleure compréhension de l'action à effectuer et facilite ainsi son utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des principes de conception UX, en particulier la hiérarchie visuelle et l'ordre de lecture, qui sont essentiels pour optimiser l'expérience utilisateur d'une application ou d'un système d'information. Bien que cela soit pertinent par rapport à la référence sur le déploiement et l'intégration de logiciels, l'exercice ne couvre pas directement les aspects liés à la gestion de projet, à la validation client ou à la collaboration entre équipes. Il se concentre principalement sur un aspect spécifique de l'UX, ce qui limite sa portée par rapport aux objectifs globaux mentionnés dans la référence."}, {"exercise": {"id": "4570d883513647c595941a5d33546fc8", "question": "Pourquoi est-il risqué de réinventer une icône connue par les utilisateurs ?", "answers": ["Cela peut désorienter l'utilisateur et nuire à son expérience"], "distractors": ["Cela permet d'améliorer l'expérience utilisateur immédiatement.", "Cela rend l'interface plus créative et intuitive.", "Cela aide l'utilisateur à mieux comprendre les nouvelles fonctionnalités.", "Cela garantit une meilleure interaction avec la technologie.", "Cela simplifie l'utilisation des options avancées pour les experts.", "Cela permet de se différencier de la concurrence.", "Cela assure une compatibilité optimale avec toutes les interfaces existantes.", "Cela accroît la flexibilité de conception dans les interfaces complexes.", "Cela améliore la lisibilité générale des informations présentées à l'écran."], "feedback": "Les icônes familières sont facilement reconnaissables par les utilisateurs et leur permettent de comprendre rapidement comment utiliser une fonctionnalité sans avoir à apprendre de nouvelles représentations visuelles. Modifier une icône peut donc désorienter l'utilisateur et nuire à son expérience.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du développement d'applications et de systèmes d'information, ce qui est pertinent par rapport à la référence. La question posée sur les risques de réinventer une icône connue touche directement à la conception UX et à la manière dont cela peut affecter l'interaction utilisateur. Cependant, bien que cela soit un aspect clé, l'exercice ne couvre pas entièrement les autres éléments mentionnés dans la référence, tels que la gestion de projet ou la validation client. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. En demandant aux apprenants de compléter une phrase sur les conséquences d'une mauvaise adaptation du contenu aux appareils mobiles, il teste leur capacité à relier les concepts d'UX à des résultats concrets pour les utilisateurs. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects clés mentionnés dans la référence, tels que la gestion de projet ou la validation client. Il se concentre principalement sur un aspect spécifique de l'UX sans aborder les autres dimensions importantes du déploiement et de l'intégration."}, {"exercise": {"id": "76bdc1cfb02b421aa9ebecc7377c69b5", "query": "Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que <blank>.", "answers": ["vos utilisateurs ont l'habitude de côtoyer"], "distractors": [["les tendances du marché exigent", "les concepteurs jugent innovant", "vous voulez proposer", "la concurrence met en avant", "les experts considèrent optimal", "les nouveaux standards recommandent"]], "feedback": "L'application doit fonctionner en s'appuyant sur ce que les utilisateurs connaissent déjà ou ont l'habitude d'utiliser. Cela rend l'expérience plus fluide et intuitive, évitant des frustrations liées à un trop grand changement ou à des nouveautés inutiles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le développement d'une application, ce qui est un aspect clé du contexte de déploiement et d'intégration d'un logiciel ou d'un système d'information. En demandant aux apprenants de compléter une phrase sur le fonctionnement intuitif d'une application, il les incite à réfléchir à la manière dont les utilisateurs interagissent avec des interfaces familières. Cependant, l'exercice pourrait être amélioré en intégrant davantage de concepts liés à la gestion de projet ou à la validation client, qui sont également cruciaux dans le contexte donné. Cela explique pourquoi il ne reçoit pas une note maximale."}, {"exercise": {"id": "1e323418b9b0437f90ae3d1aa34b751e", "statement": "L'optimisation d'un système d'information est uniquement liée à l'expérience utilisateur (UX).", "veracity": false, "feedback": "L'optimisation d'un système d'information est un processus qui englobe plusieurs aspects, y compris l'expérience utilisateur (UX), mais aussi le code partagé et d'autres éléments techniques. Ce n'est donc pas uniquement associé à l'UX.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7ef1c347f92242c4a3ba9cd9ea3f5492", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "o Un web très concurrentiel (MARKETING) :unselected:o Un web de plus en plus exigent de la part des usagers (UX) :unselected:o Une obligation de visibilité (SEO) :unselected:o A la recherche d'une croissance ou de part de marché inexploitée (ACCESSIBILITE) :unselected: :unselected:o Sécurisation et productivité d'un système d'information (UX, CODE PARTAGE, OPTIMISATION) o Une problématique grandissante autour de la protection de la donnée personnelle (RGPD) :unselected:o Un devoir éthique autour l'accessibilité :unselected:o Un devoir éthique autour de l'éco responsabilité :unselected: :unselected:o ..", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3a04837d7dcd40d3aa0607e1b13a98da", "next_id": "20ea402f1e1c41a68ea9813f00d5df04", "prev_id": "3a04837d7dcd40d3aa0607e1b13a98da", "associated_block_ids": [], "first_page": 14, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension de l'importance de l'expérience utilisateur (UX) dans le cadre plus large de l'optimisation d'un système d'information. Bien que l'affirmation porte sur un aspect spécifique, elle permet d'évaluer si l'apprenant reconnaît que l'optimisation ne se limite pas à l'UX, mais inclut également des éléments techniques et fonctionnels. Cela correspond à la référence qui aborde la gestion des systèmes d'information et leur intégration. Cependant, il aurait été encore plus pertinent si l'exercice avait inclus des questions sur les autres aspects mentionnés dans la synthèse, comme la gestion de projet ou la validation client."}, {"exercise": {"id": "2f9b8c77092542f7b1b9ff425a63a1c1", "statement": "La hiérarchie entre les éléments d'une interface aide à mieux comprendre les actions à réaliser.", "veracity": true, "feedback": "Il est exact que la hiérarchie entre les différents éléments permet une meilleure compréhension des actions à entreprendre. Cette organisation guide l'utilisateur dans son parcours, rendant l'expérience plus fluide et intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de la hiérarchie dans une interface utilisateur, ce qui est un aspect clé de l'expérience utilisateur (UX) mentionnée dans la synthèse. Bien que cela soit pertinent pour le déploiement et l'intégration d'un logiciel ou d'une application, l'exercice ne couvre pas directement les autres éléments cruciaux tels que la gestion de projet, la validation client ou la collaboration entre équipes. Il se concentre principalement sur un aspect spécifique de l'UX sans aborder les dimensions plus larges du contexte donné. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "a979f369544e4c46b0a02f5ae402fb4c", "question": "Quelle implication découle de l'application de la loi de Fitts en matière d'interface ?", "answers": ["Les fonctions clés doivent être plus visibles pour l'utilisateur"], "distractors": ["Toutes les fonctions ont la même importance dans une interface", "Le nombre de boutons doit être réduit au minimum", "Le positionnement des fonctions n’impacte pas l’expérience utilisateur", "Seules les fonctions secondaires doivent être mises en avant", "Une interface doit limiter les interactions à deux clics maximum", "Un design fluide est plus important que la hiérarchie des fonctions", "Le choix des couleurs prime sur la taille des éléments", "Les fonctions non-essentielles doivent être masquées", "Le texte explicatif améliore toujours l'expérience utilisateur"], "feedback": "La loi de Fitts met en avant l'importance de rendre les fonctions clés plus visibles pour l'utilisateur en les représentant de manière plus impactante. Les distracteurs proposés sont soit inexistants, soit contradictoires avec cette implication.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect important de l'expérience utilisateur (UX) en se concentrant sur la loi de Fitts, qui est pertinente pour la conception d'interfaces dans le cadre du déploiement et de l'intégration d'applications. Cependant, bien que cela touche à la visibilité des fonctions clés, l'exercice ne couvre pas directement les autres éléments cruciaux mentionnés dans la référence, tels que la gestion de projet ou la validation client. Il évalue donc une partie essentielle mais limitée des concepts abordés dans la référence."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'expérience utilisateur (UX), qui est essentiel lors du déploiement et de l'intégration d'un logiciel ou d'une application. La question posée sur ce qu'il faut éviter pour ne pas perdre l'utilisateur se rapporte directement à la conception UX, un concept clé mentionné dans la synthèse. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects liés à la gestion de projet et à la validation client évoqués dans la référence. Il se concentre principalement sur les normes de design sans explorer davantage le contexte plus large du déploiement et de l'intégration des systèmes d'information. Cela limite sa portée par rapport aux objectifs globaux de la référence."}, {"exercise": {"id": "0ad7750deb404ae5be380e32742f44eb", "question": "Quelle erreur courante est commise par les concepteurs lors du développement d'applications ?", "answers": ["Ajouter des fonctionnalités sans valeur ajoutée"], "distractors": ["Oublier l'optimisation SEO", "Ignorer la vitesse de chargement", "Concevoir uniquement pour le bureau", "Ne pas tester sur tous navigateurs", "Négliger le design visuel", "Utiliser trop d'images de fond", "Développer uniquement pour iOS", "Prioriser la publicité", "Ne pas intégrer le HTTPS"], "feedback": "La bonne réponse souligne une erreur courante chez les concepteurs lors du développement d'applications, qui consiste à ajouter des fonctionnalités qui n'apportent pas de valeur ajoutée pour l'utilisateur. Les distracteurs proposent différentes erreurs courantes mais ne font pas référence à l'ajout de fonctionnalités sans valeur ajoutée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent du développement d'applications, en se concentrant sur l'importance de la valeur ajoutée des fonctionnalités. Cela est lié à l'expérience utilisateur (UX) mentionnée dans la synthèse, qui souligne que la conception doit optimiser les interactions et répondre aux besoins des utilisateurs. Cependant, l'exercice ne teste pas directement les compétences liées à la gestion de projet ou à l'intégration d'un logiciel, qui sont également des éléments clés de la référence. Par conséquent, bien qu'il soit pertinent, il ne couvre pas entièrement tous les aspects importants de la référence."}, {"exercise": {"id": "dbb27c80aef2481a83eb194c820018ca", "query": "Selon les principes ergonomiques, un utilisateur ne devrait pas attendre plus de <blank> pour certaines réponses du système, comme le passage d'une application à une autre.", "answers": ["2 secondes"], "distractors": [["3 secondes", "5 secondes", "1 seconde", "10 secondes", "500 millisecondes", "4 secondes"]], "feedback": "La durée de 2 secondes est considérée comme un délai raisonnable pour des actions telles que le changement d'application ou le lancement d'un programme. Ce temps permet d'assurer une réactivité suffisamment rapide pour maintenir l'utilisateur engagé sans provoquer de frustration liée à un temps d'attente trop long.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des principes ergonomiques liés à l'expérience utilisateur (UX), qui est un aspect important lors du déploiement et de l'intégration d'un logiciel ou d'une application. Cependant, il ne couvre pas directement les concepts clés mentionnés dans la référence, tels que la gestion de projet, le suivi des progrès ou la validation client. Bien qu'il soit pertinent pour l'UX, il manque une connexion plus forte avec les autres éléments essentiels du contexte de déploiement et d'intégration des systèmes d'information."}, {"exercise": {"id": "a7ed5fd278444bf88b94b4a8dc1d34f9", "query": "88% des utilisateurs sont moins susceptibles de retourner sur un site après <blank>.", "answers": ["une mauvaise expérience"], "distractors": [["une bonne expérience", "une navigation rapide", "un service client efficace", "avoir reçu une promotion", "une transaction réussie", "une interface conviviale"]], "feedback": "La réponse correcte est 'une mauvaise expérience' car elle affecte négativement la fidélité des clients, les rendant moins susceptibles de revenir. Les autres options évoquent au contraire des éléments positifs qui renforcent généralement la satisfaction des utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3eeb01e631334863a4262ca1f1c62f75", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "· Fidélité des clients : 88% des utilisateurs sont moins susceptibles de retourner sur un site après une mauvaise expérience. (Source : The Gomez report, Why Web Performance Matters) · Recommandations : Les utilisateurs satisfaits sont plus susceptibles de recommander un produit, ce qui peut augmenter le bouche-à-oreille positif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3d0a5b972ae14aa8becba05987baea25", "next_id": "7947651498ce458cb77a99d5f60f1cce", "prev_id": "a2bd4331283b4f7fad7b7863cddd176d", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. Bien que cela soit pertinent pour le sujet, il ne couvre pas directement les aspects techniques ou organisationnels liés à la gestion de projet, à la planification ou à la validation client mentionnés dans la référence. L'exercice se concentre principalement sur un aspect spécifique de l'UX sans aborder les autres dimensions essentielles du processus de développement logiciel. Cela justifie une note relativement élevée mais pas maximale."}, {"exercise": {"id": "9262137caa5f4edd953268a1a20329a8", "statement": "Le temps d'attente idéal pour qu'une réponse système apparaisse est strictement de 2 secondes.", "veracity": false, "feedback": "Bien que 2 secondes soit un repère souvent utilisé, il s'agit d'un ordre de grandeur arbitraire. L'important est que le délai reste dans une durée raisonnable pour ne pas affecter l'expérience utilisateur, mais ce n'est pas un chiffre strict.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'expérience utilisateur (UX), qui est mentionné dans la synthèse. Il teste la compréhension des délais de réponse du système, ce qui est pertinent pour évaluer si le produit final répond aux attentes des utilisateurs. Cependant, l'exercice se concentre uniquement sur un point spécifique (le temps d'attente idéal) et ne couvre pas d'autres éléments clés tels que la gestion de projet, la collaboration ou la validation client. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects liés à la référence."}, {"exercise": {"id": "315cfc8b0c0a4c239408287509fd82a3", "statement": "L'ajout d'animations est utilisé uniquement pour rendre un site plus esthétique, sans impact sur l'expérience utilisateur.", "veracity": false, "feedback": "Bien que l'ajout d'animations puisse contribuer à l'esthétique d’un site Web, il ne se limite pas à cela. Les animations jouent également un rôle dans l'expérience utilisateur, en influençant potentiellement les émotions et les perceptions des utilisateurs dans les zones de conflit mentionnées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le développement d'un logiciel ou d'une application, ce qui est pertinent par rapport à la référence. Cependant, il se concentre spécifiquement sur les animations et leur impact sur l'esthétique et l'UX, ce qui n'aborde pas directement les concepts clés tels que la gestion de projet, la validation client ou l'intégration des systèmes. Bien qu'il soit lié à un aspect important de la conception UX, il ne couvre pas suffisamment les autres éléments essentiels mentionnés dans la synthèse."}, {"exercise": {"id": "148c4b83bbf346118ad01ba1e1886404", "statement": "Les fonctionnalités comme le menu, les liens internes, et le pied de page sont considérées comme des zones où l'utilisateur peut ressentir différentes émotions.", "veracity": true, "feedback": "Ces éléments techniques comme le menu, les liens internes ou le pied de page sont vus dans le contexte décrit comme des endroits où les utilisateurs peuvent vivre des émotions variées telles que succès, échec, intérêt, confiance ou suspicion. C'est une approche qui va au-delà d'une simple analyse fonctionnelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde des éléments liés à l'expérience utilisateur (UX), qui est un aspect important lors du déploiement et de l'intégration d'un logiciel ou d'une application. Cependant, il se concentre principalement sur les émotions ressenties par l'utilisateur face à des éléments spécifiques de l'interface, sans explorer en profondeur les concepts clés tels que la gestion de projet, la planification, ou la validation client mentionnés dans la référence. Bien qu'il soit pertinent pour le sujet de l'UX, il ne couvre pas suffisamment les autres dimensions essentielles liées au déploiement et à l'intégration d'un système d'information."}, {"exercise": {"id": "9658d6c80b9f4df48c99d7f3db50b327", "statement": "Les tendances dans la conception d'applications doivent toujours être suivies pour garantir une meilleure expérience utilisateur.", "veracity": false, "feedback": "Il est spécifiquement mentionné que les tendances ne doivent pas dicter la conception. Ce qui compte, c'est de créer une solution intuitive basée sur ce à quoi les utilisateurs sont habitués, afin de prévenir la frustration.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "316d631f8df640c2b90bcba50e6ec42f", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Solution bon marché mais si peu efficace sur le long terme ... les tendances ne doivent jamais faire loi dans votre processus de conception. Pour être intuitive, l'application doit offrir un fonctionnement proche de celui que vos utilisateurs ont l'habitude de côtoyer. Dans le cas contraire, l'expérience pourra être très frustrante pour eux.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6889e230bbb649d2941e0b1b59ca0f2a", "next_id": "ae199c6163954102b775df35bccedfc4", "prev_id": "6889e230bbb649d2941e0b1b59ca0f2a", "associated_block_ids": [], "first_page": 392, "last_page": 393, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du développement d'applications, ce qui est pertinent par rapport à la référence sur le déploiement et l'intégration des logiciels. Cependant, il se concentre principalement sur un aspect spécifique (les tendances en conception) plutôt que sur une évaluation globale des compétences nécessaires pour tester ou intégrer un logiciel. Bien qu'il aborde un concept clé, il ne couvre pas suffisamment les autres éléments importants mentionnés dans la synthèse, comme la gestion de projet ou la validation client."}, {"exercise": {"id": "74b93688d1464fd6b672785d4597f8ec", "statement": "Les concepteurs apportent systématiquement de la valeur ajoutée à leurs applications en ajoutant plus de fonctionnalités.", "veracity": false, "feedback": "En réalité, les concepteurs introduisent parfois des fonctionnalités supplémentaires qui complexifient le développement de l'application, sans forcément apporter de valeur ajoutée. Cela peut nuire à l'efficacité et à la simplicité de l'application.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'impact des fonctionnalités sur l'expérience utilisateur et la gestion de projet, ce qui est pertinent par rapport à la référence. Cependant, il ne couvre pas directement les aspects liés au déploiement ou à l'intégration d'un logiciel ou d'un système d'information. L'affirmation aborde un concept important concernant la valeur ajoutée des fonctionnalités, mais elle pourrait être plus directement liée aux processus de test et de validation client mentionnés dans la synthèse."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le design, ce qui est un aspect pertinent du déploiement et de l'intégration d'un logiciel ou d'une application. Cependant, il ne couvre pas directement les autres éléments clés mentionnés dans la référence, tels que la gestion de projet, la planification rigoureuse ou la validation client. Bien qu'il soit lié à un concept important pour le succès d'un système d'information, il ne teste pas suffisamment les compétences globales nécessaires pour tester un logiciel ou une application dans son ensemble."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension du concept de 'design' dans le contexte de l'expérience utilisateur (UX), qui est un aspect clé de la référence. Cependant, il ne couvre pas directement les autres éléments importants mentionnés dans la référence, tels que la gestion de projet, l'intégration des systèmes ou la validation client. Bien qu'il soit pertinent pour une partie du sujet, il n'évalue pas complètement tous les aspects essentiels liés au déploiement et à l'intégration d'un logiciel ou d'un système d'information."}, {"exercise": {"id": "1543b5dc9b3042f19ae1aa3cf53e3451", "question": "Que se passe-t-il si le design d’un système est trop simplifié pour l’utilisateur ?", "answers": ["La complexité se déplace vers celui qui gère le système"], "distractors": ["La fonctionnalité devient intuitive pour tous les utilisateurs du système.", "La gestion visuelle devient plus complexe à traiter pour tous.", "Le système devient inutilisable à cause de sa simplicité excessive.", "L'utilisateur bénéficie d'un contrôle caché supplémentaire.", "Les fonctionnalités sous-jacentes sont complètement éliminées.", "Le transfert de difficulté se résout facilement par un algorithme simple.", "La gestion technique devient plus transparente et facile.", "La simplification n'a aucun impact sur la gestion.", "Un équilibre est trouvé entre simplicité et performance pour l’utilisateur."], "feedback": "Si le design d'un système est trop simplifié pour l'utilisateur, la complexité sera déplacée vers celui qui le gère. En d'autres termes, la fonctionnalité peut devenir plus complexe à traiter pour l'utilisateur, tandis que la gestion technique peut devenir plus transparente et facile pour celui qui gère le système. Cela souligne l'importance de trouver un équilibre entre simplicité et performance pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7c32d0385f2d45a5b516ab34f571167c", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Cet effet s'explique par le fait que les éléments présentés en premier seront plus facilement enregistrés dans le mémoire à long terme, et ceux vus en dernier le seront dans la mémoire à court terme. Le design ne peut être simplifié que jusqu'à un certain point. A partir de ce point, la complexité ne sera que déplacée. Si le système doit être simplifié pour l'utilisateur, il sera peut être complexifié pour celui qui le gère. Le transfert de difficulté pour être sur la surface (visuel) ou bien caché (fonctionnalité sous-jacente).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "59870c9a6e264b4c960482f7bf62dade", "next_id": "68231e4ebb044b039db929d78725c81c", "prev_id": "a224bc099e774bf69891cc063f65488d", "associated_block_ids": [], "first_page": 55, "last_page": 60, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de la conception d'un système et son impact sur l'utilisateur, ce qui est pertinent dans le contexte de l'expérience utilisateur (UX) mentionnée dans la référence. Cependant, il ne teste pas directement les compétences liées à la gestion de projet ou à l'intégration d'un logiciel, qui sont également des aspects clés de la référence. Bien que l'exercice soit en lien avec un concept important (la simplification du design), il ne couvre pas suffisamment les autres éléments essentiels comme la validation client ou la collaboration entre équipes. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement tous les objectifs d'apprentissage liés à la référence."}, {"exercise": {"id": "41548d75a81a4ada9f8310827926ecef", "query": "Apple recommande que les boutons d'appel à l'action dans l'interface utilisateur mobile aient une taille minimale de <blank> pixels.", "answers": ["44 x 44"], "distractors": [["50 x 50", "34 x 26", "40 x 40", "48 x 48", "38 x 38", "36 x 36"]], "feedback": "La bonne réponse est '44 x 44'. Apple spécifie que, dans l'interface utilisateur mobile, la taille minimale d'un bouton d'appel à l'action doit être de 44 pixels de large et de 44 pixels de haut. Cela garantit une bonne visibilité et permet aux utilisateurs d'interagir facilement avec le bouton.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste un aspect spécifique de la conception d'interface utilisateur (UI) qui est pertinent pour l'expérience utilisateur (UX) dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. Cependant, il ne couvre pas directement les concepts plus larges de gestion de projet, de collaboration entre équipes ou de validation client mentionnés dans la synthèse. Bien qu'il soit utile pour évaluer la connaissance des bonnes pratiques UI, il ne permet pas d'évaluer pleinement la compréhension des objectifs globaux liés à la mise en œuvre d'un système d'information ou d'une application."}, {"exercise": {"id": "2e8282503d8d465cb75918606843cf30", "statement": "Un bouton d'appel à l'action trop grand peut nuire à la hiérarchie visuelle d'une mise en page.", "veracity": true, "feedback": "Un bouton trop grand peut effectivement perturber la composition visuelle et altérer la hiérarchie de la mise en page, ce qui rendrait l'interface utilisateur moins harmonieuse et ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de la conception UX et des bonnes pratiques UI, qui sont des éléments clés dans le contexte du déploiement et de l'intégration d'un logiciel ou d'une application. Cependant, il ne couvre pas directement les aspects liés à la gestion de projet, à la planification ou à la validation client mentionnés dans la référence. Bien qu'il soit pertinent pour le sujet de l'expérience utilisateur, il manque une connexion plus forte avec les autres concepts clés abordés dans la synthèse."}, {"exercise": {"id": "8d87b71832bd4e098ad7731f3a3a19b1", "question": "Quel est l'un des objectifs clés de DevOps en matière de collaboration ?", "answers": ["Encourager la communication constante entre développement et exploitation"], "distractors": ["Réduire les coûts en externalisant les processus.", "Augmenter le nombre de nouveautés par déploiement.", "Minimiser les étapes de validation humaine.", "Gérer les projets internes sans retour externe.", "Éviter les mises à jour fréquentes pour plus de stabilité.", "Prioriser les outils de tests automatiques exclusivement.", "Centraliser toutes les responsabilités sur l'équipe d'exploitation.", "Fournir des mises à jour majeures une fois par an.", "Développer des infrastructures complexes indépendamment des équipes."], "feedback": "L'un des objectifs clés de DevOps est d'encourager une collaboration étroite entre les équipes de développement et d'exploitation afin de favoriser une meilleure communication et une responsabilité partagée. Cela permet d'éviter les problèmes liés à une séparation trop rigide des tâches et de mieux gérer les projets ensemble.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "479d04b20d4e453a92a83000e23fd8db", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "1. Collaboration : DevOps favorise une collaboration étroite entre les équipes de développement et d'exploitation, en encourageant la communication constante et la responsabilité partagée. 2. Automatisation : L'automatisation des processus de développement, de tests, de déploiement et de gestion des infrastructures est au cœur de DevOps pour accélérer la livraison. 3. Livraison Continue : DevOps encourage la livraison fréquente et continue de petites mises à jour, ce qui permet de réduire les risques et d'obtenir un retour rapide. 4. Surveillance et Rétroaction : La surveillance continue des applications en production permet de détecter et de résoudre rapidement les problèmes, tandis que la rétroaction constante alimente l'amélioration continue.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "li", "children_ids": [], "parent_id": "b5183fac6bd94d4ab718d6b3b5630f54", "next_id": "c07c6ff7a52d4e5d89b34106d5ade2a7", "prev_id": "b5183fac6bd94d4ab718d6b3b5630f54", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13642, "doc_label": "A4 - Cours Intro Culture Devops", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect de la collaboration dans le développement logiciel, qui est pertinent pour le contexte de déploiement et d'intégration des systèmes d'information. Cependant, il se concentre spécifiquement sur DevOps, ce qui n'est qu'une partie du sujet plus large abordé dans la référence. Bien que cela touche à l'importance de la communication entre les équipes, l'exercice ne couvre pas directement les autres éléments clés mentionnés dans la synthèse, tels que la gestion de projet ou l'expérience utilisateur. Par conséquent, bien qu'il soit pertinent, il ne teste pas entièrement tous les concepts clés liés à la référence."}, {"exercise": {"id": "25198d974077469883925c4558d733c1", "query": "L'intégration continue aide à détecter rapidement les <blank> pouvant survenir lors du développement logiciel.", "answers": ["problèmes d'intégration"], "distractors": [["transactions de données", "configurations réseau", "performances applicatives", "besoins utilisateurs", "demandes de sécurité", "changements d'interface"]], "feedback": "La pratique de l'intégration continue se concentre principalement sur la détection rapide des problèmes d'intégration, c'est-à-dire des conflits ou erreurs qui peuvent survenir lorsque du nouveau code est fusionné avec le code existant. Ces problèmes peuvent ralentir les équipes et affecter la qualité si non identifiés tôt.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "98982457c98340659f8bcb12dec59bbb", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "L'intégration continue est une pratique fondamentale dans le développement logiciel moderne. Elle permet d'améliorer la qualité du code, d'accélérer la livraison des logiciels et de détecter rapidement les problèmes d'intégration. En utilisant des outils de CI appropriés et en adoptant les principes de la CI, les équipes de développement peuvent optimiser leurs processus et fournir des logiciels de haute qualité de manière plus efficace.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1ad243b091f940bfb9746a0e8d17c374", "next_id": null, "prev_id": "1ad243b091f940bfb9746a0e8d17c374", "associated_block_ids": [], "first_page": 2, "last_page": 2, "start_time": null, "end_time": null, "doc_id": 13639, "doc_label": "A3 - Cours sur l_Intégration Continue", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'intégration continue, qui est un aspect important du déploiement et de l'intégration d'un logiciel ou d'un système d'information. Cependant, il ne couvre pas directement les concepts clés mentionnés dans la référence, tels que la gestion de projet, l'expérience utilisateur ou la validation client. Bien qu'il soit pertinent pour le contexte général du développement logiciel, il ne touche pas suffisamment aux éléments spécifiques liés à la conception UX ou à la collaboration entre équipes. Par conséquent, bien qu'il ait une certaine pertinence, il n'évalue pas pleinement les objectifs d'apprentissage énoncés dans la référence."}, {"exercise": {"id": "b200cf908f3c4da483af2116247ab2db", "statement": "DevOps encourage la séparation stricte des responsabilités entre les équipes de développement et d'exploitation.", "veracity": false, "feedback": "DevOps ne favorise pas une séparation stricte des responsabilités, mais plutôt une collaboration étroite entre les équipes de développement et d'exploitation. Il promeut une communication constante et une responsabilité partagée pour optimiser les processus et favoriser l'efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "479d04b20d4e453a92a83000e23fd8db", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "1. Collaboration : DevOps favorise une collaboration étroite entre les équipes de développement et d'exploitation, en encourageant la communication constante et la responsabilité partagée. 2. Automatisation : L'automatisation des processus de développement, de tests, de déploiement et de gestion des infrastructures est au cœur de DevOps pour accélérer la livraison. 3. Livraison Continue : DevOps encourage la livraison fréquente et continue de petites mises à jour, ce qui permet de réduire les risques et d'obtenir un retour rapide. 4. Surveillance et Rétroaction : La surveillance continue des applications en production permet de détecter et de résoudre rapidement les problèmes, tandis que la rétroaction constante alimente l'amélioration continue.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "li", "children_ids": [], "parent_id": "b5183fac6bd94d4ab718d6b3b5630f54", "next_id": "c07c6ff7a52d4e5d89b34106d5ade2a7", "prev_id": "b5183fac6bd94d4ab718d6b3b5630f54", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13642, "doc_label": "A4 - Cours Intro Culture Devops", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des principes de collaboration dans le développement logiciel, qui est un aspect clé de la référence. Cependant, il ne couvre pas directement les concepts liés au déploiement, à l'intégration d'un logiciel ou à l'expérience utilisateur (UX) mentionnés dans la synthèse. Bien qu'il soit pertinent pour le contexte général du travail en équipe dans un projet logiciel, il pourrait être amélioré en intégrant des éléments plus spécifiques sur les processus de déploiement et d'intégration."}, {"exercise": {"id": "a8b47afa392b4c59a213f3ce7cc367e9", "statement": "La CI favorise la collaboration au sein de l'équipe grâce au partage fréquent du code et à la résolution rapide des conflits.", "veracity": true, "feedback": "La CI (Intégration Continue) encourage effectivement le travail d'équipe en facilitant le partage régulier du code entre les membres et contribue à résoudre rapidement les conflits, ce qui renforce la collaboration.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c0b2c91752574ed5b476d3a900341172", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Les tests automatisés garantissent une meilleure qualité du code, car les développeurs sont incités à écrire des tests pour leurs modifications. Cela réduit les erreurs et les régressions. La CI encourage la collaboration entre les membres de l'équipe, car elle favorise le partage fréquent du code et la résolution rapide des conflits.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ab628e61cd444e218c5e1769a241c5f8", "next_id": "d2db38630fb04ba88832a600f651492e", "prev_id": "ab628e61cd444e218c5e1769a241c5f8", "associated_block_ids": [], "first_page": 2, "last_page": 2, "start_time": null, "end_time": null, "doc_id": 13639, "doc_label": "A3 - Cours sur l_Intégration Continue", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la collaboration dans le développement logiciel, qui est mentionné dans la synthèse. Cependant, il ne teste pas directement les compétences liées à la gestion de projet ou à l'intégration d'un logiciel, d'un système d'informations ou d'une application. Bien qu'il soit pertinent pour le contexte de déploiement et d'intégration, il manque une connexion plus directe avec les concepts clés tels que la planification rigoureuse ou l'expérience utilisateur. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement les objectifs d'apprentissage couverts par la référence."}, {"exercise": {"id": "b5b3d58294f646eab57ec22125680a33", "statement": "DevOps favorise une collaboration étroite entre les équipes, ce qui permet une résolution rapide des problèmes.", "veracity": true, "feedback": "Une collaboration accrue dans DevOps contribue à une meilleure compréhension mutuelle entre les équipes, facilitant ainsi une identification et une résolution plus rapide des problèmes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "0fbe813d64e547118a1a4c3d83b34654", "order": 14.0, "image_url": null, "origin_type": "document_content", "text": "L'automatisation réduit la dépendance à l'égard des tâches manuelles, réduisant ainsi les erreurs humaines et améliorant la stabilité du système. DevOps encourage la collaboration étroite entre les équipes, ce qui améliore la compréhension mutuelle et la résolution rapide des problèmes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fc16ad597b574399807e7ead06da6884", "next_id": null, "prev_id": "fc16ad597b574399807e7ead06da6884", "associated_block_ids": [], "first_page": 1, "last_page": 2, "start_time": null, "end_time": null, "doc_id": 13642, "doc_label": "A4 - Cours Intro Culture Devops", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de la collaboration dans le développement logiciel, un aspect mentionné dans la synthèse. Cependant, il ne teste pas directement les concepts clés liés au déploiement et à l'intégration d'un logiciel ou d'un système d'information, qui sont au cœur de la référence. Bien que pertinent pour le contexte général du développement logiciel, l'exercice pourrait être amélioré en se concentrant davantage sur les spécificités du déploiement et de l'intégration des systèmes."}, {"exercise": {"id": "7cc5a5ac41a4442783553898ea6adf61", "statement": "DevOps cherche à améliorer uniquement la rapidité des livraisons de logiciels, négligeant la collaboration entre les équipes.", "veracity": false, "feedback": "L'objectif principal de DevOps est d'accélérer la livraison de logiciels, mais cela inclut également l'amélioration de la collaboration entre les équipes de développement et d'exploitation. L'accent est donc mis non seulement sur la rapidité, mais aussi sur l'efficacité et la fiabilité des opérations grâce à une meilleure coopération entre les équipes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b2f57f9819a24428903decd1819ef7aa", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "DevOps est une philosophie et une approche de développement logiciel qui vise à éliminer les barrières traditionnelles entre les équipes de développement (Dev) et d'exploitation (Ops). L'objectif principal de DevOps est d'accélérer la livraison de logiciels de haute qualité tout en améliorant la collaboration, l'efficacité et la fiabilité des opérations informatiques.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1648fad48011487cbaa7730d20180486", "next_id": "b5183fac6bd94d4ab718d6b3b5630f54", "prev_id": "1648fad48011487cbaa7730d20180486", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13642, "doc_label": "A4 - Cours Intro Culture Devops", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de collaboration entre les équipes de développement et d'exploitation, qui est un aspect important lors du déploiement et de l'intégration d'un logiciel ou d'un système d'information. Cependant, il se concentre principalement sur DevOps et la rapidité des livraisons, ce qui ne couvre pas entièrement les autres éléments clés mentionnés dans la référence, tels que la gestion de projet, l'expérience utilisateur (UX) ou la validation client. Bien qu'il soit pertinent, il ne teste pas directement tous les aspects essentiels liés à la référence."}, {"exercise": {"id": "dc3a6dfc15ca475496a486da3bde2aa8", "statement": "Les outils mentionnés servent uniquement à créer des documents internes pour l'équipe de projet.", "veracity": false, "feedback": "Ces outils ne sont pas utilisés uniquement en interne, mais plutôt pour communiquer et aligner les idées avec les clients ou les parties prenantes. Leur objectif est de faciliter la compréhension mutuelle du résultat attendu entre différentes parties prenantes extérieures à l'équipe de projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1cc8dc888f674583a957f2a782085892", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les deux outils sont utilisés pour communiquer et aligner les idées avec les clients ou les parties prenantes concernées. Cependant, le Stylescape va plus loin en offrant une représentation plus complète et immersive de l'expérience visuelle attendue, ce qui facilite la compréhension et la visualisation du résultat final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2cb56f3c3e4840c0af164f514250274d", "next_id": "088d4c7f46de40f0986cfa0cc08bc0bc", "prev_id": "ec3a9e230f6943ae8c0b2d363898bc4d", "associated_block_ids": [], "first_page": 19, "last_page": 19, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'utilisation des outils dans le cadre d'un projet logiciel, ce qui est pertinent pour le contexte de déploiement et d'intégration d'un logiciel ou système d'information. Cependant, il ne couvre pas directement les aspects clés tels que la gestion des dépendances, l'expérience utilisateur ou la validation client mentionnés dans la synthèse. Bien qu'il aborde un point important sur la communication avec les parties prenantes, il pourrait être plus ciblé sur les concepts spécifiques liés à l'intégration et au déploiement du logiciel."}], "sources": [{"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}, "is_teacher": null}, "score": 6.3, "top_pages": [201, 202], "top_minutes": []}]}