{"introduction": "Dans le cadre de la conception et de la réalisation d'éléments graphiques et visuels, animer les éléments d'une image est une compétence essentielle. Cela implique non seulement la restitution des mouvements image par image, mais aussi la définition précise des trajectoires. Cette synthèse explore divers concepts clés qui soutiennent cette pratique, allant des balises HTML aux techniques d'interaction utilisateur.", "synthesis": "La création d'animations dans un environnement numérique repose sur plusieurs éléments fondamentaux. Tout d'abord, les balises <canvas> et <svg> jouent un rôle crucial en permettant aux développeurs de dessiner et manipuler des graphiques dynamiques. La balise <canvas>, par exemple, est utilisée pour créer des images bitmap via JavaScript, tandis que la balise <svg> permet l'intégration de graphiques vectoriels scalables, offrant ainsi flexibilité et qualité visuelle sans perte lors du redimensionnement.\n\nLes éléments graphiques eux-mêmes sont au cœur de toute animation réussie. Ils incluent une variété de composants visuels tels que les images, boutons et icônes qui facilitent la communication visuelle. L'image en tant que représentation visuelle joue un rôle fondamental dans l'interprétation du contenu graphique et nécessite souvent des alternatives textuelles pour garantir l'accessibilité.\n\nEn ce qui concerne l'interaction utilisateur, des concepts comme le dispositif de pointage et l'état au hover sont essentiels pour enrichir l'expérience interactive. Le dispositif de pointage permet aux utilisateurs d'interagir avec les éléments graphiques sur une page web, tandis que l'état au hover fournit un retour visuel immédiat lorsque l'utilisateur passe sa souris sur un élément interactif.\n\nDe plus, la détection du mouvement et les gestes complexes ouvrent la voie à des applications avancées où les utilisateurs peuvent interagir avec le contenu à travers des mouvements physiques ou tactiles. Ces technologies permettent une expérience immersive où les animations peuvent réagir en temps réel aux actions de l'utilisateur.\n\nEnfin, il est important de souligner le rôle essentiel de descriptions détaillées qui accompagnent les éléments graphiques pour améliorer leur accessibilité. Ces descriptions fournissent un contexte supplémentaire nécessaire à ceux ayant des déficiences visuelles, garantissant ainsi que tous les utilisateurs puissent bénéficier pleinement du contenu animé proposé.", "concepts": [{"concept": {"id": "916d45fb-8de8-4d6d-b59f-490f45450c93", "label": "Balise <canvas>", "definition": "La balise <canvas> est un élément HTML5 qui permet de dessiner des graphiques dynamiques via JavaScript sur une page web. Elle est souvent utilisée pour créer des images bitmap, des animations, des jeux et des applications visuelles interactives. Il est essentiel de fournir une description textuelle du contenu de la balise <canvas> pour les utilisateurs ayant des déficiences visuelles, car cela améliore l'accessibilité du contenu graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["eae02101-e80c-411d-8adc-caed6eb3022e", "98686082-c428-4b5d-aa6c-21436ac97aa7", "34dfcfa2-04a9-43d4-8f33-29c9fe8f0f87", "a186b0f2-f065-4ed4-a10b-3924bc3aef84", "5d801026-5898-497b-8954-039fc91e3ab9"], "wikientity": {"label": "Canvas (HTML)", "definition": "L'élément canvas est un composant du langage Web HTML qui permet d'effectuer des rendus dynamiques d'images bitmap en utilisant des scripts dans des langages tels que le javascript. Déjà implémenté dans certains navigateurs, il fait partie de la spécification HTML5. Canvas peut également être utilisé pour mettre en place un moyen de traçage de l'utilisateur sur le site sans avoir à collecter ses données personnelles grâce au canvas fingerprinting.", "page_id": "622027", "wikidata_id": "Q657954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La balise <canvas> est essentielle pour dessiner et animer graphiquement sur le web, ce qui correspond parfaitement à l'objectif de restituer des mouvements image par image."}, {"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les éléments graphiques sont fondamentaux pour toute animation visuelle, car ils constituent les composants qui seront animés et manipulés dans le cadre de la restitution des mouvements."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "Le concept d'image est central à l'animation des éléments d'une image, car il s'agit de la représentation visuelle qui sera animée. Sa définition souligne son importance dans le design graphique et la communication visuelle."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La balise <svg> est directement pertinente car elle permet de créer et manipuler des graphiques vectoriels, essentiels pour animer des éléments visuels dans le contexte donné."}, {"concept": {"id": "b9df3fc2-02f0-4a68-b302-3e6a648f068b", "label": "Détection du mouvement", "definition": "Technologie qui permet à un appareil de reconnaître et répondre aux mouvements physiques, utilisée dans diverses applications interactives.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Caméra à détection de mouvement", "definition": "Une caméra à détection de mouvement est un appareil de prise de vue associé à un capteur thermique sensible à la variation du rayonnement infrarouge engendrée par le mouvement de personnes ou d'animaux. La prise de vue est déclenchée par un dispositif électronique dès que le capteur détecte une telle variation. \nCe type d'appareil est utilisé pour assurer la surveillance de certains lieux ; dans ce cas, il est le plus souvent associé à une alarme et les images enregistrées peuvent être consultées en direct par liaison filaire ou immatérielle.", "page_id": "6255487", "wikidata_id": "Q2935712", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La détection du mouvement est directement liée à l'animation et à la réponse aux mouvements, ce qui est pertinent pour animer les éléments d'une image."}, {"concept": {"id": "855f3cc5-0b22-4b4d-b761-64563fda9d9c", "label": "Gestes complexes", "definition": "Interactions nécessitant plusieurs points de contact sur un écran tactile ou le suivi d'une trajectoire, souvent utilisées dans des applications avancées ou des jeux, incluant des fonctionnalités comme le zoom.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["d051b80e-9e59-4f8c-b7f1-b339d0f77db6"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les gestes complexes impliquent des interactions précises sur un écran, ce qui est pertinent pour animer des éléments d'une image en définissant des trajectoires."}, {"concept": {"id": "49cfc2c6-bf96-4192-8004-86d1ace1d976", "label": "Image bitmap", "definition": "Représentation graphique numérique composée de pixels, utilisée dans divers formats tels que JPEG ou PNG, ainsi que dans les balises <canvas> pour afficher des informations visuelles sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["3b69cc8b-032e-4ab9-a522-6a5cf578c980"], "wikientity": {"label": "Image matricielle", "definition": "Une image matricielle, ou « carte de points » (de l'anglais bitmap), est une image constituée d'un pavage carré dont chaque élément, appelé point ou pixel, est coloré selon un code enregistré dans un tableau à deux dimensions.\nDans les domaines de l'imagerie numérique et de l'infographie, on parle d'image matricielle par opposition avec l'image vectorielle.", "page_id": "70340", "wikidata_id": "Q182270", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'image bitmap est très pertinente car elle décrit un type spécifique d'image qui peut être animé. La compréhension de ce format est essentielle pour travailler sur les animations graphiques."}, {"concept": {"id": "b07d1b0d-6877-44fd-b64b-1bbfae2a0bc2", "label": "Élément <text>", "definition": "Élément SVG utilisé pour afficher du texte; il est crucial pour fournir des informations accessibles lorsque d'autres attributs ne sont pas disponibles, et important dans le calcul du nom accessible des liens contenant des graphiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["1bda70b0-8300-46e1-bf1a-0307e874afd6"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "<text> est crucial pour afficher du texte dans SVG, ce qui peut enrichir les animations en fournissant un contexte textuel aux éléments animés."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le format vectoriel est très pertinent pour la création et l’animation d’éléments graphiques en raison de sa flexibilité et de sa qualité lors du redimensionnement."}, {"concept": {"id": "219bf54f-cc59-4cf8-91c7-d0126a78d83e", "label": "État au hover", "definition": "Changement visuel d'un élément lorsqu'un utilisateur passe la souris dessus, souvent déclenchant des contenus additionnels ou des effets visuels, utilisé pour indiquer interactivité et attirer l'attention.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13708], "aliases": ["0a830e55-7d4d-4ab9-a178-73e97194c485"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'État au hover' est pertinent car il implique un changement visuel qui peut faire partie du mouvement ou de l'interaction dans une animation, bien que cela soit plus spécifique aux interactions qu'à l’animation en soi."}, {"concept": {"id": "180973ca-7ea4-4179-9de6-4306d5f4a2c2", "label": "Composants d'interface", "definition": "Les composants d'interface sont des éléments interactifs sur une page web, tels que des boutons, des liens et des menus, qui permettent aux utilisateurs d'interagir avec le système et sont essentiels pour l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["b5b72bc5-0aa8-4ebc-9e2a-5b66e752e50d"], "wikientity": {"label": "Composant d'interface graphique", "definition": "En informatique, un composant d'interface graphique (aussi appelé widget en anglais ou encore control) est un élément de base d'une interface graphique avec lequel un utilisateur peut interagir (par exemple une fenêtre ou une zone de texte). Ces composants sont généralement regroupés dans des boîtes à outils graphiques (appelées toolkit en anglais). Une fois assemblés par un programmeur, ces composants forment une interface graphique complète.", "page_id": "1587875", "wikidata_id": "Q605117", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Composants d'interface' est assez pertinent car ces éléments peuvent inclure des animations dans leur interaction, bien que cela ne soit pas leur seule fonction."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Une description détaillée aide à contextualiser le contenu visuel, ce qui peut être utile lors de la présentation d’animations, bien qu'elle ne soit pas directement liée à leur création."}, {"concept": {"id": "76f0d550-20fb-41f2-8162-877317e6f35f", "label": "Dispositif de pointage", "definition": "Outil utilisé pour interagir avec une interface graphique, comme une souris ou un stylet, permettant de sélectionner et manipuler des éléments à l'écran.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Dispositif de pointage", "definition": "Un dispositif de pointage est un périphérique d'entrée permettant à un utilisateur d'entrer des données spatiales dans un ordinateur.", "page_id": "10745", "wikidata_id": "Q184824", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Un dispositif de pointage est essentiel pour interagir avec des éléments animés sur un écran, ce qui en fait un concept relativement pertinent pour animer des éléments graphiques."}], "exercises": [], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 10.5, "top_pages": [25, 20], "top_minutes": []}]}