{"introduction": "La conception d'une plaquette ou d'un dépliant publicitaire nécessite une compréhension approfondie des éléments graphiques et des principes de design qui favorisent une communication efficace. Dans ce contexte, divers concepts clés tels que la lisibilité, l'accessibilité et l'organisation visuelle jouent un rôle crucial pour garantir que le message soit non seulement attrayant mais aussi compréhensible par tous les utilisateurs. Cette synthèse explore les thèmes centraux liés à la création de supports de communication visuelle.", "synthesis": "La conception graphique repose sur plusieurs éléments fondamentaux qui interagissent pour créer une expérience utilisateur optimale. Les **éléments graphiques** sont au cœur du design, englobant images, typographie et icônes qui facilitent la compréhension des informations complexes. L'**image**, en tant que représentation visuelle, influence directement la perception du spectateur et doit être accompagnée d'alternatives textuelles pour assurer son accessibilité.\n\nUn autre principe essentiel est la **simplicité**, qui prône un design épuré afin de rendre les interfaces intuitives et esthétiques. Cela se traduit par une **lisibilité** accrue, où la taille de police, le contraste des couleurs et l'espacement sont minutieusement choisis pour favoriser l'engagement du lecteur. La **cohérence** dans le design assure également une expérience fluide, permettant aux utilisateurs de naviguer sans confusion.\n\nL'**accessibilité des contenus visuels** est primordiale ; elle garantit que toutes les personnes, y compris celles utilisant des technologies d'assistance, peuvent comprendre le contenu graphique grâce à des descriptions textuelles appropriées. De plus, l'**organisation de page** joue un rôle clé dans la navigation en structurant efficacement les éléments pour optimiser l'expérience utilisateur.\n\nLes outils modernes comme la balise <svg> permettent d'intégrer des graphiques vectoriels scalables tout en prenant en compte l'accessibilité. Le **responsive design**, quant à lui, assure que le contenu s'adapte à différentes tailles d'écran, rendant ainsi les dépliants accessibles sur tous types d'appareils.\n\nEnfin, il est crucial de définir des **objectifs stratégiques** clairs lors de la conception afin d'orienter le design vers les besoins spécifiques des usagers. Des indicateurs comme le **taux de conversion** mesurent l'efficacité du dépliant publicitaire en incitant les utilisateurs à réaliser une action souhaitée après leur interaction avec celui-ci. En somme, chaque concept abordé contribue à créer un support publicitaire efficace qui attire et engage son audience.", "concepts": [{"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les éléments graphiques sont fondamentaux pour la conception d'une plaquette ou d'un dépliant publicitaire, car ils constituent les composants visuels qui attirent l'attention et transmettent des informations de manière efficace."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "L'image est un élément central dans la conception de dépliants publicitaires, car elle joue un rôle clé dans l'attraction du regard et la transmission du message."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "La simplicité est un principe fondamental dans la conception de supports publicitaires, permettant de transmettre des messages clairs et directs sans surcharge d'informations."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "'Lisibilité' est essentielle pour toute forme de communication écrite, y compris les plaquettes et dépliants publicitaires, car elle affecte directement l'engagement du lecteur."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le format vectoriel est crucial pour la création de graphiques dans une plaquette ou un dépliant, permettant une mise à l'échelle sans perte de qualité et garantissant un rendu professionnel."}, {"concept": {"id": "3f7470d7-442d-4922-9f23-70be2de8c8c8", "label": "Accessibilité des contenus visuels", "definition": "L'accessibilité des contenus visuels se réfère à la fourniture de descriptions textuelles pour les images et éléments graphiques, permettant aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, de comprendre le contenu visuel lorsque celui-ci ne peut pas être affiché. Cela inclut l'utilisation d'attributs alternatifs en HTML qui décrivent ces images, ainsi que la mise à disposition de contenu ou fonctionnalités équivalentes lorsque certaines conditions ne sont pas remplies, garantissant ainsi une accessibilité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7f9d95fb-80ae-4ce9-b4ad-ed8ff0eab829", "104cae17-0a9a-49b6-9395-a7a4af1f4c39", "963fcb43-959a-46ac-8a0e-df703abd85f0", "88400249-4250-499f-b98d-a5cb498ee7cc", "5b26344a-b71c-4c0f-b03c-af99333bff27"], "wikientity": {"label": "Alternative textuelle", "definition": "L'alternative textuelle est un texte que l'on associe à un contenu graphique comme une image, une zone cliquable dans une image ou un élément de formulaire de type image, dans un site web ou dans un document produit par un logiciel d'une suite bureautique, pour que l'utilisateur qui ne peut visualiser l'image puisse être informé de ce qu'elle représente et signifie. L'alternative textuelle est restituée à la place de l'image quand celle-ci n'est pas consultable.\nL'alternative textuelle, dont l'emploi est obligatoire dans le cadre de l'accessibilité du web, concerne tant les personnes qui utilisent un navigateur textuel ou un lecteur d'écran, que celles qui, par choix ou à cause d'un problème technique, ne peuvent visualiser l'image.", "page_id": "7715605", "wikidata_id": "Q1067764", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "L'accessibilité des contenus visuels est fondamentale lors de la conception d'une plaquette ou d'un dépliant afin d'assurer que tous les utilisateurs puissent comprendre et interagir avec le contenu visuel."}, {"concept": {"id": "826ac735-9873-4b63-a658-7a9022f13f23", "label": "Organisation de page", "definition": "Structure et agencement des éléments d'une page web pour optimiser la navigation et l'expérience utilisateur, en tenant compte de la hiérarchie visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'organisation de page est essentielle pour optimiser l'impact visuel et l'expérience utilisateur d'un dépliant, rendant ce concept très pertinent."}, {"concept": {"id": "bbec4b6c-ecb2-4980-a828-4ea2e6a15f47", "label": "Cohérence", "definition": "Uniformité dans le design et les interactions au sein d'une interface ou d'une application, favorisant une meilleure compréhension et garantissant une expérience fluide pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["df6e29c5-d22e-4955-90b8-9e1627d2e164"], "wikientity": null, "wordnetentity": {"label": "Cohérence", "definition": "a harmonious uniformity or agreement among things or parts", "name": "consistency.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La cohérence est cruciale dans le design graphique pour assurer une expérience utilisateur fluide et harmonieuse dans les supports de communication tels que les plaquettes."}, {"concept": {"id": "7f68a084-10a3-4266-90e0-653c0f007cfd", "label": "Design-first", "definition": "Approche de conception priorisant l'esthétique et l'expérience utilisateur dès le début du processus de développement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'approche design-first est essentielle lors de la conception d'une plaquette publicitaire, car elle garantit que l'esthétique et l'expérience utilisateur sont prioritaires dès le début du processus."}, {"concept": {"id": "9afb0643-e273-456d-8fd2-4ab13b0d8236", "label": "Contraste visuel", "definition": "Le contraste visuel, ou ratio de contraste, désigne la mesure de l'opposition entre la luminosité ou la couleur d'un élément de premier plan et celle d'un arrière-plan. Ce contraste est essentiel pour garantir la lisibilité et l'accessibilité des contenus numériques sur les pages web et les interfaces visuelles, en particulier pour les utilisateurs ayant des déficiences visuelles. Il joue un rôle crucial dans l'expérience utilisateur en assurant que le contenu soit facilement discernable par tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707, 13710, 13708], "aliases": ["5c481e4e-e436-4bb7-a7e9-53bc0830e306", "b12c3286-f79e-4321-a6d3-db4c95e9c849", "650d5354-ed61-4940-8878-706a15f07f6f", "1c2f3e20-96e3-4275-8631-9e9564ed2ed1", "c4dddffe-8da9-4405-8b54-28eb0959e6dd", "7141a9bd-f2a9-4685-95e3-5e81f87d7c9a", "cd3ee3d7-bb6f-4084-9226-a941f6eb43b9"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le contraste visuel est crucial pour garantir que le texte et les images d'un dépliant soient lisibles et attrayants, ce qui en fait un concept central à la conception de supports publicitaires."}, {"concept": {"id": "bf2e32cb-e846-41c1-a9c3-26d5c2c4bd57", "label": "Contenu compréhensible", "definition": "Un contenu lisible et cohérent, où l'ordre des éléments et l'enchaînement de la lecture facilitent la compréhension.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Un contenu compréhensible est essentiel pour toute forme de communication visuelle, y compris les plaquettes publicitaires, car il garantit que le message soit clair et accessible au lecteur."}, {"concept": {"id": "7843365f-32d0-4ace-98d4-f900474fa71e", "label": "UI Designer", "definition": "Designer d'interface utilisateur responsable de l'apparence visuelle et de l'interactivité d'un produit numérique, complémentaire au travail de l'UX designer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Un UI Designer joue un rôle crucial dans la création visuelle et interactive des supports numériques, ce qui peut également influencer le design graphique des plaquettes et dépliants."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La balise <svg> est hautement pertinente car elle permet d'intégrer des graphiques vectoriels dans les supports visuels, ce qui améliore leur qualité et leur accessibilité."}, {"concept": {"id": "adc8dc13-f786-4914-8a14-7ba79f9406d6", "label": "Responsive Design", "definition": "La conception réactive, ou responsive design, est une approche de conception web qui permet aux sites et emails de s'adapter automatiquement à différentes tailles d'écran et formats. Elle ajuste dynamiquement le contenu selon la largeur de l'écran, optimisant ainsi l'expérience utilisateur sur tous les appareils, y compris mobiles et tablettes. Cette méthode garantit une accessibilité améliorée et une expérience utilisateur cohérente sans nécessiter la création de maquettes séparées. Avec l'augmentation du trafic mobile, cette approche est devenue essentielle pour répondre aux besoins variés des utilisateurs sur toutes les plateformes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13670, 13705], "aliases": ["efecb8a8-c6df-48af-bf39-bb4da8fd8376", "1f741a6d-bbf7-4bfe-b77b-a1ef82c29bc6", "e1917e2a-f148-467e-8262-4f1dd26e2f71", "cc031509-4f61-49ef-aa86-aa8c871fcb3e", "7bfb57a5-469b-4c0b-9487-f9afdcf3b3cd", "dfaa8d51-d283-479b-9fe7-b089a0e35db8", "54138ec5-0216-46c4-89a9-1c8119032f02", "a8bde322-f83e-42d7-9eb7-e659681882c6", "4fd67f4c-c4cf-4125-bea0-62c60a94d589", "4ea15d31-4c8b-47ac-8abd-3a55541f163e"], "wikientity": {"label": "Site web réactif", "definition": "Un site web réactif (RWD, de l’anglais responsive web design : conception de sites web réactifs) est un site web dont la conception vise, grâce à différents principes et techniques, à offrir une consultation confortable sur des écrans de tailles très différentes. L'utilisateur peut ainsi consulter le même site web à travers une large gamme d'appareils (moniteurs d'ordinateur, smartphone, tablettes, télévision…) avec le même confort visuel et sans avoir recours au défilement horizontal ou au zoom avant/arrière sur les appareils tactiles notamment, manipulations qui peuvent parfois dégrader l'expérience utilisateur, tant en lecture qu'en navigation. Un site web réactif est un exemple de plasticité des interfaces.", "page_id": "6049523", "wikidata_id": "Q420295", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le responsive design est crucial pour s'assurer que les dépliants numériques s'affichent correctement sur différents appareils, ce qui est essentiel dans le cadre moderne de communication visuelle."}, {"concept": {"id": "d5978979-95eb-4c2f-bbf0-34d3ca920f47", "label": "Objectifs stratégiques", "definition": "Buts définis par un site web ou une application qui guident le design et l'ergonomie en fonction des besoins des usagers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Objectifs stratégiques' sont essentiels dans la conception d'une plaquette ou d'un dépliant car ils guident le design en fonction des besoins du public cible."}, {"concept": {"id": "9063ef01-8369-4bd6-89af-11353700ccf4", "label": "image porteuse d'information", "definition": "Image essentielle à la compréhension du contenu, fournissant des informations critiques et souvent liée à des liens ou boutons.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'image porteuse d'information est cruciale dans un dépliant publicitaire car elle attire l'attention et communique des messages clés aux utilisateurs."}, {"concept": {"id": "180973ca-7ea4-4179-9de6-4306d5f4a2c2", "label": "Composants d'interface", "definition": "Les composants d'interface sont des éléments interactifs sur une page web, tels que des boutons, des liens et des menus, qui permettent aux utilisateurs d'interagir avec le système et sont essentiels pour l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["b5b72bc5-0aa8-4ebc-9e2a-5b66e752e50d"], "wikientity": {"label": "Composant d'interface graphique", "definition": "En informatique, un composant d'interface graphique (aussi appelé widget en anglais ou encore control) est un élément de base d'une interface graphique avec lequel un utilisateur peut interagir (par exemple une fenêtre ou une zone de texte). Ces composants sont généralement regroupés dans des boîtes à outils graphiques (appelées toolkit en anglais). Une fois assemblés par un programmeur, ces composants forment une interface graphique complète.", "page_id": "1587875", "wikidata_id": "Q605117", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les composants d'interface sont cruciaux pour créer des éléments interactifs sur un dépliant numérique, rendant leur utilisation très pertinente pour concevoir des supports attractifs et fonctionnels."}, {"concept": {"id": "77e5ae9a-6d43-443b-8de9-fe1cbea5f1b4", "label": "Intitulé visible", "definition": "Texte affiché sur un bouton ou un lien, servant d'étiquette pour un champ de formulaire, essentiel pour l'accessibilité et la navigation utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'intitulé visible est crucial pour l'accessibilité et la navigation, ce qui est pertinent dans le contexte de la communication visuelle sur un dépliant publicitaire."}, {"concept": {"id": "d755565d-4b40-42ce-9c76-27c7c9c20660", "label": "Structure du document", "definition": "Ensemble d'éléments définissant les zones principales d'une page HTML, incluant l'en-tête, la navigation, le contenu et le pied de page.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La structure du document est essentielle pour organiser les informations sur une plaquette ou un dépliant, rendant ce concept très pertinent pour l'objectif pédagogique."}, {"concept": {"id": "7cff2f67-e7cc-4264-ade4-2d0d96f0cadb", "label": "Outils de design web", "definition": "Logiciels utilisés par les designers pour créer des interfaces utilisateur attrayantes et fonctionnelles, tels que Adobe XD ou Figma.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les outils de design web sont essentiels pour créer des interfaces attrayantes et fonctionnelles, ce qui peut également s'appliquer à la création de supports imprimés comme des dépliants."}, {"concept": {"id": "d4605453-350f-4fb5-a9bb-d19ea166d057", "label": "Zone d'en-tête", "definition": "Section supérieure d'un document contenant des éléments comme le titre et le logo, essentielle pour l'identité visuelle et la navigation du site.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La zone d'en-tête est cruciale pour l'identité visuelle d'une plaquette ou d'un dépliant publicitaire, car elle contient des éléments clés comme le titre et le logo qui attirent l'attention du lecteur."}, {"concept": {"id": "93243cf1-1c62-40e6-b2ac-c4f1322cfadb", "label": "Utilisabilité", "definition": "Mesure de l'efficacité et de la satisfaction d'une interface utilisateur, essentielle pour garantir une interaction fluide et intuitive.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": {"label": "Utilisabilité", "definition": "L’utilisabilité, ou encore aptitude à l'utilisation est définie par la norme ISO 9241-11 comme « le degré selon lequel un produit peut être utilisé, par des utilisateurs identifiés, pour atteindre des buts définis avec efficacité, efficience et satisfaction, dans un contexte d’utilisation spécifié ».\nC'est une notion proche de celle d'affordance, ou même d’ergonomie qui est cependant plus large.\nLes critères de l’utilisabilité sont :\n\nl’efficacité : le produit permet à ses utilisateurs d’atteindre le résultat prévu.", "page_id": "142385", "wikidata_id": "Q216378", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'utilisabilité est essentielle pour s'assurer que le dépliant soit facile à comprendre et à utiliser par le public cible, ce qui en fait un concept pertinent."}, {"concept": {"id": "e208c124-c2d4-43aa-b374-5e9653b2aad4", "label": "Taux de conversion", "definition": "Le taux de conversion est le pourcentage d'utilisateurs qui réalisent une action souhaitée, comme un achat ou une inscription, après avoir été exposés à une campagne marketing sur un site web ou via des canaux mobiles. Cet indicateur clé de performance commerciale mesure l'efficacité d'une interface et peut être influencé par divers facteurs, tels que l'utilisation stratégique des couleurs et d'autres éléments de design UX. Il représente donc la proportion de prospects qui deviennent clients suite à leur interaction avec une offre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13670], "aliases": ["9543a16d-b880-4e6f-a52f-68e0d04a24ef", "9d9c2998-9466-419f-85b1-d38c1a010811", "ae828f4a-4b88-4a32-9096-567130b0a78b", "edfb61f0-ebbb-426b-be76-d1ee45c392b5"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le taux de conversion est très pertinent car il mesure l'efficacité des campagnes marketing, ce qui est essentiel lors de la conception d'une plaquette ou d'un dépliant visant à inciter les utilisateurs à agir."}, {"concept": {"id": "d7224c6f-a919-460d-af12-6dfbeacde495", "label": "Visibilité en ligne", "definition": "La visibilité en ligne désigne la capacité d'une entreprise ou d'une marque à être facilement perçue et trouvée sur Internet, ce qui est essentiel pour attirer de nouveaux clients et prospects. Cela inclut le degré de reconnaissance par le public ainsi que l'efficacité des stratégies mises en place pour se démarquer dans un environnement concurrentiel, notamment à travers les moteurs de recherche et d'autres moyens de navigation, contribuant ainsi à l'augmentation des ventes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13710], "aliases": ["a2fbd1f5-3187-4a73-8c57-0026e5b7c834", "6057ab20-03f6-44eb-bc9c-9e371b435eb7", "9f927f63-302b-44d8-8264-8c200a6beb4e", "04c7ab9d-73f8-4af7-98bb-c6286d64ae15"], "wikientity": null, "wordnetentity": {"label": "Visibilité", "definition": "quality or fact or degree of being visible; perceptible by the eye or obvious to the eye", "name": "visibility.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La visibilité en ligne est très pertinente car elle touche directement à l'efficacité des supports de communication dans un environnement concurrentiel, ce qui est essentiel pour une plaquette publicitaire."}, {"concept": {"id": "e0272eef-239a-434a-a2e1-131b467cd06c", "label": "Architecture de menu", "definition": "Disposition des éléments de navigation sur un site web, favorisant une structure intuitive pour les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'architecture de menu est essentielle pour structurer les informations dans un dépliant ou une plaquette, facilitant ainsi la navigation et la compréhension du contenu par le lecteur."}, {"concept": {"id": "adeae403-e261-4e4e-9de1-f885ca1eacfa", "label": "Gabarits de pages", "definition": "Modèles préétablis utilisés pour créer des pages web uniformes tout en respectant les principes d'ergonomie.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Gabarit (mise en page)", "definition": "Un gabarit, souvent nommé template ou layout, est un patron de mise en page où l'on place images et textes. \nAussi, il est souvent utilisé de manière répétitive pour créer des documents présentant une même structure. \nOn parle aussi de patron comme en couture ou bien, parfois, de grille.", "page_id": "117934", "wikidata_id": "Q25397911", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "'Gabarits de pages' sont très pertinents car ils fournissent une base structurée pour concevoir des supports visuels cohérents et ergonomiques comme les dépliants."}, {"concept": {"id": "1dec3064-776f-47c4-a74b-f9e1221148b6", "label": "Espacement du texte", "definition": "Réglages des distances entre lignes, paragraphes et caractères, influençant la lisibilité et l'expérience utilisateur sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Espacement du texte' est très pertinent car il influence directement la lisibilité et l'esthétique d'une plaquette ou d'un dépliant publicitaire."}, {"concept": {"id": "35731d03-1f0f-45f7-9e26-a44b29a90f40", "label": "Légende d'image", "definition": "Texte associé à une image, fournissant des informations complémentaires ou contextuelles, essentiel pour l'accessibilité et la compréhension visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La légende d'image est essentielle pour enrichir les visuels d'une plaquette ou d'un dépliant, car elle fournit des informations contextuelles qui améliorent la compréhension du message visuel."}, {"concept": {"id": "014a978d-3545-4c6c-b114-f50b1e083ec9", "label": "Version accessible", "definition": "Document ou fichier rendu conforme aux normes d'accessibilité, permettant une utilisation optimale par tous les utilisateurs, y compris ceux ayant des handicaps.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La version accessible est très pertinente pour la conception d'une plaquette ou d'un dépliant publicitaire, car elle garantit que le support de communication est utilisable par tous, y compris les personnes en situation de handicap."}, {"concept": {"id": "97773262-3ef9-493f-8aea-44b4ef91a06d", "label": "Marketing", "definition": "Discipline visant à promouvoir et vendre des produits ou services, incluant des stratégies comme le mass mailing, le suivi de campagnes sponsorisées, ainsi que des techniques pour attirer et fidéliser les clients dans un environnement concurrentiel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13707, 13710], "aliases": ["f5d04d30-82c0-4c13-a061-0e9142cd3990"], "wikientity": {"label": "Marketing", "definition": "Le marketing, ou la mercatique, est le processus d'identification des clients et de « création, communication, livraison et échange » de biens et services pour la satisfaction et la fidélisation de ces clients. C'est l'un des principaux composants de business management et du commerce.\nLe marketing est généralement réalisé par le vendeur, généralement un détaillant ou un fabricant.", "page_id": "26873", "wikidata_id": "Q39809", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Marketing", "definition": "the commercial processes involved in promoting and selling and distributing a product or service", "name": "marketing.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "Le marketing est lié à la promotion des produits via divers supports, y compris les dépliants; cependant, il s'agit plus d'une stratégie que d'un aspect direct du design lui-même."}, {"concept": {"id": "fe3431e6-f552-40bf-9acf-a8dc64fff9bb", "label": "Couleur contiguë", "definition": "Couleur touchant directement une autre couleur dans un design graphique, importante pour le contraste et la lisibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La couleur contiguë est importante pour le design graphique et peut influencer l'attrait visuel d'une plaquette ou d'un dépliant, ce qui en fait un concept pertinent."}, {"concept": {"id": "7c15d1a8-6a39-4bb9-b353-1112c86b8900", "label": "Communication digitale", "definition": "Échange d'informations via des plateformes numériques, nécessitant une ergonomie adaptée pour optimiser l'interaction.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Communication numérique", "definition": "La communication numérique, parfois appelée « communication digitale » (anglicisme), est un champ des sciences de l’information relatif à l'utilisation de l’ensemble des médias numériques : le web, les médias sociaux ou les terminaux mobiles par exemple. Ces médias sont utilisés comme des canaux de diffusion, de partage et de création d'informations.", "page_id": "5018281", "wikidata_id": "Q97368847", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La communication digitale est pertinente car elle englobe les principes nécessaires à l'élaboration efficace d'un message dans un support publicitaire, même si cela se concentre davantage sur le numérique."}, {"concept": {"id": "292d70cc-3de3-4698-a1e6-f79cd67134cc", "label": "Zones de regroupement de contenus", "definition": "Sections récurrentes sur plusieurs pages (comme en-têtes ou pieds de page) qui organisent le contenu et améliorent la navigation utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les zones de regroupement de contenus améliorent la navigation dans un dépliant, ce qui est important pour une communication efficace et structurée."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Une description détaillée enrichit le contenu visuel d'un dépliant en fournissant des informations contextuelles importantes, bien qu'elle ne soit pas toujours centrale à sa conception."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Comprendre les usagers est fondamental lors de la conception d'un dépliant afin de répondre efficacement à leurs besoins et attentes."}, {"concept": {"id": "7fcc9498-9b97-4289-a01d-189889aa59c3", "label": "Couleur comme information", "definition": "Principe selon lequel l'information ne doit pas être transmise uniquement par la couleur ou l'utilisation de couleurs, afin d'assurer l'accessibilité pour tous les utilisateurs et éviter toute confusion pour ceux qui peuvent avoir des difficultés à percevoir les couleurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["1cccf89a-d717-4d5a-8956-63d3432cb9ee"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Couleur comme information' est important dans le design graphique pour assurer l'accessibilité et éviter toute confusion dans un support visuel tel qu'un dépliant."}, {"concept": {"id": "5a5218df-a742-48f6-a66e-29c886266cdc", "label": "Contenu visible", "definition": "Éléments présents même sans CSS, garantissant que l'information est accessible indépendamment des styles appliqués.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le contenu visible est important pour s'assurer que l'information sur une plaquette ou un dépliant est accessible même sans éléments graphiques, ce qui contribue à une meilleure communication visuelle."}, {"concept": {"id": "9d54c769-32af-4dfb-bf56-1878ed64d5e5", "label": "Perception des informations", "definition": "Capacité à interpréter et comprendre les données présentées dans une interface; cruciale pour une navigation efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La perception des informations est importante pour s'assurer que le message d'une plaquette soit compris efficacement par son audience, ce qui en fait un concept pertinent."}, {"concept": {"id": "8b1e209c-023a-4448-b056-47c76133a1ef", "label": "image texte", "definition": "Les images texte sont des images contenant du texte, qui sont déconseillées en faveur de l'utilisation de CSS pour le rendu textuel. Elles doivent être remplacées par du texte stylé lorsque cela est possible afin d'améliorer l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["059ac23c-07f3-464f-95d6-9e6c9c5653b0"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les images texte sont un aspect important du design graphique, car leur utilisation peut affecter l'esthétique et l'accessibilité d'une plaquette ou d'un dépliant."}, {"concept": {"id": "8cfe3c8d-558a-44c3-8e30-f8297911c562", "label": "Modèle", "definition": "Représentation simplifiée d'un concept ou d'un système, utilisée pour comprendre et organiser des informations complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": {"label": "Modèle", "definition": "Le modèle concerne la notion de ressemblance, d’imitation, de représentation, il désigne :\n\nun objet réel dont on va chercher à donner une représentation, que l'on va chercher à imiter (exemple : le « modèle » du peintre, le « modèle » que constitue le maître pour le disciple) ;\nun concept ou objet considéré comme « représentatif d’un autre » (exemple : le « modèle réduit » ou maquette, le « modèle » du scientifique), déjà existant ou que l'on va s'efforcer de construire.\nLe premier sens est le « sens original ». Le second sens dérive de la pratique des architectes et ingénieurs (puis des scientifiques) consistant à construire d’abord un prototype, concret ou conceptuel, qui servira de « modèle » à une construction réelle : le modèle est ainsi devenu, en outre, l’assemblage de concepts représentant de manière simplifiée une chose « réelle déjà existante » (objet, phénomène, etc.), en vue de la comprendre, d’en prédire le comportement.", "page_id": "94751", "wikidata_id": "Q1979154", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Modèle", "definition": "the act of representing something (usually on a smaller scale)", "name": "model.n.09", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "Un modèle est pertinent car il aide à structurer et organiser les idées lors de la création d'une plaquette ou d'un dépliant publicitaire."}, {"concept": {"id": "219bf54f-cc59-4cf8-91c7-d0126a78d83e", "label": "État au hover", "definition": "Changement visuel d'un élément lorsqu'un utilisateur passe la souris dessus, souvent déclenchant des contenus additionnels ou des effets visuels, utilisé pour indiquer interactivité et attirer l'attention.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13708], "aliases": ["0a830e55-7d4d-4ab9-a178-73e97194c485"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'État au hover' est pertinent car il concerne les éléments interactifs qui peuvent être utilisés dans des supports numériques comme des dépliants en ligne pour attirer l'attention des utilisateurs."}, {"concept": {"id": "65a2d925-96a7-48d0-94eb-7917f284ca13", "label": "Navigation", "definition": "La navigation, ou système de navigation, désigne le processus et les systèmes utilisés pour se déplacer efficacement et intuitivement à travers les différentes sections ou pages d'une interface web ou d'une application. Cela inclut l'utilisation de menus, de tables des matières, de plans du site et d'autres méthodes qui contribuent à une expérience fluide, à l'ergonomie, à la compréhension du site et à l'accessibilité. Les systèmes de navigation facilitent également la recherche d'informations via des moteurs de recherche intégrés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13666, 13708], "aliases": ["5f336d11-a83e-4c09-b404-30caf3494f2e", "c7ba75e2-9acf-40e4-b21f-c85f713d24b5", "79990658-2b4b-49e2-890e-ea7343e190ce", "886ea679-2ba8-4a0b-885b-281920a96a5e", "810c55c8-6be9-4b80-9b41-622b41ddf2e9"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Navigation' est pertinent car une bonne navigation peut influencer comment les informations sont présentées et perçues sur un support publicitaire."}, {"concept": {"id": "46ca34df-cb2f-4d35-a35c-9e8761cc77f3", "label": "Pied de page", "definition": "La section inférieure d'une page web ou d'un site fournissant des informations importantes, légales et fonctionnelles, souvent négligée mais cruciale pour la conformité et l'accessibilité, incluant des liens vers les politiques de confidentialité, les contacts et d'autres informations pertinentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13708], "aliases": ["83daa9a6-e341-4617-b10f-92699892609a"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le pied de page est crucial dans tout document imprimé ou numérique car il contient des informations importantes; sa pertinence augmente lorsqu'il s'agit d'assurer une bonne présentation et conformité dans les supports publicitaires."}, {"concept": {"id": "dd7f034e-b27f-4cf1-9fd4-44d97a868f5d", "label": "Transcription Textuelle Accessible", "definition": "La transcription textuelle accessible est une représentation écrite du contenu audio ou vidéo, permettant une compréhension équivalente de l'information exprimée oralement. Elle est essentielle pour garantir un accès universel aux informations, notamment pour les utilisateurs sourds ou malentendants, en leur permettant de comprendre le média sans son. Cette forme de transcription joue un rôle crucial dans l'accessibilité et la compréhension des médias temporels.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7162bba1-daee-41b2-9c48-91a2622cebf6", "fe137fd9-f557-4c99-a70d-a212c18cfc87", "12744208-3c86-4125-83d5-55c91eecba25"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La transcription textuelle accessible peut être utilisée pour rendre les contenus audiovisuels présents dans une plaquette plus accessibles, ce qui en fait un concept pertinent mais secondaire par rapport à la conception elle-même."}, {"concept": {"id": "f9b7ff84-41ad-4b87-9037-60ce30d08594", "label": "DesignGouv", "definition": "Pôle Design des services numériques du gouvernement français, chargé de promouvoir une meilleure expérience utilisateur dans les services publics.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "DesignGouv est pertinent car il se concentre sur l'expérience utilisateur dans les services publics, ce qui peut influencer positivement la conception de supports publicitaires destinés à ces services."}], "exercises": [{"exercise": {"id": "a445f4b4019a4cff837aa3d8e9bba2c5", "statement": "Il n'est pas nécessaire de prendre en compte la personnalité du service lors de la création de CTA.", "veracity": false, "feedback": "Il est explicitement mentionné qu'il faut tenir compte de la personnalité que l'on souhaite transmettre via le produit ou service lorsqu'on décide du format de CTA à utiliser.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "adfd1b1bb75348adb19ed130d411fcb0", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut tout d'abord savoir qu'il existe différents types de CTA et qu'en fonction de l'importance que l'on souhaite donner à l'action, il faut choisir entre ces trois gabarits : Bien sûr il faut prendre en compte le type de service / produit et la personnalité qu'on souhaite transmettre mais c'est une donnée intéressante à garder en tête !", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "55f684c91106495595873b5ac0d2fdb1", "next_id": "f6522177a2774dce8b042a498e560196", "prev_id": "55f684c91106495595873b5ac0d2fdb1", "associated_block_ids": [], "first_page": 252, "last_page": 259, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de supports publicitaires, à savoir l'importance de prendre en compte la personnalité du service lors de la création d'appels à l'action (CTA). Cette notion est pertinente dans le contexte de la conception graphique et des objectifs stratégiques mentionnés dans la synthèse. Cependant, bien que cela touche un point important, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts comme la lisibilité ou l'accessibilité, qui sont également cruciaux pour une plaquette ou un dépliant publicitaire."}, {"exercise": {"id": "f1f4e80cb280417598d14efa8b949f6e", "question": "Quelle est la longueur maximale recommandée pour une alternative textuelle accessible ?", "answers": ["80 caractères au maximum sont fortement recommandés"], "distractors": ["100 caractères au maximum sont fortement recommandés", "120 caractères au maximum sont fortement recommandés", "40 caractères au maximum sont fortement recommandés", "70 caractères au maximum sont fortement recommandés", "90 caractères au maximum sont fortement recommandés", "50 caractères au maximum sont fortement recommandés", "130 caractères au maximum sont fortement recommandés", "110 caractères au maximum sont fortement recommandés", "60 caractères au maximum sont fortement recommandés"], "feedback": "Une longueur maximale de 80 caractères est fortement recommandée pour que les utilisateurs de plages braille ou de loupes d'écran puissent lire l'alternative sans avoir à effectuer plusieurs manipulations. Cela garantit une meilleure accessibilité pour ces utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception graphique, à savoir l'accessibilité des contenus visuels, qui est mentionnée dans la synthèse. La question sur la longueur maximale recommandée pour une alternative textuelle accessible est pertinente car elle touche directement à l'importance de rendre les informations compréhensibles pour tous les utilisateurs, y compris ceux utilisant des technologies d'assistance. Cependant, bien que cela soit un élément important, l'exercice pourrait être amélioré en incluant des questions sur d'autres concepts clés tels que la simplicité ou la cohérence dans le design. Cela justifie une note élevée mais pas parfaite."}, {"exercise": {"id": "48bcec0fe85e486b997ca81cb67263c1", "query": "Pour faciliter l'accessibilité, la longueur maximale recommandée pour une alternative textuelle est de <blank>.", "answers": ["80 caractères"], "distractors": [["50 caractères", "100 caractères", "120 caractères", "60 caractères", "70 caractères", "90 caractères"]], "feedback": "La longueur maximale de 80 caractères est recommandée car elle permet de limiter les manipulations pour les utilisateurs de technologies d'assistance telles que des plages braille ou des loupes d'écran. Un texte plus long pourrait compliquer la lecture pour ces outils.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un aspect clé de la conception graphique, à savoir l'accessibilité des contenus visuels, en se concentrant sur la longueur maximale recommandée pour une alternative textuelle. Cela est directement lié aux principes abordés dans la synthèse, notamment l'importance de rendre les informations accessibles aux utilisateurs de technologies d'assistance. Cependant, bien que pertinent, l'exercice ne couvre pas tous les éléments essentiels mentionnés dans la référence, tels que la simplicité ou l'organisation de page. C'est pourquoi il obtient une note élevée mais pas parfaite."}, {"exercise": {"id": "6959a0ee488345c7b82f166b7c72587f", "statement": "Les technologies comme les plages braille et les loupes d'écran peuvent faciliter la lecture des alternatives textuelles.", "veracity": true, "feedback": "Il est mentionné que les technologies d'assistance telles que les plages braille et les loupes d’écran permettent aux utilisateurs d’accéder aux alternatives textuelles. Ces outils aident notamment dans la restitution de texte destiné à ceux ayant des limitations visuelles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité des contenus visuels, un concept clé dans la référence sur la conception d'une plaquette ou d'un dépliant publicitaire. En demandant à l'apprenant de valider une affirmation concernant les technologies d'assistance et leur rôle dans l'accès aux alternatives textuelles, il teste directement sa connaissance des principes d'accessibilité mentionnés dans la synthèse. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects de la conception graphique évoqués dans la référence, tels que la simplicité ou l'organisation de page, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception graphique, notamment l'importance de la cohérence et du respect des normes de référence pour ne pas perdre l'utilisateur. La question posée cible directement un aspect clé de la référence, à savoir comment concevoir un dépliant publicitaire efficace en évitant les erreurs qui pourraient nuire à l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques liés aux concepts abordés dans la synthèse, tels que l'accessibilité ou la lisibilité. Cela aurait permis d'obtenir une évaluation encore plus complète des compétences visées."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de clarté et de cohérence dans le design, qui sont des éléments clés mentionnés dans la référence concernant la conception d'une plaquette ou d'un dépliant publicitaire. La question aborde directement l'importance de ces normes pour éviter de perdre l'utilisateur, ce qui est pertinent pour créer une expérience utilisateur optimale. Cependant, l'exercice pourrait être amélioré en intégrant des aspects spécifiques à la conception graphique tels que les éléments graphiques, l'accessibilité ou l'organisation de page, afin d'évaluer plus largement la maîtrise des concepts liés à la création de supports publicitaires."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance du responsive design, qui est un concept clé dans la conception de supports de communication comme les dépliants publicitaires. En demandant à l'apprenant de compléter une phrase sur les conséquences d'une mauvaise adaptation aux appareils mobiles, il teste leur capacité à relier ce principe à l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant d'autres éléments fondamentaux mentionnés dans la synthèse, tels que la simplicité ou l'accessibilité des contenus visuels."}, {"exercise": {"id": "aa56f61857f44205a2ba7fef386130a4", "question": "Pourquoi faut-il lier une légende à son image par une relation de structure ?", "answers": ["Pour un traitement unifié par les technologies d'assistance"], "distractors": ["Pour faciliter le téléchargement de l'image", "Pour permettre l'impression de la légende seule", "Afin de rendre l'image plus rapide à charger", "Pour garantir que l'image soit centrée sur la page", "Pour éviter les erreurs dans le code CSS", "Pour accroître la visibilité du texte alternatif", "Pour réduire la taille du fichier HTML", "Pour assurer une mise en page responsive", "Pour améliorer le référencement dans les moteurs de recherche"], "feedback": "Lier la légende d'une image à l'image elle-même permet de traiter l'image et sa légende comme un ensemble unique, facilitant ainsi le traitement par les technologies d'assistance. Cela garantit également que l'image et sa légende soient présentées ensemble et évite tout risque de confusion pour les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité des contenus visuels, un concept clé dans la référence fournie. La question sur le lien entre une légende et son image aborde directement les principes d'accessibilité mentionnés dans la synthèse, en soulignant comment cela aide les technologies d'assistance à traiter les informations de manière cohérente. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des aspects supplémentaires tels que la simplicité ou la lisibilité du design graphique, qui sont également cruciaux pour concevoir un dépliant efficace. Cela explique pourquoi il ne reçoit pas un score parfait."}, {"exercise": {"id": "7a9a0d8eaaca4a9eacdbd3f5cf15cd73", "query": "Lorsqu'une image est légendée, il est important d'associer la légende de l'image à l'image par une relation de <blank> afin que les technologies d'assistance puissent interpréter correctement cet ensemble.", "answers": ["structure"], "distractors": [["couleur", "signalisation", "marqueur", "contenu visuel", "connexion", "sémantique"]], "feedback": "Il est essentiel de relier une légende à son image par une relation de structure pour que les technologies d'assistance puissent traiter les deux comme un seul élément. Sans cette relation, ces technologies risquent de ne pas comprendre que la légende et l'image sont liées, ce qui pourrait rendre l'information inaccessible.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un concept clé de la référence, à savoir l'importance de l'accessibilité des contenus visuels et la relation entre une image et sa légende. En demandant aux apprenants de remplir un blanc avec le terme 'structure', il évalue leur capacité à reconnaître comment les éléments graphiques doivent être organisés pour garantir une expérience utilisateur optimale, notamment pour les personnes utilisant des technologies d'assistance. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la conception graphique globale du dépliant publicitaire, comme la simplicité ou la cohérence dans le design."}, {"exercise": {"id": "b3e57401533842d0be619dce4af41dfc", "statement": "La condition de test doit garantir que la restitution est pertinente pour l'accessibilité.", "veracity": true, "feedback": "Effectivement, la restitution doit être évaluée quant à sa pertinence pour une accessibilité correcte, assurant ainsi que l'élément ou le dispositif est compatible avec les standards d'accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue un aspect clé de la référence, à savoir l'accessibilité des contenus visuels dans la conception d'une plaquette ou d'un dépliant publicitaire. En demandant si la condition de test doit garantir que la restitution est pertinente pour l'accessibilité, il met en lumière l'importance de rendre les éléments graphiques accessibles à tous, ce qui est fondamental dans le contexte de la conception graphique. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur d'autres concepts tels que la simplicité ou la cohérence dans le design."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des éléments ergonomiques dans le contexte de la conception d'une plaquette ou d'un dépliant publicitaire. Il souligne l'importance de l'étude des usagers pour sélectionner les éléments graphiques et ergonomiques, ce qui est en ligne avec les principes de simplicité, lisibilité et accessibilité mentionnés dans la synthèse. Cependant, il pourrait être amélioré en intégrant des aspects plus spécifiques liés à la conception graphique elle-même, comme l'utilisation de typographie ou d'images adaptées. Néanmoins, il reste pertinent car il aborde un aspect clé du design centré sur l'utilisateur."}, {"exercise": {"id": "616b5d2ed72e4a31ba53f684e25b1e18", "statement": "Une alternative textuelle doit impérativement contenir moins de 80 caractères pour être accessible.", "veracity": false, "feedback": "Il est recommandé que l'alternative textuelle ne dépasse pas 80 caractères pour limiter les manipulations des utilisateurs de technologies d'assistance, mais ce n'est pas une obligation stricte. Le nombre maximal de 80 caractères est une bonne pratique conseillée, non une règle absolue.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension de l'accessibilité des contenus visuels, un concept clé dans la référence sur la conception de supports de communication. Bien que l'affirmation porte sur une bonne pratique concernant les alternatives textuelles, elle ne couvre pas tous les aspects essentiels du design graphique mentionnés dans la synthèse, tels que la simplicité, la lisibilité ou l'organisation de page. Cependant, il reste pertinent car il aborde un élément important lié à l'accessibilité qui est crucial pour concevoir un dépliant publicitaire efficace."}, {"exercise": {"id": "046002d154f54faba26d356d715ab78c", "query": "Pour offrir une bonne expérience utilisateur sur mobile, il est important d'adapter l'interface de votre site à la taille de l'écran, ce qui peut être réalisé grâce à un site <blank>.", "answers": ["responsive design"], "distractors": [["statique", "interactif", "multi-plateforme", "dynamique", "minimaliste", "augmenté"]], "feedback": "Le terme 'responsive design' fait référence à une technique de conception qui ajuste automatiquement l'affichage du site en fonction de la taille et la résolution de l'écran utilisé. Cela permet aux utilisateurs de smartphone ou tablette d'avoir une meilleure expérience sans avoir à zoomer ou faire défiler horizontalement. Contrairement aux autres options proposées, seule cette approche vise spécifiquement à adapter l'affichage à différents appareils de manière fluide.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension du concept de 'responsive design', qui est un élément clé dans la conception de supports de communication, notamment les dépliants publicitaires. Bien que l'exercice ne couvre pas directement tous les aspects mentionnés dans la référence, comme l'accessibilité ou l'organisation de page, il reste pertinent car le responsive design est essentiel pour garantir une expérience utilisateur optimale sur différents appareils. Cependant, il aurait pu être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts fondamentaux abordés dans la synthèse."}, {"exercise": {"id": "053de79d8f01448d8c9ae2f115f8abaf", "statement": "Les pages Responsive ne fonctionnent correctement que lorsque leur largeur est entre 400 et 4000 pixels.", "veracity": false, "feedback": "Le concept de 'Responsive' signifie que les pages Web s'adaptent automatiquement à la taille de la fenêtre du navigateur, quelle que soit la largeur (que ce soit moins de 400 pixels ou plus de 4000 pixels). Cela permet au contenu de rester flexible et lisible peu importe la dimension de l'écran.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c8c9fd5c615d4aeb89687638c827428e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Amazon a commencé à vendre des livres en ligne. Se concentrer sur les livres à un prix bas en 1994 avec une conception Web simpliste a suffi à l'entreprise pour se développer et se diversifier. Les pages qui sont à 100% Responsive s'adaptent à la taille de la fenêtre de navigateur. Peu importe que la largeur soit de 400 pixels ou 4000pixels. Des contenus, comme par exemple des images ou des textes, s'intègrent simplement et de manière flexible selon la grandeur de l'écran respectif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "b7e9e4bbcc3540a78cb7b632d44e7ab9", "next_id": "47662b070fa14ac3b3344aab7550d2e6", "prev_id": "b84de263ccd2406f97694b0dd7e6441c", "associated_block_ids": [], "first_page": 189, "last_page": 194, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un aspect clé de la référence concernant la conception d'un dépliant publicitaire. En effet, le responsive design est essentiel pour garantir que les supports de communication soient accessibles sur différents appareils, ce qui est mentionné dans la synthèse. Cependant, l'exercice se concentre uniquement sur une affirmation spécifique liée à la largeur des pages et ne couvre pas d'autres éléments importants tels que l'accessibilité, la simplicité ou l'organisation de page. Ainsi, bien qu'il soit pertinent, il ne teste pas entièrement tous les aspects clés de la référence."}, {"exercise": {"id": "2e4690c8ed0e457c984b12c5a4c9dc8a", "question": "Que désignent les micro-espaces blancs dans une conception graphique ?", "answers": ["Les petits espaces/tampons créés autour du contenu pour plus d'aération"], "distractors": ["Les grandes zones vides placées intentionnellement pour guider le lecteur", "Les couleurs claires utilisées pour alléger visuellement une page", "Les lignes invisibles délimitant les paragraphes dans un texte structuré", "Les éléments graphiques utilisés pour attirer l'attention sur le contenu", "Les zones d'ombre ajoutées pour créer un effet de relief", "Les marges de sécurité pour éviter les débordements de texte", "Les espaces réservés pour insérer des images ou des vidéos", "Les interlignes ajustables selon la police choisie pour le texte", "Les bordures entourant chaque section afin de garantir la lisibilité"], "feedback": "Les micro-espaces blancs sont créés autour du contenu pour aérer visuellement la mise en page et éviter un aspect trop chargé. Ils peuvent également être ajustés pour des raisons esthétiques, mais ils sont toujours présents même s'ils ne sont pas voulus.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception graphique, à savoir l'utilisation des micro-espaces blancs, qui contribue à la lisibilité et à l'esthétique d'un dépliant publicitaire. Cependant, bien que cela soit pertinent pour le design en général, la question ne teste pas directement les compétences spécifiques liées à la création d'une plaquette ou d'un dépliant publicitaire comme mentionné dans la référence. L'exercice pourrait être amélioré en intégrant des éléments plus directement liés aux objectifs stratégiques ou à l'accessibilité des contenus visuels dans le contexte de la conception de supports de communication."}, {"exercise": {"id": "8e0704032c5145a4b8a08d720994221a", "question": "Quel attribut contient l'alternative textuelle pour une image accompagnée d'une description détaillée?", "answers": ["L'attribut WAI-ARIA aria-label"], "distractors": ["L'attribut img-label-description", "L'attribut data-accessibility-text", "Un élément de balise desc", "L'attribut caption-alt", "L'attribut alt-describe", "Une balise HTML aria-img-desc", "Un identifiant aria-text-support", "Une classe CSS dédié à l'accessibilité", "Un élément de légende"], "feedback": "Dans cette situation, l'attribut WAI-ARIA aria-label permet de fournir une alternative textuelle pour l'image accompagnée d'une référence à une description détaillée adjacente. Cela permet aux personnes en situation de handicap d'accéder à l'information présente dans l'image.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'un aspect important de l'accessibilité dans la conception graphique, qui est mentionné dans la synthèse. Cependant, il se concentre spécifiquement sur un attribut WAI-ARIA, ce qui est un détail technique plutôt que sur des concepts plus larges comme la simplicité, la lisibilité ou l'organisation de page. Bien qu'il soit pertinent pour le sujet de l'accessibilité, il ne couvre pas directement les compétences clés liées à la conception d'une plaquette ou d'un dépliant publicitaire dans son ensemble. Une note de 6 reflète cette pertinence partielle."}, {"exercise": {"id": "d4e9ab91b0d543e59d4284af6b4ebc5f", "question": "Pourquoi la taille de l'écran mobile peut poser problème lors de la conception ?", "answers": ["La taille restreinte complique la créativité et le webdesign"], "distractors": ["Les smartphones n'ont pas assez de performances pour un bon design.", "Les sites mobiles ne peuvent pas contenir de contenu multimédia.", "La navigation mobile impose toujours deux mains pour interagir.", "L'amélioration des visuels pour mobile est plus simple qu'avec un ordinateur.", "La taille d’écran mobile améliore toujours l'expérience utilisateur.", "Les écrans de téléphone n'affichent pas les images en haute qualité.", "Le responsive design supprime tout besoin de réflexion créative.", "Les couleurs doivent changer entre les versions mobile et desktop.", "Toutes les interfaces mobiles doivent être monochromes pour optimiser le design."], "feedback": "La taille de l'écran d'un terminal mobile peut poser problème pour les créateurs de sites web, car cela limite leur capacité à être créatif et à concevoir des designs complexes et esthétiques. La limitation de l'espace sur un petit écran peut également poser des problèmes pour l'optimisation de la navigation et de l'expérience utilisateur globale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de la taille de l'écran mobile, ce qui est pertinent dans le contexte du design responsive et de l'accessibilité des contenus visuels. Cependant, il ne teste pas directement les compétences liées à la conception d'une plaquette ou d'un dépliant publicitaire, ni les éléments graphiques spécifiques mentionnés dans la synthèse. Bien que cela touche à un aspect important du design moderne, l'exercice pourrait être amélioré en se concentrant davantage sur les principes de simplicité, lisibilité et organisation de page qui sont cruciaux pour la création d'un support publicitaire efficace."}, {"exercise": {"id": "27f72194fe76474eb0a9bbbd1d1a154a", "question": "Quelle option permet d'adapter un site à toutes les tailles d'écran mobile ?", "answers": ["Le site responsive design permet cette adaptation"], "distractors": ["Un site minimaliste conçu uniquement pour ordinateur.", "La personnalisation des menus déroulants fixes.", "Un site avec des images haute résolution spécifiques.", "La réduction de la taille des polices manuellement.", "L'ajout de sections cachées non visibles sur mobile.", "L'activation d'un mode hors ligne universel.", "L'optimisation des vidéos HD pour tablette.", "Une application dédiée à chaque utilisateur mobile.", "La modification aléatoire des couleurs d'arrière-plan."], "feedback": "Le site responsive design est une option qui permet de créer un site web adapté à toutes les tailles d'écran mobile. Il s'agit d'un design flexible qui s'ajuste automatiquement à la taille de l'écran sans nécessiter une gestion manuelle des éléments. Cela garantit une expérience utilisateur optimale sur tous les types d'appareils mobiles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un élément clé dans la conception de supports de communication, notamment les dépliants publicitaires. Cependant, bien que pertinent, il ne couvre pas directement tous les aspects mentionnés dans la référence, tels que l'importance des éléments graphiques, de la simplicité ou de l'accessibilité. L'exercice pourrait être amélioré en intégrant des questions sur ces autres concepts pour mieux refléter l'ensemble des compétences nécessaires à la conception d'une plaquette ou d'un dépliant publicitaire."}, {"exercise": {"id": "43ed5db4b45b4c63965cd7cf6749ea3c", "statement": "L'attribut WAI-ARIA aria-label contient à la fois l'alternative textuelle et une référence à une description détaillée adjacente.", "veracity": false, "feedback": "L'attribut WAI-ARIA aria-label ne contient que l'alternative textuelle. La référence à une description détaillée est mentionnée séparément, mais ne fait pas partie de l'attribut aria-label lui-même.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'accessibilité des contenus visuels, un aspect clé de la référence sur la conception d'une plaquette ou d'un dépliant publicitaire. Bien que l'exercice ne teste pas directement les compétences en design graphique ou en création de supports publicitaires, il aborde un concept essentiel lié à l'accessibilité, qui est crucial pour garantir que le contenu soit compréhensible par tous. Cependant, il aurait été plus pertinent d'inclure des questions qui évaluent directement les éléments graphiques, la simplicité du design ou l'organisation de page dans le contexte spécifique de la création d'un dépliant. Ainsi, bien que pertinent, cet exercice ne couvre qu'une partie des objectifs d'apprentissage liés à la conception graphique."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent de la conception graphique, en se concentrant sur l'importance de la visibilité des fonctions dans une interface. Cela fait écho à la notion de simplicité et d'organisation de page mentionnée dans la synthèse. Cependant, il ne traite pas directement de la création d'une plaquette ou d'un dépliant publicitaire, qui implique également des éléments spécifiques comme l'utilisation d'images, typographie et accessibilité. Bien que l'exercice soit lié aux principes généraux du design, il manque une connexion directe avec les objectifs stratégiques et les spécificités des supports publicitaires évoqués dans la référence."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 20.3, "top_pages": [34, 35], "top_minutes": []}, {"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.5, "top_pages": [384, 385], "top_minutes": []}, {"document": {"id": 13704, "label": "QUALITE-WEB-_C3", "authors": [], "title": "Ergonomie Web : Principes et Bonnes Pratiques", "content": [], "mime_type": "application/pdf", "short_summary": "L'ergonomie web vise à améliorer l'expérience utilisateur en rendant les interfaces faciles et confortables à utiliser. Des règles comme la loi de Fitts et la règle des 2 secondes sont essentielles pour optimiser l'interaction entre l'utilisateur et le site.", "long_summary": "- L'ergonomie web adapte les interfaces pour une utilisation facile et agréable.\n- Objectif : améliorer la communication entre l'humain et l'interface.\n- Chaque projet est unique, nécessitant une étude approfondie des utilisateurs.\n- Règle des 2 secondes : un utilisateur ne doit pas attendre plus de 2 secondes pour une réponse du système.\n- La ligne « Fold » : les informations importantes doivent être visibles sans faire défiler la page.\n- Règle de Pareto (80/20) : 20% du contenu satisfait 80% des recherches, prioriser ce contenu dans l'architecture.\n- Loi de Miller : limiter le nombre d'options de navigation à 5-9 éléments pour faciliter le traitement de l'information par l'utilisateur.\n- Loi de Fitts : la taille et la distance des cibles cliquables influencent leur accessibilité, augmentant ainsi les conversions sur un site web.\n- Conseils pratiques incluent supprimer les éléments inutiles, optimiser le chargement des pages, créer une hiérarchie claire, et assurer un bon contraste dans les textes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/63cb3c9_qualite-web-_c3.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Usages : Ergonomie et UX\n===\n\n- L'ergonomie web a pour objectif d'adapter une interface web à ses visiteurs de sorte que son utilisation soit ressentie comme facile, confortable et que ceux-ci aient envie d'y revenir.\n===\n\n- L'ergonomie digitale a pour but l'amélioration de la communication et de l'interaction entre l'humain et une interface.\n===\n\n- La règle des 2 secondes\n===\n\n- Règle de Pareto (80/20)\n===\n\n- Règle de Pareto (80/20)\n===\n\n- La Loi de Miller\n===\n\n- La loi de Fitts\n===\n\n- La loi de Fitts\n===\n\n- Focus : Organisation d'une page\n===\n\n- Activité\n===\n", "number_of_pages": 27, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.5, "top_pages": [19, 20], "top_minutes": []}]}