{"introduction": "La conception de supports de communication visuelle est un domaine essentiel qui englobe divers aspects du design graphique, de l'identité de marque et des stratégies de communication. En intégrant des éléments tels que la cohérence visuelle, la lisibilité et l'esthétique, les professionnels peuvent créer des supports efficaces qui transmettent des messages clairs tout en captivant l'attention du public. Cette synthèse explore les concepts clés liés à la création d'une communication visuelle impactante.", "synthesis": "La communication visuelle constitue le fondement d'une interaction efficace entre une marque et son public. Elle repose sur l'utilisation harmonieuse de divers supports graphiques pour transmettre des messages clairs et engageants. Le design graphique joue un rôle central dans cette démarche, combinant texte et images pour créer des interfaces attrayantes qui captivent l'utilisateur. La cohérence visuelle est essentielle pour assurer une reconnaissance immédiate de la marque, en utilisant uniformément les couleurs, polices et mises en page à travers tous les supports.\n\nLes éléments de conception sont cruciaux dans le développement d'interfaces utilisateur. Ils englobent tous les composants graphiques nécessaires à une expérience utilisateur fluide. La mise en page (MEP) influence directement la lisibilité et l'impact visuel d'un document ou d'un site web, garantissant que le message soit non seulement clair mais aussi esthétiquement plaisant. Parallèlement, la hiérarchie visuelle permet d'organiser ces éléments selon leur importance, facilitant ainsi la navigation.\n\nL'identité visuelle est un autre aspect clé qui définit comment une marque se présente au monde. Cela inclut le logo, les couleurs et autres éléments graphiques qui véhiculent ses valeurs fondamentales. Une stratégie de branding bien pensée renforce cette identité en créant une image forte et mémorable auprès du public cible. Les couleurs jouent également un rôle crucial dans ce processus ; elles influencent les émotions et perceptions des consommateurs, rendant leur choix stratégique dans toute charte graphique.\n\nDans un monde numérique où l'accessibilité est primordiale, le responsive design s'impose comme une nécessité pour garantir que les contenus soient adaptés à toutes tailles d'écran. De même, un design mobile-friendly assure que l'expérience utilisateur reste optimale sur smartphones et tablettes.\n\nEnfin, il est important d'intégrer une approche inclusive lors de la conception afin de répondre aux besoins variés des utilisateurs tout en favorisant une expérience accessible à tous. En somme, concevoir des supports de communication visuelle implique une compréhension approfondie des principes du design graphique ainsi qu'une attention particulière aux détails qui façonnent l'image globale d'une marque.", "concepts": [{"concept": {"id": "a21faec3-d32a-4c71-91f4-aefc4c598939", "label": "Communication Visuelle", "definition": "La communication visuelle englobe l'utilisation cohérente de supports graphiques, tels que affiches, brochures et contenus numériques, pour transmettre des messages ou informations. Elle joue un rôle clé dans le marketing et l'identité de marque en influençant les perceptions des consommateurs à travers des éléments graphiques, couleurs et images. De plus, elle inclut la communication avec le client, un processus d'interaction essentiel pour établir une compréhension mutuelle entre professionnels et clients, garantissant ainsi la réussite d'un projet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13699, 13701, 13673, 13609, 13679], "aliases": ["58125d4c-6ec1-489e-8c15-d25a94ccd651", "d0c830b7-7fde-41e6-849e-586c41002ee4", "8eeff97f-c508-4632-b615-654dec3f3e0c", "66a2ee09-4d4e-43ea-8cda-49b7872845d3"], "wikientity": {"label": "Communication visuelle", "definition": "La communication visuelle est une spécialité liée aux domaines de l'image, du design graphique, de l'audiovisuel et de la publicité.", "page_id": "7704996", "wikidata_id": "Q1899679", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La communication visuelle est au cœur de la conception des supports de communication, car elle implique l'utilisation de divers éléments graphiques pour transmettre des messages efficacement."}, {"concept": {"id": "6207abd4-149c-401e-b794-d375c7f214f8", "label": "Design graphique", "definition": "Le design graphique est une discipline créative qui combine texte et images pour communiquer des idées et des messages visuellement. Elle est essentielle dans le développement d'interfaces attrayantes et dans la création de supports visuels variés, utilisant des éléments visuels à travers divers médias.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13691], "aliases": ["61b1a5ce-d40d-40d4-a0a8-2362ba6ce773", "34c6adf3-adf6-473a-8f5b-849c07a9f700"], "wikientity": {"label": "Graphisme", "definition": "Le graphisme est une discipline qui consiste à créer, choisir et utiliser des éléments graphiques (dessins, caractères typographiques, photos, couleurs, etc.) pour élaborer un objet de communication et/ou de culture. Chacun des éléments est symbolique et signifiant dans la conception du projet, selon les axes définis éventuellement avec d'autres intervenants du domaine de la communication (un directeur artistique par exemple), dans le but de promouvoir, d'informer ou d'instruire.\nSelon Annick Lantenois, docteur en histoire de l'art, « le design graphique peut être défini comme le traitement formel des informations et des savoirs.", "page_id": "129200", "wikidata_id": "Q185925", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le design graphique est fondamental pour concevoir des supports visuels, car il combine texte et images pour communiquer des idées, ce qui est essentiel dans le contexte de la communication visuelle."}, {"concept": {"id": "f4e300f8-90ef-46ab-b74c-5d3a191244d3", "label": "Cohérence Visuelle", "definition": "La cohérence visuelle, ou cohérence graphique, se réfère à l'harmonie et à l'uniformité dans l'utilisation des éléments graphiques d'un produit ou d'une marque, incluant les couleurs, polices et mise en page. Cela assure une communication claire et attrayante dans le design graphique, renforce la reconnaissance de marque et améliore son image sur le marché.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13677, 13689], "aliases": ["3766aed4-6ea7-46eb-a36f-a0c8602e6ec3", "a49d7b36-95f3-42da-a0f3-354161f77ef3"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "La cohérence visuelle est centrale à la conception de supports de communication, garantissant que tous les éléments graphiques fonctionnent ensemble pour transmettre un message clair."}, {"concept": {"id": "b5a1c1cb-d691-4f90-92ca-c78b26d6502b", "label": "Éléments de conception", "definition": "Les éléments de conception incluent tous les composants visuels comme les images, textes et boutons qui composent une interface utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les éléments de conception sont fondamentaux car ils constituent tous les composants nécessaires à la création efficace d'un support graphique."}, {"concept": {"id": "681bd960-0547-4e06-81c7-c87e899af05b", "label": "Conception et design web", "definition": "La conception et le design web désignent le processus de création d'interfaces numériques qui allient esthétique et fonctionnalité pour optimiser l'expérience utilisateur. Cela inclut la conception de l'interface utilisateur, l'intégration des éléments du site de manière accessible et fonctionnelle, ainsi que la prise en compte des palettes de couleurs et des tendances modernes telles que la commande vocale et le mode sombre. L'objectif est de rendre les sites non seulement attrayants mais aussi faciles à naviguer, répondant ainsi aux besoins contemporains des utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13692], "aliases": ["408a71e5-2328-4efc-b763-2f6ddd50204c", "b73e3b1f-6972-406b-82f8-69acf4925e52", "e970bfbc-ec61-4fbe-a66a-e65a0ad0ba8c", "4384a27b-4e99-442c-bbc8-dfa1980e56fe", "dec0a245-63b1-4b4c-bce7-12be12f6d362"], "wikientity": {"label": "Conception de site web", "definition": "La conception  et la création site web ou web design est la conception de l'interface web : l’architecture interactionnelle, l’organisation des pages, l’arborescence et la navigation dans un site web. La conception d'un design web tient compte des contraintes spécifiques du support Internet, notamment en matière d’ergonomie, d’utilisabilité et d’accessibilité.\nLe web design réclame donc des compétences en programmation, en ergonomie et en interactivité, ainsi qu'une bonne connaissance des contraintes techniques liées à ce domaine.", "page_id": "807249", "wikidata_id": "Q190637", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La conception et le design web sont au cœur du sujet, englobant tous les aspects nécessaires pour créer des interfaces attrayantes et fonctionnelles qui constituent des supports de communication visuelle."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "La lisibilité est essentielle pour toute forme de communication visuelle, car elle détermine comment le contenu est perçu et compris par le public."}, {"concept": {"id": "452c8ff6-03af-4eeb-9fec-38ce5719a647", "label": "Hiérarchie visuelle", "definition": "La hiérarchie visuelle organise les éléments d'une interface selon leur importance, facilitant la navigation et l'interaction utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "La hiérarchie visuelle est fondamentale dans tout design graphique; elle guide l'œil du spectateur et structure efficacement l'information dans les supports de communication."}, {"concept": {"id": "13bf45cc-94f8-4079-a369-9ec045162dd8", "label": "Logo", "definition": "Un logo est un élément graphique ou un symbole représentant une entreprise ou une marque, conçu pour créer une identité visuelle reconnaissable et mémorable. Il peut inclure des logos d'entreprises, qui sont des symboles graphiques souvent associés à des couleurs spécifiques pour véhiculer des valeurs telles que la confiance et l'identité. Le logotype, quant à lui, est une représentation stylisée du nom de l'entreprise qui renforce son identité de marque. Les logos jouent un rôle essentiel dans la reconnaissance de la marque par le public et sont utilisés dans divers contextes pour établir une connexion avec les clients et partenaires.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697, 13609, 13677, 13679, 13695], "aliases": ["4dbed2ed-3dfb-47fd-8d5a-93a21ae4bd42", "7a46f200-cbc0-4416-8136-098c569f01ac", "f32d8247-88cf-46d0-a6a4-14ffee94c108", "43820efd-e96f-4f34-8876-a532b9f0a27a", "273c9e14-d339-4f03-8577-f35e356af927", "d17d341e-a1ac-419a-bac5-19e0546c11dc"], "wikientity": {"label": "Logo", "definition": "Un logotype, ou logo en forme abrégée, est une composition figurée servant à identifier visuellement et de façon immédiate une entreprise, une marque, une association, une institution, un produit, un service, un événement ou toute autre sorte d'organisation, afin de les faire connaître et reconnaître des publics et marchés auxquels ils s'adressent et de les différencier des autres entités d'un même secteur d'activité. Les logos sont des modèles déposés dont la reproduction sans autorisation est punissable comme contrefaçon.\nConcernant les institutions et administrations publiques, on parle également de symboles, d'armes ou d'emblèmes officiels qui figurent sur des écus, des sceaux ou des drapeaux.", "page_id": "69038", "wikidata_id": "Q1886349", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "Le logo est fondamental dans toute stratégie de communication visuelle car il représente l'identité d'une marque et joue un rôle central dans sa reconnaissance."}, {"concept": {"id": "78a2772b-c13c-46f4-8638-760dc4473cec", "label": "Psychologie des couleurs", "definition": "L'étude de l'impact émotionnel et comportemental des couleurs sur les individus, influençant ainsi leurs interactions avec les marques, leur rôle crucial dans le branding et le design, ainsi que leur importance dans le marketing.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["1e575eed-e513-4c60-a389-c4b39534e1ff", "a24fd86a-29b9-4c66-ae91-9439535b892c"], "wikientity": {"label": "Psychologie des couleurs", "definition": "La psychologie des couleurs est l'étude de la perception humaine des couleurs et de l'impact des couleurs sur l'activité humaine.\nLa psychophysique se préoccupe, avec les méthodes de la psychologie expérimentale, de relier les perceptions de stimulus colorés à des grandeurs physiques.\nLes psychologues étudient l'effet des lumières et des surfaces colorées sur l'activité cérébrale et en particulier sur l'humeur des personnes qui leur sont confrontées.", "page_id": "319295", "wikidata_id": "Q2994659", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "La psychologie des couleurs est fondamentale dans la conception des supports de communication visuelle, influençant directement la perception et l'impact émotionnel sur le public."}, {"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "L'esthétique joue un rôle central dans la conception de supports de communication visuelle, influençant l'engagement et la perception du public."}, {"concept": {"id": "c125da14-d01f-43b2-a17e-e140031235d3", "label": "Identité Visuelle", "definition": "L'identité visuelle est l'ensemble des éléments graphiques, tels que le logo, les couleurs, la typographie et d'autres aspects visuels qui définissent et créent une image cohérente pour une marque ou un produit. Ces éléments visuels sont essentiels à l'identité de la marque, influençant son attrait esthétique et fonctionnel ainsi que sa reconnaissance par le public. Ils véhiculent les valeurs et l'activité de la marque à travers divers supports, contribuant ainsi à son image de marque globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13701, 13609, 13676, 13677, 13679, 13691, 13692, 13695], "aliases": ["6ed436f3-0444-4e49-8879-b222fdeac738", "6a0670cd-1dd2-4a61-93d8-e410f43ce503", "972f12c7-d7ea-43ec-b1c7-b445a3aab1df", "4e371124-894a-47c9-9640-29f8f38c7c6a", "76403c3e-6fe2-48a6-9441-ab306138df86", "0fdbfad3-557b-4b3b-a214-130350b568e8", "4488844b-4a4e-4edc-87c5-3eaec8bcb69b", "6a839e65-f2b2-4c9a-b6fb-14efbce4c820", "4d1f7d4c-9929-44ad-b198-91706dabb018", "b816dc26-a79e-40b6-bac1-d823158e6a13"], "wikientity": {"label": "Identité visuelle", "definition": "L'identité visuelle ou identité graphique est un ensemble d'éléments visuels cohérents qui permettent d'identifier une même entité au travers des différents médias de communication qu'elle émet. Elle exprime grâce à un style graphique propre à l'entreprise, les valeurs, l'activité et les ambitions de celle-ci et se traduit par des signes, des couleurs, des formes, des textes ainsi que des mises en forme. L'identité graphique se décline sur tout support : documents, tracts, enseigne matérielle, mais aussi sites web ou produits promotionnels.", "page_id": "1779853", "wikidata_id": "Q10299808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'identité visuelle joue un rôle crucial dans la création d'une image cohérente pour une marque, ce qui est directement lié à la conception de supports de communication visuelle."}, {"concept": {"id": "e4ae9c09-4ec8-4a59-9314-2e4c0c931e9b", "label": "Mise en page", "definition": "La mise en page (ou MEP) désigne le processus d'arrangement visuel des éléments graphiques et textuels sur une page, qu'elle soit imprimée ou numérique. Elle est essentielle pour l'expérience utilisateur sur un site web et dans d'autres supports visuels, car elle influence la lisibilité, l'esthétique, l'impact visuel et la clarté du message transmis ainsi que l'interaction avec le contenu. La MEP assure également une présentation cohérente et esthétique des documents.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13684, 13687, 13689], "aliases": ["2820af73-3b5d-4571-87ad-2c8b3b35023a", "d1811778-06d3-4715-acd2-6d6f55007f2b", "529c12dc-31c1-4106-b66d-787089356057", "1de5e449-7a2f-4249-a3c9-00fca42a6ccb"], "wikientity": {"label": "Mise en page", "definition": "La mise en page, ou mise en pages, est l'opération de disposition graphique d'un contenu informationnel dans un espace donné (feuille de papier, planche de bande dessinée, pages web, etc.).\nElle succède au travail de collecte et de composition du contenu (composition de texte « au kilomètre », collection des composants) et précède souvent le travail d'impression. Elle peut le précéder dans la mesure où elle est prédéfinie (dimensions des colonnes, styles du texte, placement des illustrations, etc.).", "page_id": "400658", "wikidata_id": "Q868954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La mise en page est essentielle pour organiser les éléments graphiques et textuels sur un support, influençant ainsi l'expérience utilisateur et la clarté du message transmis."}, {"concept": {"id": "039131d1-dccf-49b8-a9b9-0cfbc6bf50bb", "label": "Branding Strategy", "definition": "La stratégie de branding est un processus de planification et de création d'une image de marque forte et cohérente, qui englobe les éléments visuels et stratégiques utilisés pour établir une identité unique pour un produit ou une entreprise. Cela inclut l'utilisation réfléchie des couleurs, du design et de la communication afin d'attirer et fidéliser les clients.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["ef5c2eba-8e90-4afb-93cd-7a8c11df0cd7", "9eba0e8e-00d1-494e-a073-8c4f118fc776"], "wikientity": {"label": "Branding", "definition": "Le branding, ou valorisation de la marque dans le contexte du marketing, désigne la pratique de gestion des marques commerciales, et plus spécifiquement de l'image de marque des entreprises qui les utilisent. Cette discipline s'étend également aux individus, avec le personal branding ou marketing personnel.\nIl est important de souligner que le branding est une méthode essentielle pour les entreprises qui cherchent à différencier leur produit ou service de la concurrence et à renforcer leur positionnement sur le marché.", "page_id": "385673", "wikidata_id": "Q898030", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La stratégie de branding englobe les éléments visuels utilisés pour établir une identité unique, ce qui est central à la conception efficace des supports de communication visuelle."}, {"concept": {"id": "fc8880a5-691d-4981-889d-800a25d14ef6", "label": "Impact visuel", "definition": "Effet produit par des éléments graphiques sur l'attention et l'engagement des utilisateurs dans une interface numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'impact visuel est crucial dans la conception de supports de communication, car il détermine comment les éléments graphiques attirent l'attention et engagent le public."}, {"concept": {"id": "935551cf-6165-4e4b-87cd-713c326790b8", "label": "Couleurs", "definition": "Les couleurs sont des éléments fondamentaux qui influencent les émotions et les perceptions des consommateurs, jouant un rôle crucial dans le marketing, la fidélisation de la clientèle et le design graphique. Elles véhiculent des significations importantes et leur choix est essentiel dans une charte graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13695], "aliases": ["68f4f820-eb3d-4f17-bb52-2473a54adc4c"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les couleurs jouent un rôle fondamental dans le design graphique et influencent directement la perception des supports de communication visuelle."}, {"concept": {"id": "71c73ab5-d954-4cb2-a82a-62a39bda387b", "label": "Image de marque", "definition": "Perception collective d'une entreprise ou produit par le public, influencée par des éléments tels que les campagnes marketing innovantes et créatives, le design, la communication et l'expérience client.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701], "aliases": ["7bbed710-8337-4cc0-a962-762dc9caaefe"], "wikientity": {"label": "Image de marque", "definition": "L'image de marque (communément appelée Brand management en anglais) est la représentation perçue par le public d'une entreprise, d'une organisation ou d'une institution  (et de leurs services, de leurs produits et de leurs marques commerciales).\nL'image de marque est produite par la combinaison d'un ensemble de représentations résultant des relations entre deux ou de multiples entités, chacune pouvant simultanément ou alternativement être amenée à percevoir l'autre ou à vouloir l'influencer.\nLes représentations véhiculées ou associées à l'image de marque sont essentiellement « mentales » : même si elles nous parviennent via des médias et/ou supports concrets ayant explicitement une fonction de diffusion d'un message construit et délibéré, leur appropriation par chacun relève de l'acte individuel, avec tout ce qu'il peut être, c'est-à-dire subjectif, instable, sélectif, partial et simplificateur, mais aussi susceptible d'être partie à l'échange, d'être accessible au raisonnement, de laisser prise à l'influence, voire à la manipulation.", "page_id": "955419", "wikidata_id": "Q453181", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'image de marque est essentielle dans le contexte des supports de communication, car elle influence comment ces derniers sont perçus par le public."}, {"concept": {"id": "799b0fcd-3758-412d-9480-f4e259d0eee3", "label": "Grilles de mise en page", "definition": "Systèmes de lignes directrices utilisées pour organiser les éléments graphiques sur une page afin d'assurer cohérence et équilibre visuel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Grille (mise en page)", "definition": "Une grille typographique est une structure à deux dimensions, composée de séries d'axes verticaux et horizontaux se croisant. Elle est utilisée pour structurer un contenu.\nLa grille sert comme une armature sur laquelle un graphiste peut organiser textes et images de manière rationnelle et facile à comprendre.", "page_id": "4964937", "wikidata_id": "Q1519469", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les grilles de mise en page sont fondamentales pour organiser les éléments graphiques et assurer une bonne présentation dans les supports de communication visuelle."}, {"concept": {"id": "c8ec6455-753a-4309-8f50-93b1081ef04f", "label": "Marque", "definition": "Une marque est une identité d'entreprise ou de produit, façonnée par un ensemble d'éléments visuels tels que les polices et autres caractéristiques distinctives, ainsi qu'un langage et des valeurs uniques. Elle influence la perception du public et des consommateurs, ainsi que leur fidélité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676, 13679], "aliases": ["db3ada90-385a-46ff-8923-36eaa7dedaa9", "475b6b00-315d-460b-b8ce-d31b09541a78"], "wikientity": {"label": "Marque (marketing)", "definition": "Une marque est définie en France par le Code de la propriété intellectuelle comme un « signe servant à distinguer les produits ou services d'une personne physique ou morale de ceux d'autres personnes physiques ou morales ».\nLe Code de la propriété intellectuelle donne une liste des signes susceptibles de constituer une marque. Cette liste, assez large et non limitative comprend notamment : les noms patronymiques, les pseudonymes, les noms géographiques, les dénominations arbitraires ou de fantaisie, la forme caractéristique du produit ou de son conditionnement, les étiquettes, enveloppes, emblèmes, empreintes, timbres, cachets, vignettes, lisières, lisérés, combinaisons ou dispositions de couleurs, dessins, reliefs, lettres, chiffres, devises,, mais on peut ajouter les logotypes, les logos, les sigles, les acronymes, les jingles, etc.", "page_id": "8284217", "wikidata_id": "Q431289", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Marque", "definition": "a name given to a product or service", "name": "trade_name.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La marque est au cœur de tout support de communication visuelle, car elle définit l'identité et l'image que l'on souhaite transmettre au public."}, {"concept": {"id": "e69b8937-148b-41fa-aaf2-1e7598eb04bb", "label": "Approche inclusive", "definition": "Méthode de conception qui intègre diverses perspectives pour créer des expériences accessibles à tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'approche inclusive est cruciale dans la conception de supports de communication visuelle, car elle garantit que ces derniers sont accessibles et pertinents pour un large public."}, {"concept": {"id": "c96b9650-4c42-42c7-96af-a67b0a0e1c17", "label": "Espace blanc micro", "definition": "Espaces et tampons réduits autour du contenu, améliorant la lisibilité entre lettres, mots et paragraphes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'espace blanc micro est crucial pour améliorer la lisibilité et l'esthétique des supports de communication visuelle, ce qui en fait un concept très pertinent."}, {"concept": {"id": "06a274fb-c8f9-4a58-bb40-297d5d475e29", "label": "Identité de marque", "definition": "L'identité de marque est la perception collective des valeurs, missions et caractéristiques d'une entreprise, ainsi que sa représentation mentale construite par des éléments tels que le logo, les valeurs et l'identité visuelle. Elle est essentielle pour établir la confiance avec les consommateurs et influencer leur perception de la marque.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13677], "aliases": ["a165e594-cd7d-4def-8627-77862879e51d"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Identité de marque' est cruciale pour concevoir des supports qui reflètent correctement les valeurs d'une entreprise et influencent leur perception par le public."}, {"concept": {"id": "85c70636-d89f-4686-b3e9-7605299e4588", "label": "Personnalité de marque", "definition": "Traits distinctifs et humains attribués à une marque qui influencent la perception des consommateurs, leur engagement envers celle-ci et établissent une connexion émotionnelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676], "aliases": ["1d3a0dcc-31a1-4559-b783-8f628298ca2f"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La personnalité de marque est cruciale dans la conception des supports de communication visuelle, car elle influence comment une marque est perçue et connecte émotionnellement avec le public."}, {"concept": {"id": "b0d254d2-9826-4d8c-b2b0-a20a83a30a11", "label": "Signalisation", "definition": "Utilisation de panneaux ou affiches pour communiquer des informations importantes dans divers environnements publics ou commerciaux.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Signalisation", "definition": "signs collectively (especially commercial signs or posters)", "name": "signage.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La signalisation est un aspect clé de la communication visuelle, car elle utilise des éléments graphiques pour transmettre des informations importantes dans divers contextes."}, {"concept": {"id": "adc8dc13-f786-4914-8a14-7ba79f9406d6", "label": "Responsive Design", "definition": "La conception réactive, ou responsive design, est une approche de conception web qui permet aux sites et emails de s'adapter automatiquement à différentes tailles d'écran et formats. Elle ajuste dynamiquement le contenu selon la largeur de l'écran, optimisant ainsi l'expérience utilisateur sur tous les appareils, y compris mobiles et tablettes. Cette méthode garantit une accessibilité améliorée et une expérience utilisateur cohérente sans nécessiter la création de maquettes séparées. Avec l'augmentation du trafic mobile, cette approche est devenue essentielle pour répondre aux besoins variés des utilisateurs sur toutes les plateformes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13670, 13705], "aliases": ["efecb8a8-c6df-48af-bf39-bb4da8fd8376", "1f741a6d-bbf7-4bfe-b77b-a1ef82c29bc6", "e1917e2a-f148-467e-8262-4f1dd26e2f71", "cc031509-4f61-49ef-aa86-aa8c871fcb3e", "7bfb57a5-469b-4c0b-9487-f9afdcf3b3cd", "dfaa8d51-d283-479b-9fe7-b089a0e35db8", "54138ec5-0216-46c4-89a9-1c8119032f02", "a8bde322-f83e-42d7-9eb7-e659681882c6", "4fd67f4c-c4cf-4125-bea0-62c60a94d589", "4ea15d31-4c8b-47ac-8abd-3a55541f163e"], "wikientity": {"label": "Site web réactif", "definition": "Un site web réactif (RWD, de l’anglais responsive web design : conception de sites web réactifs) est un site web dont la conception vise, grâce à différents principes et techniques, à offrir une consultation confortable sur des écrans de tailles très différentes. L'utilisateur peut ainsi consulter le même site web à travers une large gamme d'appareils (moniteurs d'ordinateur, smartphone, tablettes, télévision…) avec le même confort visuel et sans avoir recours au défilement horizontal ou au zoom avant/arrière sur les appareils tactiles notamment, manipulations qui peuvent parfois dégrader l'expérience utilisateur, tant en lecture qu'en navigation. Un site web réactif est un exemple de plasticité des interfaces.", "page_id": "6049523", "wikidata_id": "Q420295", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le responsive design est essentiel pour concevoir des supports adaptés à divers appareils, garantissant ainsi une expérience utilisateur optimale sur tous les formats."}, {"concept": {"id": "92624aaa-4551-4d42-a460-b3a086384c80", "label": "Mobile-friendly", "definition": "Un design mobile-friendly désigne une interface adaptée aux appareils mobiles, garantissant une expérience utilisateur fluide sur smartphones et tablettes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Un design mobile-friendly est crucial pour s'assurer que les supports de communication fonctionnent bien sur les appareils mobiles, ce qui est essentiel dans le monde numérique actuel."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le wireframing est fondamental pour visualiser et structurer les éléments d'une interface avant le design final, ce qui en fait un concept central dans la conception de supports de communication."}, {"concept": {"id": "6d5d7744-04f9-4571-8296-6f2959eb74a4", "label": "Empathy Map", "definition": "Outil visuel et collaboratif utilisé en design UX pour comprendre les besoins, émotions et comportements des utilisateurs, en les classant selon quatre dimensions : ce qu'ils disent, pensent, font et ressentent. Cet outil permet d'identifier leurs pensées afin d'améliorer leur expérience et l'expérience client.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["59e15c4d-dc92-4414-be00-2c0d8009a146", "a276feda-0117-4a74-9957-3db0b2ec4885"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'Empathy Map est un outil crucial pour concevoir des supports qui répondent aux besoins et émotions des utilisateurs, ce qui est fondamental dans la communication visuelle."}, {"concept": {"id": "fd683f12-a578-42c9-907d-87830c9294a7", "label": "Objectif", "definition": "Un objectif est un résultat souhaité ou un but précis que le persona cherche à atteindre, influençant ses décisions d'achat et ses interactions avec les marques. Il peut également représenter un problème clairement défini à résoudre lors de séances créatives, comme la création d'un logo ou d'une campagne publicitaire. Cet objectif oriente les idées générées et les réflexions des participants, étant essentiel pour le travail créatif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13697, 13609], "aliases": ["c956ab83-62d0-4c82-98d7-cdc549b91642", "c662abc2-0a4c-469d-92cf-41695b31a315"], "wikientity": null, "wordnetentity": {"label": "Objectif", "definition": "the goal intended to be attained (and which is believed to be attainable)", "name": "aim.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "L'objectif est essentiel dans le processus créatif pour concevoir des supports de communication, car il guide les décisions et les idées générées lors de la création."}, {"concept": {"id": "b98cc38b-e8fc-4a81-9b12-cd74415bfe33", "label": "Typographie", "definition": "La typographie et les typographies désignent l'art et la technique de conception, disposition et arrangement des caractères écrits, englobant les styles de caractères utilisés dans le design graphique. Elles influencent non seulement l'esthétique et la lisibilité d'un projet visuel, mais jouent également un rôle crucial dans la communication visuelle, l'identité de marque ainsi que sur les interfaces numériques, les sites web et le design graphique. La typographie est essentielle dans la création d'une charte graphique pour assurer une cohérence visuelle et une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13677, 13695, 13691, 13697], "aliases": ["a5f9e57f-d8ef-433a-bee8-72850d9e7bc4", "16977d1d-0eb8-41de-8313-5be3bc5516c6", "0d929f72-8926-4ac7-a255-879691d962fd", "35a3a46a-d73b-49da-a3c8-eeba12ad75eb", "622dad7b-3959-42fd-8dbc-91d27a87a331", "233ebff6-0f5e-4ed0-8cc7-8f9854240dec", "8dac89b4-5eb2-4637-a123-7b82fa715808", "df52cd48-10e9-4473-9d58-1060bec54379"], "wikientity": {"label": "Typographie", "definition": "La typographie (souvent abrégée en « typo ») regroupe les différents procédés d’impression utilisant des caractères et des formes en relief. Le terme « typographie » peut aussi désigner l’art d’utiliser les différents types de caractères dans un but esthétique[réf. souhaitée] et pratique.", "page_id": "22011", "wikidata_id": "Q159964", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Typographie", "definition": "the craft of composing type and printing from it", "name": "typography.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La typographie influence fortement l'esthétique et la lisibilité des supports visuels, ce qui en fait un élément important dans la conception de communications efficaces."}, {"concept": {"id": "ec8e7214-c2d2-4b69-bf1a-b572d9bcb7d3", "label": "Palette de couleurs", "definition": "Une palette de couleurs est un ensemble harmonieux et spécifique de teintes sélectionnées pour être utilisées dans l'identité visuelle d'une marque, le design d'un site web ou d'autres projets créatifs. Elle joue un rôle crucial dans la création d'une expérience utilisateur positive, influence la perception émotionnelle et psychologique des consommateurs, évoque des émotions et contribue à la perception globale de la marque auprès de son audience, tout en impactant également le comportement des consommateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13677, 13691], "aliases": ["2c29fcba-baa1-40e2-9664-fb835fd21aef", "cfd47ccb-a8d5-4e47-8d1a-2f4ca7323766", "d2ec4843-1099-46ea-a483-9b24b49d6d8e", "78786962-1a00-45d5-9662-efcbf8a722a6", "a3483a35-be74-4313-8b80-3af473ca1d09"], "wikientity": {"label": "Palette de couleurs", "definition": "En infographie, une palette de couleurs est un ensemble fini de couleurs stocké servant à l'affichage d'images numériques.\n\nVoici les utilisations les plus courantes de l'expression « palette de couleurs » en informatique :\n\nl'ensemble des couleurs qu'un système est capable de générer ou de gérer (selon les limitations de mémoire vidéo, il est possible qu'il ne puisse pas les afficher toutes en même temps) :\npar exemple, on dit des systèmes d'affichage de type Highcolor qu'ils ont une palette RVB 16 bits, c'est-à-dire qu'ils sont potentiellement capables d'afficher 65 536 couleurs différentes (en tout) ;\nla sélection de couleurs qui peut être affichée simultanément :\nsoit sur l'écran entier :\nsoit à l'aide d'une palette fixe : un terminal d'affichage donné peut offrir un choix de couleurs prédéterminés, en sélectionnant une palette parmi celles établies à l'avance par le constructeur. Le choix d'une de ces palettes se fait en plaçant les bonnes valeurs dans les registres électroniques du matériel.", "page_id": "244810", "wikidata_id": "Q2357944", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Une palette de couleurs bien choisie contribue à l'identité visuelle et à l'impact émotionnel des supports de communication, rendant son utilisation pertinente dans ce contexte."}, {"concept": {"id": "1ef72a7e-5e74-4275-8671-d3b08e7e6482", "label": "Design System", "definition": "Un design system est une bibliothèque standardisée d'éléments graphiques, de composants réutilisables et de règles de branding unifiées, qui assurent la cohérence visuelle et fonctionnelle dans le développement de produits, sites ou applications. Il vise à standardiser le développement et à garantir une expérience utilisateur homogène à travers plusieurs produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13700], "aliases": ["9dbaffae-3852-4454-b66b-2adfc8c61863", "959c321e-cd66-4ef2-beec-74a58976030e"], "wikientity": {"label": "Système de design", "definition": "Un système de design, un système de conception ou un design system est un ensemble de composants réutilisables et de normes claires qui peuvent être assemblés pour créer un nombre illimité d'applications. Les systèmes de design aident à la conception de produits numériques et au développement de produits tels que des applications mobiles ou des sites Web. Ils peuvent contenir, sans toutefois s'y limiter, des bibliothèques de modèles/composants, des dictionnaires de conception, des guides de style (police, couleur, espacement, placement), des composants codés, des langages de marque et de la documentation.", "page_id": "16328891", "wikidata_id": "Q81875083", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Un design system est essentiel pour assurer la cohérence et l'efficacité dans la création de supports visuels, ce qui en fait un concept très pertinent."}, {"concept": {"id": "8986f6e6-8893-4dba-9f6f-c99a82031423", "label": "Marketing Visuel", "definition": "Le marketing visuel est une stratégie qui utilise des éléments graphiques et visuels, tels que les couleurs et les images, pour communiquer des messages de marque et influencer les décisions d'achat des consommateurs. Cette approche s'inscrit dans le cadre plus large du marketing, qui englobe l'ensemble des techniques et disciplines visant à promouvoir et vendre des produits ou services, en tenant compte de l'analyse du comportement des consommateurs et en adaptant les stratégies de communication aux besoins et préférences des clients.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["9363be2b-91fb-4d33-a602-3fbc0dbef39b", "1678dc58-b244-45e9-8c04-01a9bdc0c2b7", "c6843d06-35f6-4971-b141-356ee52f4fb9"], "wikientity": {"label": "Marketing", "definition": "Le marketing, ou la mercatique, est le processus d'identification des clients et de « création, communication, livraison et échange » de biens et services pour la satisfaction et la fidélisation de ces clients. C'est l'un des principaux composants de business management et du commerce.\nLe marketing est généralement réalisé par le vendeur, généralement un détaillant ou un fabricant.", "page_id": "26873", "wikidata_id": "Q39809", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Marketing", "definition": "the commercial processes involved in promoting and selling and distributing a product or service", "name": "marketing.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Le marketing visuel utilise des éléments graphiques pour communiquer efficacement, ce qui est pertinent pour concevoir des supports de communication visuelle."}, {"concept": {"id": "bbec4b6c-ecb2-4980-a828-4ea2e6a15f47", "label": "Cohérence", "definition": "Uniformité dans le design et les interactions au sein d'une interface ou d'une application, favorisant une meilleure compréhension et garantissant une expérience fluide pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["df6e29c5-d22e-4955-90b8-9e1627d2e164"], "wikientity": null, "wordnetentity": {"label": "Cohérence", "definition": "a harmonious uniformity or agreement among things or parts", "name": "consistency.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La cohérence dans le design favorise une meilleure compréhension et expérience utilisateur, ce qui est crucial lors de la création de supports visuels."}, {"concept": {"id": "c77ed02b-0fb4-4d78-a785-6748da59a221", "label": "Détails visuels (visual clues)", "definition": "Indices graphiques comme flèches ou boutons qui guident l'utilisateur dans son interaction avec l'interface, importants pour une bonne UX.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les détails visuels sont essentiels pour guider l'utilisateur dans une interface, ce qui est crucial pour la conception de supports de communication visuelle."}, {"concept": {"id": "b241dc54-885f-43bb-95cb-3ef642526d51", "label": "Contraste important", "definition": "Un contraste important entre le CTA et son environnement améliore sa visibilité, augmentant ainsi les chances d'interaction de l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un contraste important est crucial pour la visibilité des éléments sur un support graphique, ce qui le rend très pertinent pour la conception visuelle."}, {"concept": {"id": "417084bb-0812-4550-a4a3-09b5eb918f81", "label": "Carte de chaleur", "definition": "Visualisation graphique montrant les zones d'attention des utilisateurs, où les couleurs chaudes indiquent une forte concentration visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Carte thermique", "definition": "Une carte thermique (carte de fréquentation, ou heat map en anglais signifiant littéralement carte de chaleur) est une représentation graphique de données statistiques qui fait correspondre à l'intensité d'une grandeur variable une gamme de tons ou un nuancier de couleurs sur une matrice à deux dimensions (qui peut elle-même représenter une zone géographique). Ce procédé permet de donner à des données un aspect visuel plus facile à saisir qu'un tableau de statistiques.\nLes cartes thermiques servent notamment à représenter l’activité humaine, notamment la fréquence de passage de personnes (par exemple, des cyclistes ou des clients) ou la fréquence d’événements (par exemple, des délits ou des pluies) dans une zone donnée.", "page_id": "8185096", "wikidata_id": "Q1140423", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La carte de chaleur est directement liée à l'analyse des interactions visuelles et peut aider à concevoir des supports plus efficaces en identifiant les zones d'attention."}, {"concept": {"id": "514c7ecc-9e10-4abe-a404-ca202ca68562", "label": "Cible", "definition": "Élément visuel ou interactif sur un écran que l'utilisateur doit atteindre, influençant la facilité d'utilisation des interfaces.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Cible", "definition": "Une cible est un objet portant une zone destinée à être visée, souvent représentée par des cercles concentriques. Il est utilisé dans des sports ou jeux tels que le tir à l'arc, les fléchettes ou encore le tir sportif.", "page_id": "8842683", "wikidata_id": "Q1047579", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Cible", "definition": "the goal intended to be attained (and which is believed to be attainable)", "name": "aim.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Les cibles sur une interface influencent directement l'expérience utilisateur et sont essentielles lors de la conception d'éléments interactifs dans les supports visuels."}, {"concept": {"id": "4190c5da-f744-44ca-8f52-21c2d10d8c28", "label": "Marges intérieures", "definition": "Espacement interne autour du texte ou du contenu dans un élément graphique ou un document, crucial pour la lisibilité et l'esthétique, tout en évitant que le contenu ne touche les bords, garantissant ainsi une présentation élégante.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13684], "aliases": ["abc0a284-aa9f-4917-abf5-46e08cd64a9d"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les marges intérieures sont essentielles pour assurer une présentation soignée et lisible des contenus graphiques, ce qui est fondamental dans tout support de communication."}, {"concept": {"id": "ce263010-cd1c-40ee-b69c-26b68f9c921c", "label": "Taille de police", "definition": "Dimension des caractères typographiques, déterminante pour la lisibilité sur différents écrans, notamment mobile et desktop.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La taille de police influence directement la lisibilité et l'impact visuel d'un support, ce qui en fait un concept important dans la conception graphique."}, {"concept": {"id": "2cc1fd58-2698-4a16-bf76-906b7ccf06b1", "label": "Couleur attractive", "definition": "Une couleur attractive attire l'attention et crée un contraste, essentielle pour rendre un CTA visible et engageant.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Une couleur attractive joue un rôle clé dans l'engagement du public et l'efficacité des supports visuels, rendant ce concept pertinent."}, {"concept": {"id": "9ef5d004-3d27-440e-9373-d381c7adf196", "label": "Normes de référence", "definition": "Les normes de référence et les conventions de design sont des standards établis dans le design d'interface qui guident les choix esthétiques et fonctionnels, en utilisant des éléments familiers pour assurer la clarté, l'intuitivité et la facilité d'utilisation pour les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["6902c164-d477-4583-b311-398c1e548f21"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Normes de référence' guident les choix esthétiques et fonctionnels en design, ce qui est essentiel pour créer des supports efficaces."}, {"concept": {"id": "bd5bf8ed-7343-4cf4-bc86-9b55e876cc0a", "label": "Icon fonts vectorielles", "definition": "Typographie spécialisée utilisée pour remplacer des images matricielles par des icônes évolutives, améliorant ainsi la performance du chargement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les icon fonts vectorielles sont directement liées à la conception de supports visuels, car elles améliorent l'esthétique et la performance des éléments graphiques dans les communications visuelles."}, {"concept": {"id": "b60f29c1-9378-4606-9329-db1022ed53dc", "label": "Maquettes", "definition": "Les maquettes sont des représentations visuelles détaillées d'un site ou d'une application, basées sur les wireframes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Maquette", "definition": "Une maquette est une représentation partielle ou complète d'un système ou d'un objet (existant ou en projet) afin d'en tester et valider certains aspects et/ou le comportement (maquette fonctionnelle), ou simplement à des fins ludiques (maquette de jeu) ou informatives (présentation pédagogique ou commerciale d'une réalisation ou d'un projet).\nLa maquette peut être réalisée en deux ou trois dimensions, à une échelle donnée, le plus souvent réduite ou agrandie pour en faciliter la visualisation ou la manipulation. Elle peut être statique ou dynamique, et dans ce dernier cas on parlera alors de modélisme.", "page_id": "562630", "wikidata_id": "Q6498959", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les maquettes sont essentielles pour concevoir des supports de communication visuelle, car elles permettent de visualiser et d'organiser les éléments graphiques avant la réalisation finale."}, {"concept": {"id": "75d68080-9dcf-49ee-922a-c7f9c363c518", "label": "Espace blanc macro", "definition": "Zones plus larges sans contenu, optimisant la mise en page d'un site web pour une meilleure navigation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'espace blanc macro est crucial pour optimiser la mise en page et améliorer l'expérience utilisateur sur les supports de communication visuelle."}, {"concept": {"id": "65a2d925-96a7-48d0-94eb-7917f284ca13", "label": "Navigation", "definition": "La navigation, ou système de navigation, désigne le processus et les systèmes utilisés pour se déplacer efficacement et intuitivement à travers les différentes sections ou pages d'une interface web ou d'une application. Cela inclut l'utilisation de menus, de tables des matières, de plans du site et d'autres méthodes qui contribuent à une expérience fluide, à l'ergonomie, à la compréhension du site et à l'accessibilité. Les systèmes de navigation facilitent également la recherche d'informations via des moteurs de recherche intégrés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13666, 13708], "aliases": ["5f336d11-a83e-4c09-b404-30caf3494f2e", "c7ba75e2-9acf-40e4-b21f-c85f713d24b5", "79990658-2b4b-49e2-890e-ea7343e190ce", "886ea679-2ba8-4a0b-885b-281920a96a5e", "810c55c8-6be9-4b80-9b41-622b41ddf2e9"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La navigation est cruciale pour l'expérience utilisateur dans les supports de communication visuelle, facilitant l'accès à l'information et améliorant la compréhension globale."}, {"concept": {"id": "651462cc-89f1-4744-8c0b-129d7b6ece1a", "label": "Espace blanc actif", "definition": "Zones vides ajoutées intentionnellement pour guider l'œil du visiteur vers un objectif de conversion.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'espace blanc actif est crucial dans la conception visuelle pour diriger l'attention et améliorer l'expérience utilisateur, ce qui le rend très pertinent pour concevoir des supports de communication."}, {"concept": {"id": "14a7c3b0-165d-4a3c-87e1-070360341462", "label": "Clarté", "definition": "Qualité d'une interface qui permet aux utilisateurs de comprendre facilement son fonctionnement, essentielle pour éviter la confusion.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Clarté", "definition": "free from obscurity and easy to understand; the comprehensibility of clear expression", "name": "clarity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La clarté est essentielle dans la conception de supports de communication visuelle, car elle permet aux utilisateurs de comprendre facilement le message véhiculé."}, {"concept": {"id": "428549b4-6b1b-49f2-afdf-65890ef5cd30", "label": "Atomic Design", "definition": "L'atomic design est une méthode systématique de conception d'interface qui décompose les interfaces en composants plus petits et réutilisables, permettant ainsi une construction modulaire, évolutive et favorisant une meilleure cohérence visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13680], "aliases": ["0164746b-3388-423b-a975-eb1cb6dcd3b7"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Atomic Design' favorise une approche systématique qui peut améliorer la cohérence et l'efficacité des interfaces utilisées pour communiquer visuellement."}, {"concept": {"id": "369b7a26-1dcf-4e54-98d6-f4de3cf4ea76", "label": "Gris", "definition": "Couleur mature associée à l'autorité, idéale pour des marques sérieuses cherchant à projeter une image professionnelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Gris", "definition": "a neutral achromatic color midway between white and black", "name": "gray.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La couleur gris est très pertinente pour concevoir des supports de communication visuelle, car elle joue un rôle clé dans l'image professionnelle et l'autorité d'une marque."}, {"concept": {"id": "4a9e551b-4295-49f2-a6ac-4631482d9cbc", "label": "Couleur jaune", "definition": "Le jaune est une couleur qui symbolise la joie, la chaleur, la connaissance et la communication. Elle est souvent utilisée en marketing pour créer une image accessible et dynamique, notamment dans le secteur automobile, tout en attirant l'attention et favorisant les interactions sociales.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["c31f8365-a353-4b67-af63-12b493d981e6"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La couleur jaune a une forte pertinence dans le design graphique et marketing, influençant l'attrait et l'accessibilité des supports visuels."}, {"concept": {"id": "0ea0214b-d2ae-4016-a1fa-6254c2fdae62", "label": "Polices sécurisées pour le web", "definition": "Polices de caractères conçues pour être affichées correctement sur tous les navigateurs et systèmes d'exploitation, garantissant une compatibilité universelle et une accessibilité sans téléchargement sur tous les appareils.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["5103cea3-52bd-4d82-9de1-bbce475f08c4"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les polices sécurisées pour le web sont essentielles dans la conception de supports de communication visuelle, car elles garantissent que le texte est lisible et accessible sur différents appareils, ce qui est fondamental pour une communication efficace."}, {"concept": {"id": "0ddf6c00-325e-44b2-bd25-99b086552b49", "label": "Publicité", "definition": "Utilisation stratégique des éléments distinctifs pour capter l'attention et améliorer la mémorisation des produits.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Publicité", "definition": "a public promotion of some product or service", "name": "ad.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La publicité utilise des éléments graphiques pour capter l'attention, ce qui est pertinent pour la conception de supports visuels destinés à promouvoir une marque ou un produit."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La simplicité dans le design favorise une expérience utilisateur optimale et peut améliorer l'efficacité des communications visuelles en réduisant le désordre graphique."}, {"concept": {"id": "37a02651-c6bb-408a-951d-6929a942b944", "label": "Mises en page typographiques", "definition": "Pratique de conception graphique qui utilise la typographie comme élément principal pour créer des mises en page visuellement attrayantes, souvent sur des supports variés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Mise en page", "definition": "La mise en page, ou mise en pages, est l'opération de disposition graphique d'un contenu informationnel dans un espace donné (feuille de papier, planche de bande dessinée, pages web, etc.).\nElle succède au travail de collecte et de composition du contenu (composition de texte « au kilomètre », collection des composants) et précède souvent le travail d'impression. Elle peut le précéder dans la mesure où elle est prédéfinie (dimensions des colonnes, styles du texte, placement des illustrations, etc.).", "page_id": "400658", "wikidata_id": "Q868954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Les mises en page typographiques sont importantes pour créer des designs attrayants, mais elles ne couvrent pas tous les aspects de la communication visuelle."}, {"concept": {"id": "a1404173-c5d7-4e4d-8eb4-7cde5be9aa12", "label": "Juana", "definition": "Police contrastée avec traits épais et fins, utilisée dans le design de logos et l'édition pour son attrait visuel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La police Juana peut contribuer à l'attrait visuel d'un support, bien qu'elle ne soit pas aussi essentielle que d'autres concepts comme les grilles ou les éléments de conception."}, {"concept": {"id": "b7f3ab09-f46e-45d8-9b95-901dffa38b32", "label": "Typographie minimaliste", "definition": "Utilisation restreinte de styles typographiques pour assurer la lisibilité et l'harmonie visuelle dans le design web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La typographie minimaliste contribue à une meilleure lisibilité et harmonie dans le design, ce qui est important pour les supports visuels mais moins central que d'autres concepts."}, {"concept": {"id": "7adda1c3-151f-487e-b8e4-5c72c5b16153", "label": "Contenu digital", "definition": "Informations sous forme écrite ou visuelle diffusées en ligne, jouant un rôle clé dans l'attraction et l'engagement des clients potentiels.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le contenu digital est essentiel pour la communication visuelle, car il englobe les informations qui doivent être présentées de manière attrayante et engageante."}, {"concept": {"id": "a82871a5-eecb-4ae1-b335-e15891acf7c6", "label": "Modèles", "definition": "Les modèles sont des structures préétablies utilisées dans les logiciels pour faciliter la création rapide d'éléments tels que pages ou projets.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les modèles facilitent la création rapide d'éléments graphiques et peuvent donc jouer un rôle important dans le processus de conception des supports visuels."}, {"concept": {"id": "77d2848d-4052-4aac-8a1b-a3afa391821f", "label": "Caractères typographiques", "definition": "Symboles graphiques utilisés dans l'écriture, reflétant souvent la personnalité de leurs créateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les caractères typographiques jouent un rôle important dans l'esthétique des supports visuels, contribuant à leur personnalité et impact global."}, {"concept": {"id": "93df51d2-b867-4764-98b3-741e958349b8", "label": "Argesta", "definition": "Police de titre élégante, parfaite pour des produits haut de gamme ou des présentations visuelles raffinées.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Argesta est une police de titre qui peut être utilisée dans des supports de communication visuelle, bien qu'elle ne soit pas centrale à la conception elle-même."}, {"concept": {"id": "33ae6cac-a3d3-47c4-8953-b2ba35227721", "label": "Blanc", "definition": "Couleur neutre souvent utilisée en branding pour accentuer d'autres couleurs, symbolisant pureté et simplicité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Blanc", "definition": "Le blanc est un champ chromatique caractérisé par une impression de forte luminosité, sans aucune teinte dominante.\nPour certains, le blanc n'est pas une couleur, soit qu'ils suivent la pratique des teinturiers et des peintres, pour lesquels la couleur se pose sur un support blanc, donc sans couleur, soit qu'ils estiment que « c'est la teinte obtenue en mélangeant la lumière de toutes les couleurs » comme l'ont montré les expériences de Isaac Newton. Pour d'autres, et suivant les théories de Goethe, de Hering et de nombreux autres, le blanc opposé au noir est une des trois paires de couleurs pures qui orientent la perception visuelle.", "page_id": "58550", "wikidata_id": "Q23444", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Blanc", "definition": "the quality or state of the achromatic color of greatest lightness (bearing the least resemblance to black)", "name": "white.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "Le blanc est une couleur essentielle en design graphique, souvent utilisée pour créer des contrastes et mettre en valeur d'autres éléments, ce qui est pertinent pour la communication visuelle."}, {"concept": {"id": "8d4377fb-c38c-4201-82e3-e8d16a0dbaa6", "label": "Polices à empattements", "definition": "Les polices à empattements, ou serif, sont des typographies avec des extensions aux extrémités des lettres, souvent associées à un style formel et professionnel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": {"label": "Empattement (typographie)", "definition": "En typographie, les empattements sont les petites extensions qui terminent les extrémités des caractères dans certaines polices d’écriture, dites avec empattement (au singulier ; serif en anglais), que l’on oppose aux polices sans empattement (sans serif). Une diagonale forme avec son empattement un angle appelé angle d’empattement, caractéristique d’une police. On distingue parfois l’obit, aussi appelé empattement de tête ou empattement supérieur, de l’empattement dit empattement de pied ou empattement inférieur.", "page_id": "155616", "wikidata_id": "Q243449", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Les polices à empattements peuvent jouer un rôle important dans le style et l'impact des supports graphiques, contribuant ainsi à leur efficacité en tant qu'outils de communication."}, {"concept": {"id": "76746bfe-dff0-422d-a324-2558e5f235ba", "label": "Typographie brutaliste", "definition": "Approche typographique audacieuse et non conventionnelle, souvent utilisée pour créer un impact visuel fort sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La typographie brutaliste peut être un choix pertinent dans la conception de supports visuels, car elle vise à créer un impact fort, ce qui est souvent recherché dans la communication visuelle."}, {"concept": {"id": "9a1d9758-2bf4-4d78-b380-0ac7ecd64594", "label": "Mobile First", "definition": "Stratégie de conception web où la version mobile est priorisée pour offrir une expérience utilisateur optimale sur les appareils mobiles, tout en tenant compte des défis potentiels liés à la créativité et à l'adaptabilité lors de l'affichage sur des écrans plus grands.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["ccae50aa-7239-4994-9837-dcc9d486ba5c"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La stratégie Mobile First influence fortement la conception des supports visuels en priorisant l'expérience utilisateur sur mobile, ce qui est essentiel dans le contexte actuel."}, {"concept": {"id": "a492c6a1-645d-40c2-a45d-6663c6237af0", "label": "Garamond", "definition": "Police de caractère humaniste développée au XVIe siècle par Claude Garamond, appréciée pour son esthétique agréable, sa lisibilité et son élégance dans l'édition, idéale pour les impressions et les designs textuels denses.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["fc980dbe-d5ad-4d9e-ae78-2de6d484b699"], "wikientity": {"label": "Garamond (police de caractères)", "definition": "Garamond est un groupe de polices de caractères serif, nommé d’après le graveur Claude Garamont (vers 1480-1561), à l’origine de la famille des « garaldes ». La plupart des polices qui portent aujourd’hui le nom de « Garamond » sont dérivées du travail ultérieur du typographe Jean Jannon. Les versions romaines du Sabon, Granjon, et les Garamond de Stempel et Adobe ont une relation directe avec les caractères de Claude Garamont.", "page_id": "3780336", "wikidata_id": "Q246110", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Garamond est une police de caractère qui contribue à l'esthétique des supports visuels, ce qui en fait un choix pertinent pour la communication visuelle."}, {"concept": {"id": "dbd8e3b9-2092-44ac-b7a7-b21f322d368a", "label": "Expérience en 3 dimensions", "definition": "Approche du design web qui considère l'interaction comme immersive, intégrant des éléments visuels et interactifs pour enrichir l'expérience.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'expérience en trois dimensions peut enrichir les supports visuels en ajoutant une dimension immersive, bien qu'elle ne soit pas toujours nécessaire pour tous les types de communications."}, {"concept": {"id": "43c0b3db-0ac0-4592-90e0-26b86d58aef3", "label": "Conception Adaptative", "definition": "La conception adaptative est une méthode de conception web qui utilise plusieurs mises en page fixes, chacune adaptée à des tailles d'écran spécifiques, afin d'offrir une expérience utilisateur optimale et personnalisée selon le dispositif utilisé. Contrairement au design réactif, cette technique crée des maquettes distinctes pour chaque appareil, garantissant ainsi que l'interface s'ajuste efficacement aux caractéristiques uniques de chaque écran.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": ["6dd8aac0-218d-4d57-aa5a-2213b8bce526", "4201bddf-d824-4bbb-ad6b-4152869692f4"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La conception adaptative est pertinente car elle concerne la création d'interfaces adaptées aux différents dispositifs, ce qui est essentiel dans le contexte de supports de communication visuelle modernes."}, {"concept": {"id": "825a6c0b-a0a0-4df7-ae57-d53914d4be9c", "label": "Bouton efficace", "definition": "Un bouton efficace est visible et engageant, conçu pour inciter les utilisateurs à cliquer grâce à son apparence et sa position.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un bouton efficace contribue à l'interaction avec les supports numériques, mais il s'agit d'un élément fonctionnel plutôt que d'un aspect central de la communication visuelle."}, {"concept": {"id": "414356d9-d24a-455a-9e29-3c67c1f3ec66", "label": "Esthétique des polices", "definition": "Impact visuel des polices sur la perception d'une marque, déterminant leur adéquation avec l'image souhaitée.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'esthétique des polices impacte effectivement la perception d'une marque dans les supports visuels, bien qu'elle soit un aspect spécifique parmi plusieurs autres considérations en design."}, {"concept": {"id": "59c3284e-d083-4f4b-9350-60505b47748f", "label": "User Flow", "definition": "Représentation visuelle du parcours d'un utilisateur à travers une application ou un site web, essentielle pour optimiser l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le user flow est pertinent car il aide à visualiser comment les utilisateurs interagissent avec un support, ce qui peut influencer sa conception."}, {"concept": {"id": "2abdfa96-c7d0-41f7-b80c-a92629620619", "label": "Largeur du CTA", "definition": "Espace horizontal autour du texte dans un bouton d'appel à l'action, important pour une présentation visuelle agréable.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La largeur du CTA est importante pour l'esthétique et l'efficacité d'un support visuel, bien qu'elle ne soit qu'un aspect parmi d'autres dans sa conception globale."}, {"concept": {"id": "c231e437-254e-457e-95c6-a99c3ae0c5b2", "label": "Wording", "definition": "Choix des mots utilisés dans un message ou un bouton, crucial pour attirer l'attention et inciter à l'action.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le wording joue un rôle important dans la conception des supports de communication visuelle en influençant la perception du message et en incitant à l'action, bien qu'il soit plus axé sur le contenu que sur l'aspect visuel lui-même."}], "exercises": [{"exercise": {"id": "27f72194fe76474eb0a9bbbd1d1a154a", "question": "Quelle option permet d'adapter un site à toutes les tailles d'écran mobile ?", "answers": ["Le site responsive design permet cette adaptation"], "distractors": ["Un site minimaliste conçu uniquement pour ordinateur.", "La personnalisation des menus déroulants fixes.", "Un site avec des images haute résolution spécifiques.", "La réduction de la taille des polices manuellement.", "L'ajout de sections cachées non visibles sur mobile.", "L'activation d'un mode hors ligne universel.", "L'optimisation des vidéos HD pour tablette.", "Une application dédiée à chaque utilisateur mobile.", "La modification aléatoire des couleurs d'arrière-plan."], "feedback": "Le site responsive design est une option qui permet de créer un site web adapté à toutes les tailles d'écran mobile. Il s'agit d'un design flexible qui s'ajuste automatiquement à la taille de l'écran sans nécessiter une gestion manuelle des éléments. Cela garantit une expérience utilisateur optimale sur tous les types d'appareils mobiles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé de la référence, à savoir le responsive design, qui est essentiel pour concevoir des supports de communication visuelle adaptés à différentes tailles d'écran. La question cible spécifiquement cette compétence et les options proposées permettent de distinguer le responsive design des autres approches moins pertinentes. L'explication fournie renforce la pertinence de l'exercice en clarifiant pourquoi le responsive design est crucial pour une expérience utilisateur optimale. Cependant, une légère amélioration pourrait être apportée en intégrant davantage d'éléments liés à la cohérence visuelle ou à l'identité de marque dans les distracteurs."}, {"exercise": {"id": "046002d154f54faba26d356d715ab78c", "query": "Pour offrir une bonne expérience utilisateur sur mobile, il est important d'adapter l'interface de votre site à la taille de l'écran, ce qui peut être réalisé grâce à un site <blank>.", "answers": ["responsive design"], "distractors": [["statique", "interactif", "multi-plateforme", "dynamique", "minimaliste", "augmenté"]], "feedback": "Le terme 'responsive design' fait référence à une technique de conception qui ajuste automatiquement l'affichage du site en fonction de la taille et la résolution de l'écran utilisé. Cela permet aux utilisateurs de smartphone ou tablette d'avoir une meilleure expérience sans avoir à zoomer ou faire défiler horizontalement. Contrairement aux autres options proposées, seule cette approche vise spécifiquement à adapter l'affichage à différents appareils de manière fluide.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un concept clé mentionné dans la référence, à savoir le 'responsive design', qui est essentiel pour garantir une expérience utilisateur optimale sur différents appareils. La question teste la capacité de l'apprenant à identifier ce terme spécifique et à comprendre son importance dans le contexte de la communication visuelle et du design graphique. Les distracteurs proposés sont pertinents car ils représentent des concepts liés au design, mais qui ne répondent pas à la question posée. Cela renforce l'évaluation de la connaissance précise du responsive design par rapport aux autres approches. Cependant, un léger manque de diversité dans les types de questions pourrait justifier une note légèrement inférieure à 10."}, {"exercise": {"id": "71bf5ddcb822486fa3600aadc42c02eb", "question": "Quelle est une utilisation clé d'un Stylescape dans la communication avec un client ?", "answers": ["Donner une idée claire de l'apparence du projet final"], "distractors": ["Vérifier la compatibilité des logiciels utilisés.", "Comparer différents prototypes techniques.", "Organiser des réunions internes régulières.", "Expliquer le concept stratégique derrière la campagne.", "Approuver le budget global du projet.", "Finaliser les aspects techniques du projet.", "Analyser les retours utilisateurs post-lancement.", "Optimiser les aspects fonctionnels et ergonomiques.", "Résoudre les problèmes logistiques du projet."], "feedback": "L'une des utilisation clé d'un Stylescape dans la communication avec un client est de leur donner une idée claire de l'apparence du projet final, afin qu'ils puissent se projeter et comprendre le résultat attendu. Les autres propositions ne sont pas correctes car elles ne sont pas directement liées à la communication avec le client ou ne font pas référence à l'apparence du projet final.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un outil spécifique (Stylescape) utilisé dans le cadre de la communication visuelle, ce qui est pertinent par rapport à la référence sur la conception de supports de communication visuelle. La question cible un aspect clé du design graphique, à savoir comment présenter une idée au client pour assurer une bonne compréhension du projet final. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus larges liés à l'identité visuelle ou à la cohérence graphique, qui sont également des concepts centraux dans la synthèse fournie."}, {"exercise": {"id": "52606c0f2a784a0f8bab387798a3f493", "query": "Le Stylescape permet de communiquer efficacement avec les clients en leur donnant une idée claire de <blank> du projet final.", "answers": ["l'apparence et de la sensation"], "distractors": [["la rentabilité et de l'ergonomie", "le public cible et des délais", "les étapes de production et de l'esthétique", "les contraintes techniques et de l'interface", "la palette de couleurs et des typographies", "les technologies utilisées et des coûts"]], "feedback": "Le Stylescape communique aux clients une vision globale du projet, notamment en ce qui concerne 'l'apparence et la sensation', car cela reflète l'émotion et l'ambiance que le projet de design doit transmettre. Les autres options ne mentionnent pas directement cet aspect visuel et émotionnel clé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un concept clé lié à la communication visuelle, en se concentrant sur le Stylescape, qui est un outil de design graphique permettant de transmettre l'apparence et la sensation d'un projet. Cela s'aligne bien avec les objectifs de la référence, qui souligne l'importance de l'identité visuelle et des éléments graphiques dans la conception des supports de communication. Cependant, il aurait pu être encore plus pertinent en intégrant des éléments supplémentaires liés à la cohérence visuelle ou à l'impact émotionnel des couleurs et typographies, ce qui aurait renforcé son lien avec les concepts abordés dans la synthèse."}, {"exercise": {"id": "0404cd7946624d6ea2cefbd59a30a15e", "statement": "Un Stylescape est utilisé pour mieux communiquer avec les clients ou les parties prenantes.", "veracity": true, "feedback": "Un des objectifs clés d'un Stylescape est en effet de faciliter la communication en fournissant une vision claire du résultat attendu à toutes les personnes impliquées, y compris les clients ou autres parties prenantes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la communication visuelle, en particulier l'utilisation d'un Stylescape pour améliorer la communication avec les clients et parties prenantes. Cela s'inscrit bien dans le contexte de la conception de supports de communication visuelle, qui vise à transmettre des messages clairs et engageants. Cependant, l'exercice pourrait être renforcé en demandant aux apprenants d'expliquer comment un Stylescape contribue spécifiquement à des éléments tels que la cohérence visuelle ou l'identité de marque, ce qui lui aurait permis d'atteindre une note maximale."}, {"exercise": {"id": "7a9bfae2718c4ec894908d42d69a0337", "question": "Quel est l'objectif principal d'un design system ?", "answers": ["Créer un système standardisé englobant tous les éléments graphiques et visuels"], "distractors": ["Faciliter uniquement la communication entre développeurs sans autres éléments.", "Améliorer la sécurité des données en développement produit.", "Se concentrer sur le développement du backend d'un produit.", "Optimiser exclusivement la performance technique des produits numériques.", "Gérer les bugs et correctifs de manière centralisée.", "Automatiser entièrement le processus de développement logiciel.", "Organiser tous les tests de performance pour un projet donné.", "Encourager l’utilisation des frameworks open-source dans le produit.", "Développer des environnements virtuels pour les phases de tests."], "feedback": "L'objectif principal d'un design system est de regrouper tous les éléments visuels et graphiques, ainsi que les règles, le branding et le ton dans un système standardisé pour faciliter le processus de développement et assurer cohérence et efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de supports de communication visuelle, en se concentrant sur l'objectif principal d'un design system. Ce dernier est essentiel pour assurer la cohérence visuelle et l'identité de marque, qui sont des éléments cruciaux mentionnés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des questions plus directement liées aux principes de mise en page ou à l'impact émotionnel des couleurs, afin de couvrir un éventail plus large des concepts abordés dans la référence."}, {"exercise": {"id": "4c03f6a0173c41d68cc1d8eb88688d21", "question": "Qu'englobe généralement un design system dans le processus de création d'un produit ?", "answers": ["Les éléments graphiques, visuels, règles, ton, branding, etc"], "distractors": ["Les fonctionnalités techniques, algorithmes et optimisation de performances.", "Les vecteurs de sécurité et protocoles cryptographiques pour le produit.", "Le suivi exclusif des tests utilisateurs et retours clients.", "La gestion complète des bases de données et serveurs.", "Les diagrammes UML et documentation interne sur l’architecture produit.", "La conception des interfaces hardware et leurs connectiques.", "Les outils de déploiement cloud et gestion continue du produit.", "La rédaction de contrats juridiques et gestion de licences.", "L'analyse des statistiques de vente et tendances du marché."], "feedback": "Un design system englobe généralement tous les éléments liés à l'apparence et l'identité d'un produit, tels que les graphiques, les règles de style, le ton et le branding. Cela permet une création plus cohérente et efficace du produit, en assurant une identité visuelle unifiée et identifiable par les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des éléments qui composent un design system, ce qui est pertinent pour le sujet de la conception de supports de communication visuelle. En effet, un design system inclut des aspects tels que les éléments graphiques, le branding et les règles visuelles, qui sont tous essentiels à une communication visuelle efficace. Cependant, l'exercice pourrait être amélioré en se concentrant davantage sur des concepts spécifiques mentionnés dans la synthèse, comme la hiérarchie visuelle ou l'identité visuelle d'une marque. Néanmoins, il reste très pertinent et montre une bonne compréhension des principes du design graphique."}, {"exercise": {"id": "21e7e2693b444fba8f147080ae5c1e65", "question": "Que permet d'établir l'ajout d'une baseline à une marque ?", "answers": ["Une identité visuelle homogène pour toutes les parties prenantes"], "distractors": ["Un plan marketing spécifique pour les clients réguliers", "Une stratégie de référencement optimisée sur les moteurs de recherche", "Une différenciation uniquement auprès des fournisseurs locaux", "Un nouveau segment de marché pour les produits innovants", "Des innovations produit adaptées aux besoins spécifiques des consommateurs", "Une politique tarifaire compétitive en fonction des régions", "Un engagement fort envers la durabilité et l'écologie", "Une meilleure portée publicitaire pour les marchés internationaux", "Une segmentation accrue au sein du marché local"], "feedback": "L'ajout d'une baseline à une marque permet de renforcer son identité visuelle et de la rendre plus cohérente pour toutes les parties prenantes. Cela peut également aider à différencier la marque des autres sur le marché.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a14a2eeb39634a12bf5d599f9a24c789", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Afin d'asseoir son positionnement et de renforcer son nom de marque, il peut être complété par une baseline, aussi appelé slogan ou punchline. Sa mise en place garantie une identité visuelle homogène que pourront s'approprier les collaborateurs, les clients et toutes les parties prenantes (fournisseurs, partenaires, ... ).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "0202c10711334a238a7d1c828b2522cc", "next_id": "669f1e772dbe48bebb0245be17e5450f", "prev_id": "40a5031d6bf14574bb98fdc0bf308e61", "associated_block_ids": [], "first_page": 12, "last_page": 18, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance d'une baseline dans le cadre de l'identité visuelle d'une marque, ce qui est un aspect clé de la référence sur la conception des supports de communication visuelle. La réponse correcte souligne que l'ajout d'une baseline contribue à une identité visuelle homogène, ce qui est en ligne avec les concepts de cohérence et d'identité visuelle abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des éléments plus directement liés aux autres aspects du design graphique mentionnés, tels que la hiérarchie visuelle ou le responsive design."}, {"exercise": {"id": "6e6772c68ba74d0f875c0cfbec11ddb3", "query": "Un design system regroupe tous les éléments graphiques ainsi que ceux liés aux règles <blank> dans un seul système standardisé.", "answers": ["de branding"], "distractors": [["de développement", "de codage", "de fonctionnalité", "de performance", "de navigation", "d'architecture"]], "feedback": "Le branding fait référence à l'identité visuelle et aux éléments qui définissent l'image d'une marque, donc il est directement lié aux aspects graphiques et de ton d'un produit. Un design system inclut cet aspect, afin de garder une cohérence visuelle et narrative dans tout le produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension des concepts de branding et d'identité visuelle, qui sont des éléments clés dans la conception de supports de communication visuelle. En demandant à l'apprenant de compléter une phrase sur un design system, il teste sa capacité à relier les éléments graphiques aux règles de branding, ce qui est pertinent par rapport à la référence. Cependant, l'exercice pourrait être amélioré en incluant davantage d'éléments liés à la mise en page ou à la hiérarchie visuelle pour couvrir plus largement les aspects mentionnés dans la synthèse."}, {"exercise": {"id": "e11c2ad84ac74e07a8f72c3b516e8280", "statement": "Un design system ne concerne que les éléments graphiques d'un produit.", "veracity": false, "feedback": "Un design system englobe non seulement les éléments graphiques, mais aussi des aspects comme les règles, le branding et le ton, afin de créer un système standardisé réunissant tous les points de contact entre les acteurs du développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de supports de communication visuelle, en particulier l'idée que le design system ne se limite pas aux éléments graphiques. Cela fait écho à la synthèse qui souligne l'importance de l'identité visuelle et du branding dans la création d'une image cohérente pour une marque. L'affirmation et son explication permettent de tester la connaissance des apprenants sur les différents aspects qui composent un design system, ce qui est pertinent par rapport à la référence. Cependant, l'exercice pourrait être amélioré en intégrant des questions plus directement liées aux éléments spécifiques mentionnés dans la synthèse, comme la hiérarchie visuelle ou le responsive design."}, {"exercise": {"id": "4cc91b3570c44bd6b1da6c8f3f90d7d2", "question": "Que désigne le terme espace blanc en conception d'interface ?", "answers": ["Le vide autour ou à l'intérieur des éléments de la conception"], "distractors": ["La couleur utilisée pour les polices de texte", "Les bordures des fenêtres de dialogue", "La taille prédéfinie des sections", "Un affichage en mode plein écran", "Le contraste entre différents blocs", "La distance entre deux images", "La zone dédiée aux animations", "Un type spécifique de cadre dans l'interface", "La forme générale de l'interface"], "feedback": "L'espace blanc, également appelé espace négatif, désigne les vides autour ou à l'intérieur des éléments de la conception. Cet espace peut être utilisé de manière stratégique pour améliorer la lisibilité et la mise en valeur des différents éléments de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé en design graphique, à savoir l'espace blanc, qui est essentiel pour la mise en page et la hiérarchie visuelle dans la conception de supports de communication. Bien que l'espace blanc ne soit pas explicitement mentionné dans la référence, il est implicite dans les discussions sur la mise en page et l'impact visuel. La question permet aux apprenants de démontrer leur connaissance des éléments de conception qui influencent l'expérience utilisateur. Cependant, une note parfaite n'est pas attribuée car l'exercice pourrait être élargi pour inclure d'autres concepts directement liés à la communication visuelle et à l'identité de marque."}, {"exercise": {"id": "995e290cda554dceb9314682933f7829", "statement": "L'espace blanc, ou espace négatif, est utilisé pour représenter les parties textuelles du design.", "veracity": false, "feedback": "L'espace blanc, également appelé espace négatif, se réfère au vide autour ou à l'intérieur des éléments de conception, et non aux parties textuelles. Il s'agit d'un élément clé pour améliorer la lisibilité et la hiérarchie visuelle dans un design.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du design graphique, à savoir l'utilisation de l'espace blanc (ou espace négatif) dans la conception visuelle. Bien que l'affirmation initiale soit incorrecte, la réponse correcte souligne son importance pour la lisibilité et la hiérarchie visuelle, qui sont des éléments essentiels mentionnés dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des questions supplémentaires sur d'autres aspects de la communication visuelle ou en demandant des exemples concrets d'application de ces concepts."}, {"exercise": {"id": "2e4690c8ed0e457c984b12c5a4c9dc8a", "question": "Que désignent les micro-espaces blancs dans une conception graphique ?", "answers": ["Les petits espaces/tampons créés autour du contenu pour plus d'aération"], "distractors": ["Les grandes zones vides placées intentionnellement pour guider le lecteur", "Les couleurs claires utilisées pour alléger visuellement une page", "Les lignes invisibles délimitant les paragraphes dans un texte structuré", "Les éléments graphiques utilisés pour attirer l'attention sur le contenu", "Les zones d'ombre ajoutées pour créer un effet de relief", "Les marges de sécurité pour éviter les débordements de texte", "Les espaces réservés pour insérer des images ou des vidéos", "Les interlignes ajustables selon la police choisie pour le texte", "Les bordures entourant chaque section afin de garantir la lisibilité"], "feedback": "Les micro-espaces blancs sont créés autour du contenu pour aérer visuellement la mise en page et éviter un aspect trop chargé. Ils peuvent également être ajustés pour des raisons esthétiques, mais ils sont toujours présents même s'ils ne sont pas voulus.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé du design graphique, à savoir l'utilisation des micro-espaces blancs dans une conception. Ce concept est pertinent pour la création de supports de communication visuelle, car il touche à la mise en page et à l'esthétique, qui sont des éléments essentiels pour assurer une communication efficace. La question permet de tester si l'apprenant comprend comment ces espaces contribuent à l'aération et à la lisibilité d'une conception. Cependant, bien que cela soit important, l'exercice pourrait être amélioré en incluant des questions sur d'autres aspects mentionnés dans la synthèse, comme la hiérarchie visuelle ou l'identité visuelle."}, {"exercise": {"id": "8b3728dd11bd494ba78edaebcae7fbd9", "question": "Qu'est-ce que l'identité de marque correspond dans une entreprise ?", "answers": ["La façon dont la marque souhaite être perçue des consommateurs"], "distractors": ["L'image que la marque renvoie à son secteur", "Les produits fabriqués par la marque", "Les couleurs et logos choisis par l'entreprise", "Les valeurs morales que la marque affiche publiquement", "La stratégie de vente utilisée pour attirer les clients", "La perception réelle des clients envers la marque", "La réputation générale d'une entreprise sur le marché", "Le positionnement tarifaire adopté par la marque", "L'influence exercée par la marque sur ses concurrents"], "feedback": "L'identité de marque est la façon dont l'entreprise souhaite être perçue par les consommateurs, c'est-à-dire l'image qu'elle veut véhiculer d'elle-même. Ce n'est pas la même chose que l'image réelle de la marque, qui peut être différente de l'image souhaitée. Si ces éléments ne sont pas en cohérence et en complémentarité les uns avec les autres, la marque perd en force et en consistance, ce qui peut affecter son existence même sur le marché.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "102eb3bfe4f64b6abbf6b3dc49caf7fb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "L'identité de marque est la façon dont la marque souhaite être perçue des consommateurs. À ne pas confondre avec l'image, qui est la façon dont elle est perçue en réalité. Plus ces éléments sont puissants, cohérents et complémentaires entre eux, plus la marque est forte. Plus ils sont disparates ou mal ordonnés, sans but ni vision, moins la marque a de consistance et donc tout simplement d'existence. La marque est l'un des atouts les plus précieux d'une entreprise, par conséquent elle doit être soigneusement développée de façon à véhiculer une image fidèle et authentique.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "08c3f261177746b69c798e54c1627476", "next_id": "b8f73805d49e4ba68055fbd8846cc0dd", "prev_id": "2213d60e15f04ad7baec34dc5488be52", "associated_block_ids": [], "first_page": 7, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'identité de marque, qui est un concept clé dans la conception des supports de communication visuelle. La question posée permet d'explorer comment une entreprise souhaite être perçue par les consommateurs, ce qui est directement lié à la manière dont elle utilise des éléments graphiques pour véhiculer son image. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects du design graphique et de la cohérence visuelle mentionnés dans la synthèse. Il aurait pu inclure des éléments supplémentaires sur l'importance de la mise en page ou des couleurs dans le cadre de l'identité visuelle pour obtenir une note parfaite."}, {"exercise": {"id": "fd178c2ab0c14279aaea886449c5dcf5", "question": "Qu'est-ce que l'utilisation de la palette de couleurs vise à susciter chez le client ?", "answers": ["L'excitation et l'envie d'acheter"], "distractors": ["La confusion et l'hésitation", "Une baisse d'intérêt", "Un besoin de réflexion supplémentaire", "Le désintérêt complet", "Un sentiment de frustration", "Un sentiment de nostalgie", "Un élan de générosité", "L'indécision totale", "Une envie de comparer"], "feedback": "La palette de couleurs est un outil important dans le marketing, car elle permet de créer une certaine ambiance et de véhiculer des émotions chez le consommateur. En utilisant des couleurs vives et attrayantes, les entreprises espèrent susciter l'envie d'acheter chez leurs clients potentiels.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9eca0f5c0e1a4df1af54860d0362fcd9", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Il n'y a pas de palette de couleurs magique, qui garantira à toutes les entreprises d'augmenter leur taux de manière spectaculaire (si seulement !). Elle suscite l'excitation et donne envie à vos clients d'acheter vos produits. Si vous ne me croyez pas, croyez-en les chiffres : 59% des entreprises marchandes (en France) utilisent du rouge dans leur logo et leur branding.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "96e09cc557744373a4bae49ba4fabd3f", "next_id": "50b0c36bfa8140f1a6bf04b540e6a9ab", "prev_id": "6342a00f7600424d956b139c2890738d", "associated_block_ids": [], "first_page": 355, "last_page": 357, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la palette de couleurs dans la communication visuelle, un concept clé mentionné dans la référence. En effet, l'utilisation stratégique des couleurs est essentielle pour influencer les émotions et perceptions des consommateurs, ce qui est en ligne avec le contenu synthétisé. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant d'autres aspects du design graphique ou en demandant une analyse plus approfondie sur comment les couleurs contribuent à l'identité visuelle globale d'une marque."}, {"exercise": {"id": "cb4a03730c6749b5b9c5f5ea1c76f217", "statement": "La psychologie des couleurs est la théorie selon laquelle les couleurs influencent uniquement nos comportements sans affecter nos émotions ou réactions.", "veracity": false, "feedback": "Cette affirmation est incorrecte car la psychologie des couleurs fait référence non seulement à l'influence des couleurs sur nos comportements mais aussi sur nos réactions et émotions. Les deux derniers aspects sont omis dans l'affirmation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8885ba63ca2444a2aa84d91c37b6d406", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "WhatFont permet à tout utilisateur de connaître la police d'un site web en seulement quelques clics. En plus de donner le style d'écriture, cette extension Google ajoute une série d'informations relatives au font : On parle de psychologie des couleurs lorsque l'on fait référence à l'influence spécifique des couleurs sur nos comportements, réactions et émotions.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "73d9c536fad04c9eaf13514896d9c728", "next_id": "d2f2e56c156a4baeac54d2fe89c98b43", "prev_id": "09ef2946c6184a2bae746fcc2074912c", "associated_block_ids": [], "first_page": 313, "last_page": 332, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de la psychologie des couleurs, qui est un aspect clé de la communication visuelle et du design graphique. Bien que l'exercice ne couvre pas tous les éléments mentionnés dans la référence, il aborde un concept fondamental lié à l'identité visuelle et à l'impact émotionnel des couleurs sur le public. La question de la véracité permet d'analyser si l'apprenant comprend que les couleurs influencent non seulement le comportement mais aussi les émotions, ce qui est essentiel pour concevoir des supports de communication efficaces. Cependant, l'exercice pourrait être amélioré en intégrant d'autres concepts comme la cohérence visuelle ou la hiérarchie visuelle pour une évaluation plus complète."}, {"exercise": {"id": "5e73416fc7b4418c8ecc13488cacf5bb", "question": "Quelles valeurs doivent être retransmises par les choix iconographiques faits par une marque?", "answers": ["Les valeurs propres de la marque doivent être retransmises"], "distractors": ["Les goûts personnels du créateur doivent prédominer", "Les tendances passagères du marché sont prioritaires", "Les attentes aléatoires de tout public cible doivent être reflétées", "Les idées fixes de l'équipe marketing doivent guider", "Les préférences des actionnaires sont déterminantes", "Les opinions des influenceurs sont à suivre aveuglément", "Les standards esthétiques internationaux priment toujours", "Les concepts abstraits sans lien avec la marque doivent être inclus", "Les avis des fournisseurs doivent orienter les choix"], "feedback": "Les choix iconographiques d'une marque doivent être fidèles et pertinents pour transmettre ses valeurs propres et les personnifier, afin que les consommateurs puissent se reconnaître dans la marque et s'identifier à ses valeurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4454bf17c36b4b499a8513bff7825af6", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le potentiel narratif des images est puissant, il permet à la marque d'instaurer un lien de confiance, de jouer la transparence, de se raconter, et de se montrer. Il faut donc, en amont, s'approprier les valeurs propres à chaque marque afin de les retransmettre et de les personnifier au travers de choix iconographiques fidèles et pertinents.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "27266f7e7f2b4867bc38a6608f4c2ae0", "next_id": "9a7b46fdedf44331ab9b51b4c73b1310", "prev_id": "27266f7e7f2b4867bc38a6608f4c2ae0", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13673, "doc_label": "Connect jour 3", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des valeurs que doit véhiculer une marque à travers ses choix iconographiques, ce qui est en lien direct avec le concept d'identité visuelle abordé dans la référence. La question cible un aspect clé de la communication visuelle, à savoir comment les éléments graphiques doivent refléter les valeurs fondamentales de la marque. Cependant, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur la cohérence visuelle ou l'impact des choix iconographiques sur l'expérience utilisateur, ce qui lui aurait permis d'obtenir une note plus élevée."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de supports de communication visuelle, en se concentrant sur l'importance de la standardisation des éléments graphiques et visuels au sein d'une organisation. Cela est directement pertinent pour le sujet de la référence, qui aborde la cohérence visuelle et l'identité graphique. Cependant, bien que cela touche un aspect important du design graphique, l'exercice pourrait être amélioré en intégrant des questions plus variées sur d'autres éléments mentionnés dans la synthèse, comme la hiérarchie visuelle ou le responsive design."}, {"exercise": {"id": "4dcd98681d734b2aa739660c42531602", "question": "Quel est l'impact des polices de caractères sur une marque ?", "answers": ["Elles influencent la manière dont le public perçoit la marque"], "distractors": ["Elles déterminent la vitesse de chargement d'une page web.", "Elles n’ont aucun impact sur la perception du public.", "Elles définissent uniquement l’aspect esthétique d’un site sans autre conséquence.", "Elles ne concernent que l'ergonomie technique du site.", "Elles agissent sur la sécurité des informations du site.", "Elles influencent uniquement les fonctionnalités interactives du site.", "Elles augmentent la durée nécessaire au développement d'un site web.", "Elles modifient principalement le modèle commercial de l'entreprise.", "Elles influencent la popularité des moteurs de recherche utilisés."], "feedback": "Les polices de caractères ont un impact sur la perception d'une marque car elles contribuent à l'aspect esthétique du site web. Des polices bien choisies peuvent transmettre une image professionnelle, créative ou moderne, tandis que des polices inadaptées peuvent donner une impression négligée ou peu efficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c809e8459a1245b2bb2030116436e04c", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Mais choisir entre les meilleures polices de caractères web et les meilleures polices de caractères web-safe n'est pas la seule décision que vous devrez prendre. Vous devez également déterminer quel style de typographie convient le mieux à l'image de votre marque ainsi qu'à votre site web. Certaines polices sont plus adaptées à de longs blocs de texte, tandis que d'autres seront plus utiles pour créer des titres accrocheurs, etc. Et bien sûr, les polices de caractères auront une influence différente sur la manière dont votre marque sera perçue par le public.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "dbb59e71462a4981aec690f602f9d01d", "next_id": "ebb291163e95475d9d46c4b2e2a26406", "prev_id": "dbb59e71462a4981aec690f602f9d01d", "associated_block_ids": [], "first_page": 286, "last_page": 286, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'impact des polices de caractères sur la perception d'une marque, ce qui est un aspect clé de la communication visuelle et du design graphique abordé dans la référence. La question cible directement un élément fondamental du design graphique, en lien avec l'identité visuelle et les émotions que peuvent susciter les choix typographiques. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects de la conception visuelle mentionnés dans la synthèse, comme la cohérence visuelle ou le responsive design. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "746a31176f214847a7dd209acb387b9c", "statement": "Les polices de caractères que vous choisissez influencent la manière dont votre marque est perçue par le public.", "veracity": true, "feedback": "Les polices de caractères jouent un rôle important dans la perception publique de la marque. Elles peuvent renforcer une image professionnelle, ludique ou sérieuse selon leur style, et donc affecter l'identité de la marque.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c809e8459a1245b2bb2030116436e04c", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Mais choisir entre les meilleures polices de caractères web et les meilleures polices de caractères web-safe n'est pas la seule décision que vous devrez prendre. Vous devez également déterminer quel style de typographie convient le mieux à l'image de votre marque ainsi qu'à votre site web. Certaines polices sont plus adaptées à de longs blocs de texte, tandis que d'autres seront plus utiles pour créer des titres accrocheurs, etc. Et bien sûr, les polices de caractères auront une influence différente sur la manière dont votre marque sera perçue par le public.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "dbb59e71462a4981aec690f602f9d01d", "next_id": "ebb291163e95475d9d46c4b2e2a26406", "prev_id": "dbb59e71462a4981aec690f602f9d01d", "associated_block_ids": [], "first_page": 286, "last_page": 286, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des polices de caractères dans la communication visuelle, ce qui est un aspect clé du design graphique et de l'identité visuelle mentionnés dans la référence. En demandant à l'apprenant d'évaluer la véracité d'une affirmation sur les polices de caractères, il teste leur capacité à relier les concepts théoriques à des applications pratiques. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres aspects du design graphique ou en demandant une analyse plus approfondie pour atteindre une note parfaite."}, {"exercise": {"id": "61694f170e634343b1a8bfe679f1cf1f", "question": "Que se passe-t-il quand les éléments d'une marque sont mal ordonnés et sans vision ?", "answers": ["Elle perd en consistance, voire en existence"], "distractors": ["Elle devient plus puissante et influente sur les consommateurs", "Elle acquiert une image plus cohérente et fiable", "Elle est perçue comme plus authentique par les consommateurs", "Elle attire de nouveaux clients grâce à sa clarté stratégique", "Elle développe rapidement une nouvelle identité de marque solide", "Elle améliore sa notoriété auprès du grand public", "Elle renforce ses valeurs fondamentales et ses objectifs à long terme", "Elle fidélise davantage de clients grâce à une image unifiée", "Elle devient concurrentielle dans de nouveaux segments de marché"], "feedback": "L'ordre et la vision sont des éléments importants pour la construction et le développement de l'identité de marque d'une entreprise. Si ces éléments sont absents ou mal définis, la marque peut perdre en cohérence et en force, ce qui peut la rendre moins visible et mener à une perte de notoriété et de clientèle. Une identité de marque solide et bien définie est donc essentielle pour le succès d'une entreprise.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "102eb3bfe4f64b6abbf6b3dc49caf7fb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "L'identité de marque est la façon dont la marque souhaite être perçue des consommateurs. À ne pas confondre avec l'image, qui est la façon dont elle est perçue en réalité. Plus ces éléments sont puissants, cohérents et complémentaires entre eux, plus la marque est forte. Plus ils sont disparates ou mal ordonnés, sans but ni vision, moins la marque a de consistance et donc tout simplement d'existence. La marque est l'un des atouts les plus précieux d'une entreprise, par conséquent elle doit être soigneusement développée de façon à véhiculer une image fidèle et authentique.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "08c3f261177746b69c798e54c1627476", "next_id": "b8f73805d49e4ba68055fbd8846cc0dd", "prev_id": "2213d60e15f04ad7baec34dc5488be52", "associated_block_ids": [], "first_page": 7, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'ordre et de la vision dans la construction de l'identité de marque, ce qui est un aspect clé du chapitre sur la conception des supports de communication visuelle. La question posée permet d'explorer les conséquences d'une mauvaise gestion des éléments graphiques et stratégiques d'une marque, en lien avec les concepts de cohérence visuelle et d'identité. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments plus spécifiques sur le design graphique ou les principes de mise en page pour une évaluation encore plus complète des compétences liées à la conception visuelle."}, {"exercise": {"id": "e4d063fea55b42349dfea85a30a9b23e", "query": "L'identité de marque correspond à la manière dont une marque souhaite être perçue tandis que l'image de marque est <blank>.", "answers": ["la perception réelle par les consommateurs"], "distractors": [["la manière dont la concurrence voit la marque", "un symbole graphique associé à la marque", "l'objectif que la marque vise à atteindre", "le slogan utilisé pour définir la marque", "l'ensemble des produits proposés par la marque", "une vision idéale partagée par l'entreprise"]], "feedback": "L'image de marque fait référence à la perception réelle que les consommateurs ont de la marque, tandis que l'identité de marque est la manière dont la marque souhaite être perçue. C'est la différence entre l'intention projetée et la réalité perçue.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "102eb3bfe4f64b6abbf6b3dc49caf7fb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "L'identité de marque est la façon dont la marque souhaite être perçue des consommateurs. À ne pas confondre avec l'image, qui est la façon dont elle est perçue en réalité. Plus ces éléments sont puissants, cohérents et complémentaires entre eux, plus la marque est forte. Plus ils sont disparates ou mal ordonnés, sans but ni vision, moins la marque a de consistance et donc tout simplement d'existence. La marque est l'un des atouts les plus précieux d'une entreprise, par conséquent elle doit être soigneusement développée de façon à véhiculer une image fidèle et authentique.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "08c3f261177746b69c798e54c1627476", "next_id": "b8f73805d49e4ba68055fbd8846cc0dd", "prev_id": "2213d60e15f04ad7baec34dc5488be52", "associated_block_ids": [], "first_page": 7, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension des concepts d'identité de marque et d'image de marque, qui sont des éléments clés dans la conception de supports de communication visuelle. Bien que l'exercice ne couvre pas directement tous les aspects du design graphique ou des éléments visuels mentionnés dans la synthèse, il aborde un aspect fondamental de la communication visuelle : comment une marque se présente et est perçue par le public. La distinction entre identité et image de marque est essentielle pour créer des supports cohérents et efficaces. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à la mise en page ou à l'utilisation des couleurs, qui sont également cruciaux dans le contexte global de la communication visuelle."}, {"exercise": {"id": "9a3bef4c94c54b70b668190447bfb78f", "statement": "Une marque bien développée doit véhiculer une image cohérente et authentique pour être forte.", "veracity": true, "feedback": "Une marque se renforce quand son identité et son image sont cohérentes, puissantes et alignées. Cela signifie qu'une image fidèle et authentique permet à une marque d'acquérir plus de consistance et de valeur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "102eb3bfe4f64b6abbf6b3dc49caf7fb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "L'identité de marque est la façon dont la marque souhaite être perçue des consommateurs. À ne pas confondre avec l'image, qui est la façon dont elle est perçue en réalité. Plus ces éléments sont puissants, cohérents et complémentaires entre eux, plus la marque est forte. Plus ils sont disparates ou mal ordonnés, sans but ni vision, moins la marque a de consistance et donc tout simplement d'existence. La marque est l'un des atouts les plus précieux d'une entreprise, par conséquent elle doit être soigneusement développée de façon à véhiculer une image fidèle et authentique.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "08c3f261177746b69c798e54c1627476", "next_id": "b8f73805d49e4ba68055fbd8846cc0dd", "prev_id": "2213d60e15f04ad7baec34dc5488be52", "associated_block_ids": [], "first_page": 7, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'identité visuelle et de la cohérence dans la communication d'une marque, qui sont des concepts clés abordés dans la référence. L'affirmation souligne que pour qu'une marque soit forte, elle doit véhiculer une image cohérente et authentique, ce qui est en ligne avec les éléments discutés dans la synthèse concernant l'identité visuelle et le branding. Cependant, l'exercice pourrait être amélioré en intégrant des aspects plus variés du design graphique ou en demandant à l'apprenant d'appliquer ces concepts à un exemple concret de support visuel."}, {"exercise": {"id": "673767c554b441ffbf385b15cdd93e5d", "statement": "L'identité de marque est identique à l'image de marque.", "veracity": false, "feedback": "L'identité de marque représente la manière dont une marque souhaite être perçue par les consommateurs, tandis que l'image de marque est la perception réelle qu'ont les consommateurs de cette marque. Ce sont deux concepts distincts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "102eb3bfe4f64b6abbf6b3dc49caf7fb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "L'identité de marque est la façon dont la marque souhaite être perçue des consommateurs. À ne pas confondre avec l'image, qui est la façon dont elle est perçue en réalité. Plus ces éléments sont puissants, cohérents et complémentaires entre eux, plus la marque est forte. Plus ils sont disparates ou mal ordonnés, sans but ni vision, moins la marque a de consistance et donc tout simplement d'existence. La marque est l'un des atouts les plus précieux d'une entreprise, par conséquent elle doit être soigneusement développée de façon à véhiculer une image fidèle et authentique.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "08c3f261177746b69c798e54c1627476", "next_id": "b8f73805d49e4ba68055fbd8846cc0dd", "prev_id": "2213d60e15f04ad7baec34dc5488be52", "associated_block_ids": [], "first_page": 7, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des concepts d'identité de marque et d'image de marque, qui sont des éléments clés dans la conception de supports de communication visuelle. Bien que l'exercice ne couvre pas directement tous les aspects du design graphique mentionnés dans la référence, il aborde un aspect fondamental de la communication visuelle : comment une marque se présente (identité) par rapport à ce que le public perçoit (image). Cela montre une bonne compréhension des principes de branding, ce qui est essentiel pour concevoir des supports efficaces. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à la mise en page ou à l'utilisation des couleurs dans le contexte du design graphique."}, {"exercise": {"id": "8217ad5333024525bdfdd890cf843cfb", "question": "Quel est un risque de ne pas adapter une campagne marketing aux mobiles ?", "answers": ["Offrir une expérience utilisateur médiocre"], "distractors": ["Manquer des opportunités d'email marketing", "Ignorer l'importance des visuels", "Perdre des prospects via les réseaux sociaux", "Créer des recommandations génériques", "Négliger la pertinence des mots-clés SEO", "Ne pas tenir compte des horaires de diffusion", "Maximiser l'efficacité des bannières publicitaires", "Former un lien émotionnel trop fort", "Concentrer trop d'efforts sur le budget publicitaire"], "feedback": "En ne s'adaptant pas aux mobiles, il est possible que le contenu et les offres ne soient pas correctement affichés, entraînant une expérience utilisateur médiocre. Cela peut décourager les utilisateurs et réduire leur engagement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance du responsive design dans la conception de supports de communication visuelle, ce qui est un aspect clé de la référence. La question cible directement les conséquences d'une mauvaise adaptation aux mobiles, ce qui est pertinent pour garantir une expérience utilisateur optimale. Cependant, bien que cela touche à un élément important, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur la cohérence visuelle ou l'identité de marque pour obtenir une note parfaite."}, {"exercise": {"id": "d4e9ab91b0d543e59d4284af6b4ebc5f", "question": "Pourquoi la taille de l'écran mobile peut poser problème lors de la conception ?", "answers": ["La taille restreinte complique la créativité et le webdesign"], "distractors": ["Les smartphones n'ont pas assez de performances pour un bon design.", "Les sites mobiles ne peuvent pas contenir de contenu multimédia.", "La navigation mobile impose toujours deux mains pour interagir.", "L'amélioration des visuels pour mobile est plus simple qu'avec un ordinateur.", "La taille d’écran mobile améliore toujours l'expérience utilisateur.", "Les écrans de téléphone n'affichent pas les images en haute qualité.", "Le responsive design supprime tout besoin de réflexion créative.", "Les couleurs doivent changer entre les versions mobile et desktop.", "Toutes les interfaces mobiles doivent être monochromes pour optimiser le design."], "feedback": "La taille de l'écran d'un terminal mobile peut poser problème pour les créateurs de sites web, car cela limite leur capacité à être créatif et à concevoir des designs complexes et esthétiques. La limitation de l'espace sur un petit écran peut également poser des problèmes pour l'optimisation de la navigation et de l'expérience utilisateur globale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des défis liés à la conception pour des écrans mobiles, ce qui est pertinent dans le contexte de la communication visuelle et du design graphique. La question aborde un aspect clé du responsive design, qui est essentiel pour garantir une expérience utilisateur optimale sur différents supports. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant davantage d'éléments sur la cohérence visuelle ou l'identité de marque, qui sont également des concepts importants mentionnés dans la synthèse."}, {"exercise": {"id": "b53e075a8c0d4892899e64c22caa14d1", "question": "Que signifie le fait que des pages soient 100% Responsive ?", "answers": ["Elles s'adaptent à la taille de la fenêtre du navigateur"], "distractors": ["Elles intègrent automatiquement des réseaux sociaux", "Elles augmentent la vitesse du site web", "Elles réduisent la consommation de bande passante", "Elles adaptent les langues automatiquement", "Elles corrigent les erreurs de serveur en temps réel", "Elles empêchent les pop-ups publicitaires", "Elles optimisent les vidéos haute définition", "Elles compressent toutes les images", "Elles améliorent le référencement en ligne"], "feedback": "La bonne réponse est que les pages s'adaptent à la taille de la fenêtre du navigateur, car cela signifie qu'elles sont conçues pour être consultées sur tous les types d'écrans, offrant ainsi une expérience utilisateur optimale et un meilleur référencement en ligne.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c8c9fd5c615d4aeb89687638c827428e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Amazon a commencé à vendre des livres en ligne. Se concentrer sur les livres à un prix bas en 1994 avec une conception Web simpliste a suffi à l'entreprise pour se développer et se diversifier. Les pages qui sont à 100% Responsive s'adaptent à la taille de la fenêtre de navigateur. Peu importe que la largeur soit de 400 pixels ou 4000pixels. Des contenus, comme par exemple des images ou des textes, s'intègrent simplement et de manière flexible selon la grandeur de l'écran respectif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "b7e9e4bbcc3540a78cb7b632d44e7ab9", "next_id": "47662b070fa14ac3b3344aab7550d2e6", "prev_id": "b84de263ccd2406f97694b0dd7e6441c", "associated_block_ids": [], "first_page": 189, "last_page": 194, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un élément clé dans la conception de supports de communication visuelle, comme mentionné dans la référence. La question cible directement l'importance d'adapter les contenus à différentes tailles d'écran, ce qui est essentiel pour garantir une expérience utilisateur optimale. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en incluant des questions supplémentaires sur d'autres aspects du design graphique ou de l'identité visuelle pour couvrir plus largement le sujet abordé dans la synthèse."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue spécifiquement la compréhension de l'importance du responsive design, qui est un aspect clé de la référence sur la conception de supports de communication visuelle. En demandant aux apprenants d'identifier les conséquences d'une mauvaise adaptation du contenu pour les appareils mobiles, il teste leur capacité à relier le concept de design inclusif et accessible à l'expérience utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects mentionnés dans la synthèse, comme la hiérarchie visuelle ou l'identité visuelle."}, {"exercise": {"id": "053de79d8f01448d8c9ae2f115f8abaf", "statement": "Les pages Responsive ne fonctionnent correctement que lorsque leur largeur est entre 400 et 4000 pixels.", "veracity": false, "feedback": "Le concept de 'Responsive' signifie que les pages Web s'adaptent automatiquement à la taille de la fenêtre du navigateur, quelle que soit la largeur (que ce soit moins de 400 pixels ou plus de 4000 pixels). Cela permet au contenu de rester flexible et lisible peu importe la dimension de l'écran.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c8c9fd5c615d4aeb89687638c827428e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Amazon a commencé à vendre des livres en ligne. Se concentrer sur les livres à un prix bas en 1994 avec une conception Web simpliste a suffi à l'entreprise pour se développer et se diversifier. Les pages qui sont à 100% Responsive s'adaptent à la taille de la fenêtre de navigateur. Peu importe que la largeur soit de 400 pixels ou 4000pixels. Des contenus, comme par exemple des images ou des textes, s'intègrent simplement et de manière flexible selon la grandeur de l'écran respectif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "b7e9e4bbcc3540a78cb7b632d44e7ab9", "next_id": "47662b070fa14ac3b3344aab7550d2e6", "prev_id": "b84de263ccd2406f97694b0dd7e6441c", "associated_block_ids": [], "first_page": 189, "last_page": 194, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de 'responsive design', qui est un élément clé dans la conception de supports de communication visuelle. La question teste la capacité de l'apprenant à reconnaître que le responsive design ne se limite pas à une plage spécifique de largeurs, mais qu'il s'agit d'une approche flexible pour s'adapter à toutes les tailles d'écran. Cela reflète bien les objectifs d'apprentissage liés à l'accessibilité et à l'expérience utilisateur mentionnés dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres aspects du design graphique ou de la cohérence visuelle pour obtenir une note parfaite."}, {"exercise": {"id": "a7a4e17d20c843f0bc5686d8e5efabf2", "statement": "La taille réduite de l'écran sur un terminal mobile peut poser des défis en termes de créativité et de conception web.", "veracity": true, "feedback": "Effectivement, la taille réduite de l'écran sur un appareil mobile rend la conception plus difficile en raison de contraintes créatives et en termes de webdesign, comparativement à des écrans plus grands.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c95feb47797849a18639f79a8727b471", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "Construire un site web autour de sa version mobile est avantageux en terme d'ergonomie car il sera plus facile de rajouter des éléments et des fonctionnalités en l'adaptant sur de plus grands écrans plutôt que de devoir en enlever en adaptant sur smartphone. Croire qu'un site sera bien référencé sans rédiger du contenu de qualité et optimisé SEO, c'est bien un rêve, tout comme le mobile first n'est pas exempt de défauts. La taille de l'écran d'un terminal mobile peut poser problème car cela ne facilite pas la conception d'un point de vu créatif et webdesign. Les raisons étant : · En terme de visuels, réduire la taille n'affecte pas la qualité de l'image contrairement à son agrandissement lors de son passage sur une version desktop De plus chacun à sa manière de manipuler un smartphone, certains ont une prise à deux mains, certains utilisent juste deux doigts, ceci impliquant de penser aux différents types de manipulations pour les mobinautes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6d817a633b1d47d5b33b3dca89230fbb", "next_id": "fb80da339b1640c889bae03b9b0b693d", "prev_id": "7140d33a698043caa547688613f023cf", "associated_block_ids": [], "first_page": 197, "last_page": 198, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice aborde un aspect important de la conception des supports de communication visuelle, à savoir le responsive design et les défis associés à la taille réduite des écrans. Cela est en adéquation avec la référence qui souligne l'importance d'adapter les contenus pour garantir une expérience utilisateur optimale sur différents appareils. Cependant, bien que pertinent, l'exercice ne couvre pas d'autres éléments clés tels que la cohérence visuelle ou l'identité de marque, ce qui empêche d'atteindre une note maximale."}, {"exercise": {"id": "5dfa078c93a7429e8dc56bddb5e73e9f", "statement": "Le mobile représente plus de 52% du trafic en ligne, ce qui rend le responsive design essentiel.", "veracity": true, "feedback": "Il est correct que le mobile représente plus de la moitié du trafic en ligne. Dans ce contexte, il est crucial de concevoir des sites ou applications compatibles avec divers appareils, notamment mobiles, d'où l'importance du responsive design pour offrir une bonne expérience utilisateur sur tous types de supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f80e75c4a9c4e8281589c55b4d0f87e", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Alors qu' aujourd'hui le mobile compte pour plus de 52% du trafic en ligne, il est inimaginable de négliger le responsive design. Bien trop souvent encore, les concepteurs ont la mauvaise manie d'introduire des fonctionnalités qui compliquent le processus de développement, sans pour autant apporter de valeur ajoutée à l'application.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f1dea63fa6034caa8e144b8277e71f2f", "next_id": "22b3a320dc3e41d09d9d9adf2399f8f7", "prev_id": "f1dea63fa6034caa8e144b8277e71f2f", "associated_block_ids": [], "first_page": 386, "last_page": 389, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance du responsive design, qui est un aspect clé de la conception des supports de communication visuelle. La référence souligne que le responsive design est nécessaire pour garantir une expérience utilisateur optimale sur différents appareils, ce qui est en accord avec l'affirmation et l'explication fournies dans l'exercice. Cependant, bien que pertinent, cet exercice ne couvre pas d'autres éléments cruciaux mentionnés dans la synthèse, tels que la cohérence visuelle ou l'identité de marque. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "cc8ce2b19f52403790617b85986c9f73", "statement": "Un site responsive design s'adapte à la taille de la fenêtre du navigateur pour offrir une meilleure expérience utilisateur sur mobile.", "veracity": true, "feedback": "Un site responsive design ajuste automatiquement son affichage en fonction de la taille de la fenêtre du navigateur, ce qui garantit une expérience optimisée quel que soit l'appareil utilisé, que ce soit un smartphone ou tout autre appareil.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "634d9041079d415a92e62ad20b752912", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Le mobile marketing permet aux entreprises de se rapprocher du consommateur, où qu'il soit, pour générer de l'interactivité et stimuler l'acte d'achat, de conquête et de fidélisation du client. L'utilisation du marketing mobile suggère que le site de votre entreprise ou votre application doit être optimisé pour l'utilisation mobile. Il faut proposer aux utilisateurs de smartphone une expérience adaptée : un affichage qui s'adapte à la taille de l'écran, une ergonomie permettant de cliquer sur un bouton ou un lien sans risque de confusion avec son doigt. De plus, un utilisateur mobile ne recherchera pas forcément les mêmes mêmes informations qu'un utilisateur d'ordinateur classique, il faut donc également adapter le contenu. Pour cela il y a deux options : soit recourir à un site responsive design (qui s'adapte à la taille de la fenêtre du navigateur), soit à un site mobile (un site totalement indépendant, créé spécialement pour mobile).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f6a006defe884a3c93948e82fdc61d17", "next_id": "81d72022d6f54f00a8263b0f852e0430", "prev_id": "adf1cb6feac9424a8d650767fb3510eb", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de supports de communication visuelle, en particulier le responsive design. La question teste la connaissance de l'apprenant sur l'importance d'adapter les contenus aux différentes tailles d'écran, ce qui est essentiel pour garantir une expérience utilisateur optimale. Cependant, bien que pertinent, l'exercice se concentre uniquement sur un aspect spécifique du design et ne couvre pas d'autres éléments importants mentionnés dans la synthèse, tels que la cohérence visuelle ou l'identité de marque. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du wireframe, qui est un outil essentiel dans le processus de conception des supports de communication visuelle. Il teste la capacité de l'apprenant à distinguer entre l'organisation des éléments et leur aspect visuel, ce qui est en ligne avec les concepts de mise en page et de hiérarchie visuelle abordés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments relatifs à l'identité visuelle ou au branding pour atteindre une note parfaite."}, {"exercise": {"id": "fcf86d429da24f679769741afa7e8165", "question": "À quoi sert principalement le zoning dans le processus de création d'une page web ?", "answers": ["À schématiser la disposition du contenu et des fonctionnalités"], "distractors": ["À détailler le design final de la page", "À définir la palette de couleurs utilisée", "À créer une carte des utilisateurs", "À programmer les différentes fonctionnalités", "À choisir les outils graphiques à utiliser", "À écrire le contenu de la page", "À optimiser le SEO de la page web", "À définir les standards de performance", "À tester la compatibilité sur différents navigateurs"], "feedback": "Le zoning sert principalement à schématiser la disposition du contenu et des fonctionnalités sur une page web, en utilisant des blocs pour représenter les différents éléments. Il intervient généralement après la création de l'arborescence, qui définit l'organisation globale du site, et permet ainsi de valider ou ajuster les grandes lignes avant de passer aux étapes suivantes de conception.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du zoning, qui est un aspect important dans la conception de supports de communication visuelle, notamment pour les interfaces web. La question cible directement la disposition des éléments sur une page, ce qui est en lien avec les concepts de mise en page et d'organisation visuelle abordés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments relatifs à l'identité visuelle ou à la cohérence graphique, qui sont également cruciaux dans le contexte global de la communication visuelle."}, {"exercise": {"id": "cfb5a24978ac4fb2bf3fa2db59ed0ebe", "question": "Quelle est l'utilité des wireframes dans le processus de création web?", "answers": ["Ils servent de base à la conception des maquettes web"], "distractors": ["Ils déterminent exclusivement les couleurs du site.", "Ils fournissent uniquement le texte du contenu.", "Ils remplacent les graphiques finaux sur le site.", "Ils sont créés en dernier après la conception graphique.", "Ils indiquent exactement où placer les images.", "Ils proposent les logos nécessaires pour le site web.", "Ils permettent d'ajuster uniquement la navigation visuelle.", "Ils représentent essentiellement l'esthétique finale du site.", "Ils s'occupent de la gestion du back-end du projet."], "feedback": "Les wireframes servent de base pour la conception des maquettes web en organisant les éléments et la navigation du site. Ils ne déterminent pas exclusivement l'esthétique finale du site, mais sont plutôt un guide pour respecter les fonctionnalités souhaitées par le client et le budget alloué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des wireframes, qui sont un élément essentiel dans le processus de conception de supports de communication visuelle, notamment pour le design web. La question cible directement l'utilité des wireframes, ce qui est pertinent par rapport à la référence sur la conception de supports graphiques et d'interfaces utilisateur. Cependant, bien que cela touche à des concepts clés comme la mise en page et l'organisation des éléments, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la cohérence visuelle ou à l'identité visuelle mentionnés dans la synthèse. Néanmoins, il reste très pertinent pour tester une compétence fondamentale dans le domaine."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception visuelle en demandant quel aspect devrait être évité pour ne pas perdre l'utilisateur. Cela fait directement référence à l'importance de la cohérence visuelle et du respect des normes de design, qui sont des éléments clés mentionnés dans la synthèse. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en incluant des questions plus variées sur d'autres aspects comme l'identité visuelle ou le responsive design, ce qui lui aurait permis d'obtenir une note maximale."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes de clarté et de cohérence dans la conception d'interfaces, qui sont des éléments clés mentionnés dans la référence. En effet, la synthèse souligne l'importance de la mise en page et de la hiérarchie visuelle pour garantir une expérience utilisateur fluide. Cependant, l'exercice pourrait être amélioré en incluant des questions supplémentaires sur d'autres aspects du design graphique ou sur l'identité visuelle pour couvrir plus largement les concepts abordés dans la référence."}, {"exercise": {"id": "5c99b0872ad447488fc21208ec035890", "statement": "La constance dans l'utilisation d'icônes universelles permet d'améliorer l'intuitivité d'une interface.", "veracity": true, "feedback": "L'emploi d'icônes avec une signification établie, connue des utilisateurs, permet de maintenir une interface intuitive. Cela évite de réinventer sans raison des éléments qui ont déjà fait leurs preuves dans la compréhension utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la cohérence visuelle et de l'utilisation d'éléments graphiques dans la conception des supports de communication visuelle. L'affirmation sur les icônes universelles est pertinente car elle touche à la notion d'intuitivité et d'accessibilité, qui sont des aspects clés du design graphique mentionnés dans la synthèse. Cependant, bien que cela soit un bon exemple, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à l'identité visuelle ou à la hiérarchie visuelle pour couvrir plus largement les concepts abordés dans la référence."}, {"exercise": {"id": "63fc6d6be00f486fbc566c553cd77f02", "statement": "Les sites Web minimalistes font souvent usage de typographies complexes et d'une large variété de styles de caractères.", "veracity": false, "feedback": "Les sites Web minimalistes utilisent généralement une typographie simple et une gamme limitée de styles de caractères pour offrir une expérience épurée. L’objectif est de favoriser la lisibilité et éliminer les distractions inutiles, en cohérence avec le principe de réduction des détails.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de design graphique, en particulier en ce qui concerne l'utilisation de la typographie dans les sites Web minimalistes. Cela est pertinent pour le sujet de la communication visuelle, car une typographie simple et cohérente contribue à l'identité visuelle et à la lisibilité, deux éléments clés mentionnés dans la synthèse. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant d'autres aspects du design graphique ou en demandant aux apprenants d'appliquer ces concepts à un cas pratique spécifique."}, {"exercise": {"id": "b4b97df8dd6a40058683994ee7a8cbb9", "statement": "Les couleurs, telles que le rouge et l'orange, influencent l'appétit des consommateurs dans le secteur de la restauration.", "veracity": true, "feedback": "Le rouge et l'orange ont effectivement tendance à stimuler l'appétit, c'est pour cela qu'elles sont souvent employées dans les restaurants et la communication des produits alimentaires.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "466a8b2c4fef4682ae6e7d0b7ab0c38a", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "La psychologie des couleurs est l'étude des couleurs comme éléments déterminants du comportement humain. En d'autres termes, il s'agit d'étudier la manière dont les couleurs influencent les gens et leurs comportements. Les restaurateurs utilisent fréquemment l'orange qui, comme le rouge, a tendance à augmenter l'appétit. Cette couleur fait naturellement référence à de nombreux produits comestibles (carotte, abricot, pêche, courge, etc.) Il n'est donc pas étonnant de la retrouver dans la communication des produits alimentaires, comme ici avec Fanta, qui utilise de surcroît l'orange et ses vitamines dans ses produits. Elle est donc parfois utilisée dans l'industrie automobile, mais aussi et surtout dans le secteur de la livraison. Exemple célèbre en France, La Poste en a d'ailleurs fait la couleur principale de son identité visuelle.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdf90a19dc084313bca7456d521abaf8", "next_id": "476054b9f65b4be18f978a5f1fe83cf6", "prev_id": "df4dd62aeb764488be328695aea86325", "associated_block_ids": [], "first_page": 333, "last_page": 339, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'impact des couleurs sur les émotions et perceptions des consommateurs, ce qui est un aspect clé de la communication visuelle et du design graphique. Cependant, il se concentre spécifiquement sur une application limitée (l'influence des couleurs sur l'appétit dans le secteur de la restauration) plutôt que d'aborder plus largement les principes de conception visuelle ou l'identité de marque. Bien qu'il soit pertinent, il ne couvre pas entièrement tous les éléments essentiels mentionnés dans la référence."}, {"exercise": {"id": "f4b28520ee1f4e42b907e9f23a587b75", "query": "Les espaces blancs passifs sont des lacunes qui apparaissent naturellement dans la conception ou la typographie, tandis que les espaces blancs actifs sont ajoutés intentionnellement pour <blank>.", "answers": ["faciliter la lecture"], "distractors": [["améliorer le contraste", "réduire la fatigue oculaire", "remplir les zones vides", "augmenter l'espace visuel", "contrôler l'esthétique", "optimiser la typographie"]], "feedback": "La bonne réponse est 'faciliter la lecture' car les espaces blancs actifs ont pour but explicite de diriger l'attention d'un utilisateur en rendant la page plus facile à parcourir. Ils ne sont pas accidentels mais créés pour améliorer la lisibilité et le flux visuel.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice sur les espaces blancs actifs et passifs évalue la compréhension d'un aspect important du design graphique, qui est la mise en page et l'impact visuel. Bien que cela soit pertinent pour le sujet de la communication visuelle, l'exercice se concentre spécifiquement sur un détail technique plutôt que sur des concepts plus larges tels que l'identité visuelle, la cohérence graphique ou le branding. Il teste une compétence clé dans le domaine du design, mais il ne couvre pas entièrement les objectifs d'apprentissage liés à la conception de supports de communication visuelle dans leur ensemble. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "427ec276b83c4e7eaa41ca28575ba6ee", "statement": "Les images aident la marque à instaurer un lien de confiance et à se montrer de manière transparente.", "veracity": true, "feedback": "L'usage des images permet effectivement à la marque de construire un lien de confiance avec son audience tout en favorisant la transparence. Cela passe par la mise en avant de ses valeurs et de son histoire visuelle, ce qui contribue à la renforcer aux yeux du public.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4454bf17c36b4b499a8513bff7825af6", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le potentiel narratif des images est puissant, il permet à la marque d'instaurer un lien de confiance, de jouer la transparence, de se raconter, et de se montrer. Il faut donc, en amont, s'approprier les valeurs propres à chaque marque afin de les retransmettre et de les personnifier au travers de choix iconographiques fidèles et pertinents.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "27266f7e7f2b4867bc38a6608f4c2ae0", "next_id": "9a7b46fdedf44331ab9b51b4c73b1310", "prev_id": "27266f7e7f2b4867bc38a6608f4c2ae0", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13673, "doc_label": "Connect jour 3", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance des images dans la communication visuelle et leur rôle dans l'établissement d'un lien de confiance entre une marque et son public. Cela est en ligne avec les concepts clés abordés dans la référence, notamment l'utilisation harmonieuse des supports graphiques pour transmettre des messages clairs et engageants. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects essentiels mentionnés dans la synthèse, tels que la cohérence visuelle ou la hiérarchie visuelle. Il aurait pu être amélioré en intégrant des éléments supplémentaires sur ces sujets."}, {"exercise": {"id": "7d7015341c634c6eaa4de6df8fa72e34", "question": "Quel est le rôle principal d'un Stylescape dans un projet de design ?", "answers": ["Communiquer l'émotion et l'ambiance souhaitées"], "distractors": ["Définir la palette de couleurs finale.", "Décrire les aspects techniques du projet.", "Contrôler la progression du planning.", "Valider les choix esthétiques avec l'équipe interne.", "Analyser les performances du produit fini.", "Estimer les coûts de production.", "Gérer la relation entre les parties prenantes.", "Superviser les processus créatifs en cours.", "Prévoir les ajustements graphiques post-lancement."], "feedback": "Le rôle principal d'un Stylescape est de communiquer l'émotion et l'ambiance souhaitées pour un projet de design, en donnant une vision claire à toutes les parties prenantes. Les autres propositions ne sont pas pertinentes car elles ne reflètent pas le but premier d'un Stylescape.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bdab12e6e10b43d7af3a924a2e08b705", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "L'objectif principal d'un Stylescape est de taptosphère, l'émotion et l'ambiance souhaitées pour un projet de design. Il permet de communiquer efficacement avec les clients ou les parties prenantes, en leur donnant une idée claire de l'apparence et de la sensation du projet final.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": null, "next_id": null, "prev_id": "79a7ea7ded9d4986a33e1204a1cb091b", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13691, "doc_label": "Sequence 4_choix entre stylescape ou moodboard", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un concept spécifique lié à la communication visuelle, en l'occurrence le rôle d'un Stylescape dans un projet de design. Bien que ce concept soit pertinent pour la conception de supports de communication visuelle, il ne couvre pas tous les aspects clés mentionnés dans la référence, tels que la cohérence visuelle, l'identité de marque ou le responsive design. Cependant, il permet d'apprécier une partie importante du processus créatif et de l'interaction entre les éléments graphiques et les émotions véhiculées par un projet. C'est pourquoi il obtient une note relativement élevée mais pas maximale."}, {"exercise": {"id": "f3dc4db503a64d7696628bc1bc7eeb26", "question": "Quels éléments sont inclus dans un design system ?", "answers": ["Les règles visuelles, graphiques, de branding et de ton"], "distractors": ["Uniquement des animations interactives de prototype", "Exclusivement des directives de sécurité informatique", "Des instructions relatives à l'expérience utilisateur", "Le suivi des communications internes à l'entreprise", "La gestion des équipes et des plannings", "Plans détaillés pour la stratégie publicitaire", "Une charte définissant les différents KPI", "Le modèle économique de l'entreprise", "La liste des formats de fichier utilisés"], "feedback": "Un design system regroupe tous les éléments nécessaires pour guider la création des produits et services d'une entreprise, tels que les règles visuelles, graphiques, de branding et de ton. Cela permet de maintenir une cohésion et une identité forte pour la marque.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des éléments d'un design system, qui est pertinent pour la conception de supports de communication visuelle. Bien que cela ne couvre pas tous les aspects mentionnés dans la référence, comme l'importance de la mise en page ou de l'identité visuelle, il aborde des concepts clés tels que les règles graphiques et de branding. Cependant, il pourrait être amélioré en intégrant des questions plus directement liées à la création et à l'application pratique des supports visuels eux-mêmes."}, {"exercise": {"id": "388525c44d4749319aec5fc378adefa3", "statement": "Un design system se limite uniquement aux éléments graphiques et visuels d'un produit.", "veracity": false, "feedback": "Un design system ne se limite pas uniquement aux éléments graphiques et visuels. Il inclut également des règles, des éléments de branding, le ton, et d'autres points de contact relatifs au produit, afin de créer un système cohérent et standardisé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la conception de supports de communication visuelle, en particulier l'idée que le design system va au-delà des simples éléments graphiques. Cela fait écho à la notion d'identité visuelle et de branding mentionnée dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des questions plus directement liées aux aspects pratiques de la conception graphique ou à l'application des principes discutés dans la synthèse, comme la mise en page ou la hiérarchie visuelle."}, {"exercise": {"id": "6620cbe296234756b29fd2315f6194e7", "query": "Certaines polices sont plus adaptées à de longs blocs de texte, tandis que d'autres seront plus utiles pour créer <blank>.", "answers": ["des titres accrocheurs"], "distractors": [["des sous-titres discrets", "des icônes colorées", "des paragraphes courts", "des mises en page originales", "des légendes subtiles", "des illustrations captivantes"]], "feedback": "Les polices peuvent être choisies pour différentes utilisations. Certaines sont conçues pour être lisibles dans les longs blocs de texte, alors que d'autres sont plus efficaces pour attirer l'attention et créer des titres accrocheurs, qui captivent immédiatement le lecteur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c809e8459a1245b2bb2030116436e04c", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Mais choisir entre les meilleures polices de caractères web et les meilleures polices de caractères web-safe n'est pas la seule décision que vous devrez prendre. Vous devez également déterminer quel style de typographie convient le mieux à l'image de votre marque ainsi qu'à votre site web. Certaines polices sont plus adaptées à de longs blocs de texte, tandis que d'autres seront plus utiles pour créer des titres accrocheurs, etc. Et bien sûr, les polices de caractères auront une influence différente sur la manière dont votre marque sera perçue par le public.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "dbb59e71462a4981aec690f602f9d01d", "next_id": "ebb291163e95475d9d46c4b2e2a26406", "prev_id": "dbb59e71462a4981aec690f602f9d01d", "associated_block_ids": [], "first_page": 286, "last_page": 286, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice proposé évalue la compréhension des différentes utilisations des polices dans le design graphique, ce qui est pertinent pour le sujet de la conception de supports de communication visuelle. Il aborde l'idée que certaines polices sont plus adaptées à des titres accrocheurs, ce qui fait partie intégrante de la création d'une communication visuelle efficace. Cependant, bien que cela touche un aspect clé du design graphique, l'exercice pourrait être amélioré en incluant davantage d'éléments liés à la cohérence visuelle ou à l'identité de marque, qui sont également essentiels dans le contexte global de la référence. Cela limite légèrement sa portée par rapport aux concepts plus larges abordés dans la synthèse."}, {"exercise": {"id": "4570d883513647c595941a5d33546fc8", "question": "Pourquoi est-il risqué de réinventer une icône connue par les utilisateurs ?", "answers": ["Cela peut désorienter l'utilisateur et nuire à son expérience"], "distractors": ["Cela permet d'améliorer l'expérience utilisateur immédiatement.", "Cela rend l'interface plus créative et intuitive.", "Cela aide l'utilisateur à mieux comprendre les nouvelles fonctionnalités.", "Cela garantit une meilleure interaction avec la technologie.", "Cela simplifie l'utilisation des options avancées pour les experts.", "Cela permet de se différencier de la concurrence.", "Cela assure une compatibilité optimale avec toutes les interfaces existantes.", "Cela accroît la flexibilité de conception dans les interfaces complexes.", "Cela améliore la lisibilité générale des informations présentées à l'écran."], "feedback": "Les icônes familières sont facilement reconnaissables par les utilisateurs et leur permettent de comprendre rapidement comment utiliser une fonctionnalité sans avoir à apprendre de nouvelles représentations visuelles. Modifier une icône peut donc désorienter l'utilisateur et nuire à son expérience.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance des icônes familières dans la communication visuelle et leur impact sur l'expérience utilisateur, ce qui est pertinent pour le sujet de la conception de supports de communication visuelle. Cependant, il se concentre principalement sur un aspect spécifique (les icônes) sans aborder d'autres éléments clés comme la cohérence visuelle ou l'identité graphique. Bien qu'il soit pertinent, il pourrait être amélioré en intégrant des questions sur d'autres concepts essentiels du design graphique mentionnés dans la synthèse."}, {"exercise": {"id": "f7db6816b25d40e7b88284be2d31d0ac", "statement": "Les utilisateurs préfèrent des icônes nouvelles et originales plutôt que celles établies pour mieux comprendre leur fonction.", "veracity": false, "feedback": "Au contraire, il est mentionné que les icônes ayant une signification établie sont déjà connues des utilisateurs et qu'il est risqué d'en créer de nouvelles. Le changement pourrait rendre l'interface moins intuitive et désorienter les utilisateurs, ce qui est à éviter pour ne pas les faire fuir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension des principes de conception graphique, en particulier l'importance de la cohérence visuelle et de l'utilisation d'éléments graphiques établis pour assurer une expérience utilisateur intuitive. L'affirmation aborde un aspect clé du design, à savoir que les utilisateurs bénéficient d'icônes familières qui facilitent leur navigation. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur la hiérarchie visuelle ou l'identité visuelle pour couvrir plus largement le sujet de la communication visuelle."}, {"exercise": {"id": "aea046efc029487c8ff2e9096578897c", "statement": "La police Garamond est particulièrement adaptée pour des designs avec beaucoup de texte.", "veracity": true, "feedback": "Garamond est en effet bien adaptée pour des conceptions à forte densité de texte, car ses proportions agréables facilitent la lecture et l'esthétique visuelle, surtout en impression.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c4d69bc67c8940ab8f1e565c08039a1a", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Peut-être la plus inhabituelle de ce groupe de polices à empattements web-safe, la police Garamond est pourtant une des préférées des designers. Sachez que cette police fonctionne mieux en impression - elle est idéale pour les designs à forte densité de texte, car ses proportions sont très agréables à l'œil. Toujours sérieuse, toujours directe, la police Times New Roman convient parfaitement aux contenus factuels et formels, tels que les textes universitaires. Elle serait également une police de choix pour un cabinet d'avocats par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf0bfc2e1b634787b12621bca1a74791", "next_id": null, "prev_id": "d434617381af4bf0884a56a616d7a0b8", "associated_block_ids": [], "first_page": 292, "last_page": 293, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un aspect spécifique du design graphique, à savoir le choix de la police et son impact sur la lisibilité et l'esthétique visuelle. Cela est pertinent par rapport à la référence qui traite de la conception de supports de communication visuelle, où la mise en page et les éléments graphiques sont cruciaux. Cependant, l'exercice se concentre uniquement sur un élément (la police) sans aborder d'autres concepts clés tels que la cohérence visuelle, l'identité visuelle ou le responsive design. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement l'ensemble des objectifs d'apprentissage mentionnés dans la référence."}, {"exercise": {"id": "8f28a9f88d34427b97ac8306108b18b3", "statement": "Le but principal d'un design system est de standardiser les éléments liés au développement d'un produit pour garantir la cohérence.", "veracity": true, "feedback": "Le but d'un design system est effectivement de regrouper graphiques, règles, branding, ton, etc. en un seul système, assurant ainsi une cohérence dans le contact avec les différents acteurs participant au développement d'un produit.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de cohérence visuelle, qui est un aspect clé de la conception des supports de communication visuelle. Il mentionne également l'importance d'un design system pour standardiser les éléments graphiques et assurer une expérience utilisateur fluide, ce qui est pertinent par rapport à la référence. Cependant, l'exercice se concentre principalement sur le design system et ne couvre pas d'autres aspects importants tels que l'identité visuelle, la hiérarchie visuelle ou l'accessibilité. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement tous les concepts clés de la référence."}, {"exercise": {"id": "6c595b329a424d42b827c9b056302f09", "statement": "Un slogan permet d'assurer une identité visuelle homogène uniquement pour les collaborateurs de l'entreprise.", "veracity": false, "feedback": "Le slogan (ou baseline) est destiné à garantir une identité visuelle homogène non seulement pour les collaborateurs de l'entreprise, mais aussi pour les clients et toutes les autres parties prenantes, comme les fournisseurs et partenaires, entre autres. Il n'est donc pas limité aux seuls collaborateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a14a2eeb39634a12bf5d599f9a24c789", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Afin d'asseoir son positionnement et de renforcer son nom de marque, il peut être complété par une baseline, aussi appelé slogan ou punchline. Sa mise en place garantie une identité visuelle homogène que pourront s'approprier les collaborateurs, les clients et toutes les parties prenantes (fournisseurs, partenaires, ... ).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "0202c10711334a238a7d1c828b2522cc", "next_id": "669f1e772dbe48bebb0245be17e5450f", "prev_id": "40a5031d6bf14574bb98fdc0bf308e61", "associated_block_ids": [], "first_page": 12, "last_page": 18, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'identité visuelle, un concept clé dans la référence. Cependant, il se concentre spécifiquement sur le slogan et son rôle, ce qui est un aspect plus limité de la communication visuelle globale. Bien qu'il soit pertinent, l'exercice ne couvre pas d'autres éléments essentiels tels que la cohérence visuelle ou les supports graphiques variés mentionnés dans la synthèse. Une évaluation plus large des différents aspects de la communication visuelle aurait été préférable pour obtenir une note plus élevée."}, {"exercise": {"id": "b17e37191d8e4ee096cbcba422cbd719", "question": "Quelle est la méthode qui découpe le design d'une interface en composants ?", "answers": ["L'atomic design"], "distractors": ["Le responsive design", "Le flat design", "Le skeuomorphisme", "Le material design", "Le wireframing", "Le design génératif", "Le minimalisme", "La méthode OOCSS", "Le visual design"], "feedback": "L'atomic design est une méthode de découpe du design d'une interface en plusieurs composants, permettant ainsi une meilleure organisation et une plus grande flexibilité dans la création de l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une méthode spécifique de design d'interface, l'atomic design, qui est pertinente dans le contexte de la conception de supports de communication visuelle. Cependant, bien que cela touche à des concepts clés du design graphique et à l'organisation des éléments visuels, il ne couvre pas directement les aspects plus larges tels que la cohérence visuelle, l'identité de marque ou l'accessibilité mentionnés dans la synthèse. L'exercice pourrait être amélioré en intégrant des questions qui évaluent également ces autres dimensions essentielles du sujet."}, {"exercise": {"id": "327e8c0d2b52403a8f4a5e937000ace4", "query": "Il n'existe pas de palette de couleurs magique qui garantit une augmentation spectaculaire des ventes, mais 59% des entreprises marchandes en France utilisent <blank> dans leur logo et leur branding.", "answers": ["du rouge"], "distractors": [["du bleu", "du vert", "du jaune", "du violet", "du noir", "du blanc"]], "feedback": "La bonne réponse est 'du rouge' car il est indiqué que 59% des entreprises marchandes en France intègrent cette couleur dans leur logo et branding. Le rouge peut susciter l'excitation et inciter les clients à acheter, ce qui explique son choix par de nombreuses marques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9eca0f5c0e1a4df1af54860d0362fcd9", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Il n'y a pas de palette de couleurs magique, qui garantira à toutes les entreprises d'augmenter leur taux de manière spectaculaire (si seulement !). Elle suscite l'excitation et donne envie à vos clients d'acheter vos produits. Si vous ne me croyez pas, croyez-en les chiffres : 59% des entreprises marchandes (en France) utilisent du rouge dans leur logo et leur branding.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "96e09cc557744373a4bae49ba4fabd3f", "next_id": "50b0c36bfa8140f1a6bf04b540e6a9ab", "prev_id": "6342a00f7600424d956b139c2890738d", "associated_block_ids": [], "first_page": 355, "last_page": 357, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une couleur spécifique utilisée dans le branding, ce qui est pertinent pour le concept d'identité visuelle mentionné dans la référence. Cependant, il ne couvre pas de manière exhaustive les autres éléments clés tels que la mise en page, la hiérarchie visuelle ou l'importance de la cohérence graphique. Bien qu'il aborde un aspect important du design graphique, il manque de profondeur et ne permet pas d'évaluer pleinement la compréhension des principes globaux de conception des supports de communication visuelle."}, {"exercise": {"id": "87ab5535739448f5bfce3e4fe5f0b309", "statement": "Il existe une palette de couleurs universelle qui garantit une augmentation des ventes pour toutes les entreprises.", "veracity": false, "feedback": "Il n'existe pas de palette de couleurs universelle capable de garantir une augmentation des ventes pour toutes les entreprises. Les couleurs peuvent influencer les clients, mais leur effet dépend de nombreux autres facteurs contextuels et spécifiques à chaque marché ou entreprise.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9eca0f5c0e1a4df1af54860d0362fcd9", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Il n'y a pas de palette de couleurs magique, qui garantira à toutes les entreprises d'augmenter leur taux de manière spectaculaire (si seulement !). Elle suscite l'excitation et donne envie à vos clients d'acheter vos produits. Si vous ne me croyez pas, croyez-en les chiffres : 59% des entreprises marchandes (en France) utilisent du rouge dans leur logo et leur branding.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "96e09cc557744373a4bae49ba4fabd3f", "next_id": "50b0c36bfa8140f1a6bf04b540e6a9ab", "prev_id": "6342a00f7600424d956b139c2890738d", "associated_block_ids": [], "first_page": 355, "last_page": 357, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de l'importance des couleurs dans la communication visuelle, ce qui est pertinent par rapport à la référence sur la conception de supports de communication visuelle. Cependant, il se concentre uniquement sur une affirmation spécifique concernant une palette de couleurs universelle, sans explorer d'autres aspects clés tels que la cohérence visuelle, l'identité de marque ou les principes du design graphique. Bien qu'il teste la compréhension d'un élément important (l'influence des couleurs), il ne couvre pas suffisamment les autres concepts essentiels mentionnés dans la synthèse."}, {"exercise": {"id": "082b8365ea88473292ba9fe11ce1df27", "statement": "L'utilisation de mises en page typographiques uniques est souvent observée sur des supports physiques comme les étiquettes, les affiches de festivals et la signalisation.", "veracity": true, "feedback": "Les mises en page typographiques uniques ont une longue tradition d'utilisation sur des supports physiques avec des contraintes d'espace, tels que les étiquettes, affiches ou signalisation, où le besoin d'une conception efficace est important.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "36419a223a8848fbada03516567b953f", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Contrairement à l'esthétique du design épuré, nous voyons de plus en plus de sites Web qui repoussent littéralement les limites avec des mises en page typographiques uniques. Cette tendance est assez surprenante étant donné que cette pratique de conception est courante sur des supports qui manquent d'espace, comme les emballages arrière, les affiches de festivals de musique, les étiquettes et la signalisation, etc. Peut- être que cette tendance a à voir avec notre désir de conceptions qui utilisent de vrais matériaux, qui nous avons abandonné au profit de l'écran et de l'expérience interactive.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fe7b510e72ac42a193563eedcc9ae1ae", "next_id": "9bce713d0a3a4e44ae54b342759f3113", "prev_id": "3e0d1a933e6b4c73b3a2cf9e3a388b8b", "associated_block_ids": [], "first_page": 379, "last_page": 379, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent de la conception des supports de communication visuelle, en se concentrant sur l'utilisation de mises en page typographiques uniques. Cela fait écho à la nécessité d'une mise en page efficace pour transmettre des messages clairs et engageants, comme mentionné dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à la cohérence visuelle, à l'identité de marque ou aux principes du design graphique qui sont également cruciaux dans le contexte donné. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement les concepts clés évoqués dans la référence."}, {"exercise": {"id": "c003bbe140cc4e269452e6980b5b6d1e", "question": "Quelle est la différence clé entre l'Adaptive et le responsive design ?", "answers": ["L'Adaptive casse tout et recrée une maquette différente pour chaque support"], "distractors": ["Le responsive design nécessite toujours plus de ressources que l'Adaptive.", "L'Adaptive ne fonctionne que sur les grandes résolutions d'écran.", "Le responsive design n'est pas compatible avec certains appareils mobiles.", "L'Adaptive se concentre uniquement sur l'optimisation des performances réseau.", "Le responsive design favorise les petits écrans contrairement à l'Adaptive.", "L'Adaptive ajuste automatiquement la taille des images selon l'écran.", "Le responsive design est plus rigide dans la mise en page.", "L'Adaptive est globalement moins performant pour les petits écrans.", "Le responsive design n'utilise pas de mises en page flexibles."], "feedback": "La principale différence entre l'Adaptive et le responsive design est que l'Adaptive crée une maquette différente pour chaque support, tandis que le responsive design s'adapte à la mise en page existante. Cela donne à l'Adaptive plus de flexibilité et de possibilités pour optimiser l'expérience utilisateur sur différents appareils.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "647fe78547e04201ae0b5a62bcdcab10", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Un site web réalisé en Adaptive est plus chère ... Pourquoi ? Car L'Adaptive demande de réaliser une maquette différente pour chaque support. L'adaptive permet le plus grand des confort pour l'utilisateur. On ne se contente pas de décliner comme le responsive design, on casse tout, et on recommence pour chaque support.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "86ada8bf5c004d50b7a49a3ca6caba9c", "next_id": "6053e9c5b3fb43ddb753713ab3805c43", "prev_id": "ad99bf68f1d84dd49df562681fe89fed", "associated_block_ids": [], "first_page": 196, "last_page": 196, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect du design graphique, en particulier la différence entre l'Adaptive et le responsive design, qui est pertinent dans le contexte de la conception de supports de communication visuelle. Cependant, bien que cela touche à des éléments importants comme l'accessibilité et l'expérience utilisateur, il ne couvre pas directement les concepts clés tels que la cohérence visuelle, la hiérarchie visuelle ou l'identité visuelle mentionnés dans la synthèse. L'exercice pourrait être amélioré en intégrant des questions sur ces autres aspects essentiels du design graphique pour mieux évaluer la compréhension globale des apprenants sur le sujet."}, {"exercise": {"id": "ec341e9a45cc486a89ecfc8b67368b32", "statement": "L'Adaptive Design consiste à créer une seule maquette qui s'adapte à tous les supports.", "veracity": false, "feedback": "L'Adaptive Design demande de créer plusieurs maquettes spécifiques pour chaque type de support afin d'offrir un confort maximal à l'utilisateur. Contrairement au responsive design qui décline une seule maquette pour tous les écrans, l'Adaptive refait des conceptions distinctes pour différents appareils ou résolutions.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "647fe78547e04201ae0b5a62bcdcab10", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Un site web réalisé en Adaptive est plus chère ... Pourquoi ? Car L'Adaptive demande de réaliser une maquette différente pour chaque support. L'adaptive permet le plus grand des confort pour l'utilisateur. On ne se contente pas de décliner comme le responsive design, on casse tout, et on recommence pour chaque support.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "86ada8bf5c004d50b7a49a3ca6caba9c", "next_id": "6053e9c5b3fb43ddb753713ab3805c43", "prev_id": "ad99bf68f1d84dd49df562681fe89fed", "associated_block_ids": [], "first_page": 196, "last_page": 196, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de design adaptatif (Adaptive Design) en le comparant au design réactif (responsive design), ce qui est pertinent dans le contexte de la conception de supports de communication visuelle. Cependant, bien que cela touche à un aspect important du design graphique, l'exercice ne couvre pas directement les éléments clés tels que la cohérence visuelle, l'identité visuelle ou la hiérarchie visuelle mentionnés dans la synthèse. Il évalue une compréhension technique d'un type de design mais ne teste pas suffisamment les compétences liées à la création et à l'utilisation harmonieuse des supports graphiques pour transmettre des messages clairs et engageants. Ainsi, bien qu'il soit pertinent, il manque d'une portée plus large pour obtenir une note plus élevée."}, {"exercise": {"id": "0c449302fc084f52b45d163ef8fad87b", "statement": "Les formats publicitaires sur mobile doivent être adaptés spécifiquement au format du mobile pour être efficaces.", "veracity": true, "feedback": "Il est crucial que les annonceurs tiennent compte des contraintes spécifiques du format mobile et ajustent leurs publicités en conséquence. Des outils comme Google Adwords permettent de prévisualiser l'apparence des annonces sur mobile pour s'assurer de leur compatibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f8b839b22104572b0b29d1d69e96bf2", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "À ses débuts, le m-marketing était essentiellement basé sur l'émission ou la réception de SMS, mais son univers s'est considérablement élargi avec toutes les possibilités qu'offrent les smartphones, ainsi qu'avec le développement des versions mobiles, des sites web responsives design et les applications mobiles qui représentent aujourd'hui l'essentiel du temps passé sur smartphone. La publicité sur sites internet responsive : tout comme les terminaux classiques, le mobile offre la possibilité aux annonceurs de proposer de la publicité display ou du retargeting. Il faudra cependant veiller à proposer des formats publicitaires adaptés au format du mobile ; Google Adwords offre à cet effet un outil de prévisualisation des annonces qui permet de tester l'apparence d'une annonce sur mobile.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ff7ac6fe37c544a79406adce542fb21f", "next_id": "a6353b1a16c74199ac0b0d2ddd178179", "prev_id": "ff7ac6fe37c544a79406adce542fb21f", "associated_block_ids": [], "first_page": 10, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent de la conception des supports de communication visuelle, en se concentrant sur l'importance d'adapter les formats publicitaires au mobile. Cela fait écho à la nécessité d'un design mobile-friendly mentionnée dans la synthèse. Cependant, l'exercice est limité car il ne couvre pas d'autres éléments clés tels que la cohérence visuelle, la hiérarchie ou l'identité visuelle qui sont également cruciaux pour une communication efficace. Il aurait été plus pertinent d'inclure des questions sur ces autres aspects du design graphique."}, {"exercise": {"id": "9ffa467f37084a368ad722d16d9aebc8", "query": "Le zoning permet de définir l'organisation générale des pages après la création de <blank>.", "answers": ["l'arborescence"], "distractors": [["les wireframes", "la charte graphique", "le prototype", "les maquettes", "l'interface", "le contenu"]], "feedback": "La bonne réponse est 'l'arborescence', car le zoning intervient généralement après que l'arborescence a été créée. L'arborescence correspond à la structure hiérarchique du site, tandis que le zoning s'intéresse à la répartition des blocs de contenu sur les pages. Les autres réponses sont incorrectes car elles concernent des étapes ou éléments distincts dans le processus de conception web (wireframes, maquettes, etc.).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "00b76e7578d84bc8aca501b1b9f9bf20", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Le zoning est une schématisation grossière de ce que sera la future page web. On utilise des blocs pour déterminer où se trouveront les contenus et fonctionnalités. Cette étape a généralement lieu après la création d'une arborescence, il arrive quelquefois qu'elle soit réalisée en parallèle. Définir l'organisation générale des pages est l'occasion de présenter une première approche au client ou décisionnaire. Celui-ci pourra alors valider ou réajuster les grands axes avant la réalisation des wireframes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ca3a3b061acc4c1993a950f55381a501", "next_id": "3f25bae14b91425cbe3eaf5ddde84d51", "prev_id": "ca3a3b061acc4c1993a950f55381a501", "associated_block_ids": [], "first_page": 204, "last_page": 204, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'organisation des pages dans le cadre de la conception de supports de communication visuelle, ce qui est pertinent par rapport à la référence. Le zoning et l'arborescence sont des concepts liés à la mise en page et à la hiérarchie visuelle, deux éléments clés mentionnés dans la synthèse. Cependant, l'exercice se concentre principalement sur une étape spécifique du processus (l'arborescence) plutôt que sur les principes globaux du design graphique ou de la communication visuelle. Il aurait été plus pertinent d'inclure des questions qui englobent davantage les concepts comme l'identité visuelle ou le responsive design pour obtenir un score plus élevé."}, {"exercise": {"id": "da35feb49e864dec9be4a552fb20bd03", "query": "Les wireframes servent de base aux web designers pour <blank>, tout en respectant les souhaits et contraintes validés par le client.", "answers": ["la conception des maquettes"], "distractors": [["la gestion du budget", "le développement des fonctionnalités", "la maintenance du site", "la création du contenu", "l'organisation des réunions", "l'élaboration de scripts"]], "feedback": "Les wireframes sont des schémas représentant la structure d'une page web. Ils guident les web designers dans la phase créative appelée 'conception des maquettes', qui consiste à traduire ces schémas en une interface visuelle définitive. Les autres options, comme la maintenance du site ou la gestion du budget, relèvent de processus différents qui n’interviennent pas directement dans cette phase.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a055a15584924327a43b2aecb379102d", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Les wireframes valides servent de base aux web designers pour la conception des maquettes. L'organisation des éléments et le système de navigation imaginés ne sont pas immuables mais les « créatifs » doivent respecter les fonctionnalités souhaitées et validées par le client ainsi que le budget alloué au projet.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "37da8e810e05498aa16ef7b27c3e32b3", "prev_id": "0c89f3ee23f341a0b428d9309f5b4e75", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé évalue la compréhension des wireframes dans le processus de conception visuelle, ce qui est pertinent pour le sujet de la communication visuelle. Cependant, il se concentre principalement sur un aspect technique spécifique (les wireframes) plutôt que sur une approche globale de la conception des supports de communication visuelle. Bien qu'il touche à l'importance de la structure dans le design graphique, il ne couvre pas d'autres éléments clés mentionnés dans la synthèse, tels que l'identité visuelle ou la cohérence graphique. Par conséquent, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects essentiels du sujet."}, {"exercise": {"id": "a9e39306cb3b4f74b096fd9dd4b2697a", "statement": "Le wireframe consiste à définir l'organisation des éléments et des formes tout en travaillant l'aspect visuel.", "veracity": false, "feedback": "Le wireframe se concentre sur l'organisation des éléments comme les images, textes ou vidéos sans travailler l'aspect visuel. Le graphisme n'intervient qu'à une étape ultérieure du projet.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de wireframe, qui est pertinent dans le contexte de la conception de supports de communication visuelle. Bien que l'affirmation soit incorrecte, elle touche à des éléments clés tels que l'organisation des éléments graphiques et leur importance dans la création d'une interface utilisateur. Cependant, l'exercice ne couvre pas directement d'autres aspects essentiels mentionnés dans la synthèse, comme la cohérence visuelle ou l'identité visuelle. Il aurait pu être amélioré en intégrant des questions sur ces autres concepts pour évaluer plus largement la compréhension des principes du design graphique."}, {"exercise": {"id": "8e5ba8bc76134ef29a61602830eb71f2", "question": "Quelles polices sont généralement plus adaptées à de longs blocs de texte ?", "answers": ["Celles qui facilitent une lecture fluide et continue"], "distractors": ["Celles destinées aux logos complexes.", "Celles particulièrement artistiques et ornementales.", "Celles avec des formes très stylisées et distinctives.", "Celles orientées vers des affiches et des bannières.", "Celles uniquement adaptées aux titres courts et accrocheurs.", "Celles conçues pour les signatures électroniques.", "Celles spécialisées pour l'impression en grand format.", "Celles exclusivement prévues pour les effets visuels complexes.", "Celles réservées aux mises en page créatives et originales."], "feedback": "Les polices de caractères qui facilitent une lecture fluide et continue sont plus adaptées aux longs blocs de texte car ils permettent aux lecteurs de rester concentrés sans être distraits par des éléments graphiques trop complexes ou excentriques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c809e8459a1245b2bb2030116436e04c", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Mais choisir entre les meilleures polices de caractères web et les meilleures polices de caractères web-safe n'est pas la seule décision que vous devrez prendre. Vous devez également déterminer quel style de typographie convient le mieux à l'image de votre marque ainsi qu'à votre site web. Certaines polices sont plus adaptées à de longs blocs de texte, tandis que d'autres seront plus utiles pour créer des titres accrocheurs, etc. Et bien sûr, les polices de caractères auront une influence différente sur la manière dont votre marque sera perçue par le public.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "dbb59e71462a4981aec690f602f9d01d", "next_id": "ebb291163e95475d9d46c4b2e2a26406", "prev_id": "dbb59e71462a4981aec690f602f9d01d", "associated_block_ids": [], "first_page": 286, "last_page": 286, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception des supports de communication visuelle, à savoir le choix des polices adaptées à la lisibilité. Cela fait partie intégrante du design graphique et de la mise en page, qui sont des éléments cruciaux pour assurer une communication efficace. Cependant, l'exercice se concentre uniquement sur les polices sans explorer d'autres dimensions essentielles comme la cohérence visuelle, l'identité de marque ou l'accessibilité. Bien qu'il soit pertinent, il ne couvre pas suffisamment les concepts clés mentionnés dans la référence pour obtenir une note plus élevée."}, {"exercise": {"id": "0dbdd87a7b9c4075b3ef23380297eec5", "query": "Les sites web adoptant un design minimaliste utilisent souvent <blank> pour créer un effet visuel apaisant et épuré.", "answers": ["des couleurs atténuées"], "distractors": [["des couleurs flashy", "des textures granulaires", "de multiples polices de caractères", "des animations complexes", "des formes géométriques audacieuses", "des images vives et contrastées"]], "feedback": "La bonne réponse est 'des couleurs atténuées', car les sites minimalistes mettent l'accent sur la simplicité, souvent en réduisant l'intensité des couleurs pour renforcer l'effet visuel calme et épuré. Les autres options, comme 'des couleurs flashy' ou 'des images vives et contrastées', contreviennent à cet objectif en ajoutant trop de détails et de dynamisme.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension des principes de design graphique, en particulier l'utilisation des couleurs dans un contexte de communication visuelle. Bien que cela soit pertinent pour le sujet de la conception de supports de communication visuelle, il ne couvre pas tous les aspects clés mentionnés dans la référence, tels que la cohérence visuelle, l'identité visuelle ou le responsive design. L'exercice se concentre uniquement sur un aspect spécifique (le design minimaliste et l'utilisation des couleurs), ce qui limite sa portée par rapport à l'ensemble des concepts abordés dans la synthèse."}, {"exercise": {"id": "9c6eeda4fa1f48ed9671f267f8eed306", "question": "Quelle est la fonction principale du blanc en branding ?", "answers": ["Accentuer et mettre en valeur d’autres couleurs utilisées"], "distractors": ["Atténuer la force des couleurs vives.", "Créer une ambiance nostalgique.", "Renforcer un sentiment de mystère profond.", "Promouvoir la culture minimaliste.", "Encourager la neutralité émotionnelle.", "Symboliser la stabilité et la sécurité.", "Maximiser l'impact visuel des bordures.", "Exprimer la créativité et l'innovation.", "Diminuer l’intensité des messages publicitaires agressifs."], "feedback": "Le blanc est universellement utilisé en branding car il a la capacité d'accentuer et de mettre en valeur les autres couleurs utilisées autour de lui. Sa simplicité et sa neutralité permettent aux couleurs qu'il accompagne de ressortir davantage et d'avoir un impact visuel plus fort. Les autres options proposées en tant que distracteurs ont des fonctions différentes et ne correspondent pas à la fonction principale du blanc en branding.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "35b1a432f4f44437a151d1805c4e52f3", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "Rose : si la couleur rose est souvent utilisée pour cibler une audience féminine, sa signification varie en fonction du ton utilisé et pourra même séduire la gent masculine (#realmenwearpink). Le rose a aussi un côté philanthropique puisque c'est la couleur de la lutte contre le cancer du sein. Blanc : parfois, l'absence de couleurs est la meilleure option. Le blanc est universellement utilisé en branding, surtout pour accentuer d'autres couleurs.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cf9f92367766436ca70b24ce528beab0", "next_id": "e71e086872e7415dafc6bb3b9de3e2d3", "prev_id": null, "associated_block_ids": [], "first_page": 345, "last_page": 347, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur la fonction du blanc en branding, ce qui est un aspect pertinent de la communication visuelle et du design graphique. Cependant, il ne couvre pas directement les concepts clés mentionnés dans la référence, tels que la conception de supports de communication visuelle dans son ensemble ou l'importance de la cohérence visuelle et de l'identité de marque. Bien que le blanc joue un rôle dans l'accentuation des couleurs et puisse contribuer à une identité visuelle forte, l'exercice se concentre sur un détail spécifique plutôt que sur une compréhension globale des principes de conception. Cela limite sa capacité à évaluer pleinement la maîtrise des compétences liées à la conception de supports de communication visuelle."}, {"exercise": {"id": "68a9c781228f4b0aaa323edfcec307a7", "question": "Quelle police est recommandée pour les conceptions à forte densité de texte ?", "answers": ["Garamond, idéale pour les designs à fort contenu textuel"], "distractors": ["Helvetica, souvent utilisée pour le web", "Arial, largement répandue et sans-serif", "Courier New, employée pour les codes informatiques", "Verdana, conçue pour une lisibilité optimale à l’écran", "Calibri, une police moderne et sans-serif", "Georgia, une police robuste pour le web", "Tahoma, une police simple et épurée", "Comic Sans, populaire mais souvent critiquée", "Palatino, utilisée principalement dans l’impression de livres académiques"], "feedback": "La police Garamond est souvent recommandée pour les designs à forte densité de texte car ses proportions sont agréables à l'œil et facilitent la lecture. De plus, elle fonctionne bien en impression, ce qui la rend idéale pour les contenus textuels importants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c4d69bc67c8940ab8f1e565c08039a1a", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Peut-être la plus inhabituelle de ce groupe de polices à empattements web-safe, la police Garamond est pourtant une des préférées des designers. Sachez que cette police fonctionne mieux en impression - elle est idéale pour les designs à forte densité de texte, car ses proportions sont très agréables à l'œil. Toujours sérieuse, toujours directe, la police Times New Roman convient parfaitement aux contenus factuels et formels, tels que les textes universitaires. Elle serait également une police de choix pour un cabinet d'avocats par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf0bfc2e1b634787b12621bca1a74791", "next_id": null, "prev_id": "d434617381af4bf0884a56a616d7a0b8", "associated_block_ids": [], "first_page": 292, "last_page": 293, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'une police spécifique recommandée pour des conceptions à forte densité de texte, ce qui est pertinent dans le contexte de la conception de supports de communication visuelle. Cependant, il ne couvre pas directement les concepts plus larges tels que la cohérence visuelle, l'identité visuelle ou l'importance du design graphique dans son ensemble. Bien qu'il soit utile pour évaluer une compétence technique spécifique, il manque d'une portée plus globale qui engloberait les principes fondamentaux du design graphique mentionnés dans la synthèse."}], "sources": [{"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 59.3, "top_pages": [303, 276], "top_minutes": []}]}