{"introduction": "La conduite d'un projet en mécénat et sponsoring nécessite une approche méthodique pour concevoir et gérer efficacement les initiatives. Cela implique non seulement la mobilisation des ressources disponibles, mais aussi un suivi rigoureux de l'avancement du projet, une communication fluide entre les équipes et une évaluation continue des résultats. Cette synthèse explore les concepts clés qui sous-tendent la gestion de projets dans ce domaine, mettant en lumière leur interconnexion et leur pertinence.", "synthesis": "La gestion efficace d'un projet en mécénat et sponsoring repose sur plusieurs thèmes centraux. Tout d'abord, les 'Ressources de l'organisme' sont fondamentales, car elles englobent tous les moyens financiers et matériels nécessaires à la réalisation du projet. Un bon 'Suivi de l'avancement' est crucial pour garantir que le projet progresse comme prévu, permettant ainsi d'ajuster les actions si nécessaire. La 'Communication continue' entre les membres de l'équipe assure une cohérence dans le travail collaboratif, minimisant ainsi les risques de conflits.\n\nUn autre aspect important concerne les 'projets critiques', qui nécessitent une attention particulière en raison de leur impact potentiel sur le succès global de l'organisation. L'évaluation du 'ROI positif' permet aux responsables de déterminer si le projet génère suffisamment de bénéfices pour justifier son coût initial. Par ailleurs, l'adoption d'une approche 'Agile' favorise la flexibilité dans la gestion du projet, permettant aux équipes de s'adapter rapidement aux changements tout en impliquant continuellement les utilisateurs.\n\nLes 'règles métier' jouent également un rôle essentiel dans la définition des processus opérationnels liés au mécénat et au sponsoring, garantissant ainsi que toutes les actions entreprises respectent des critères établis pour assurer efficacité et cohérence. La 'Coordination entre équipes' est indispensable pour faciliter la transition entre différentes phases du projet, notamment lors des développements ou tests.\n\nEnfin, un 'Débrief' après chaque phase ou événement permet d'analyser ce qui a fonctionné ou non, offrant ainsi des pistes d'amélioration pour l'avenir. Dans le cadre numérique actuel, la 'Gestion d'Événements' et la 'Communication digitale' sont devenues incontournables pour interagir avec divers publics cibles efficacement. En intégrant ces concepts dans un cadre structuré, il devient possible non seulement de concevoir mais aussi de gérer avec succès des projets en mécénat et sponsoring.", "concepts": [{"concept": {"id": "136bdefc-7ff5-4e01-9734-ce1972323299", "label": "Ressources de l'organisme", "definition": "Ensemble des moyens financiers et matériels disponibles pour une entité, incluant budget, subventions et revenus divers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les ressources de l'organisme sont fondamentales pour conduire un projet en mécénat et sponsoring, car elles déterminent les capacités financières et matérielles disponibles pour réaliser le projet."}, {"concept": {"id": "a3e4a324-8a40-4d42-90c1-995c08e2c180", "label": "Suivi de l'avancement", "definition": "Pratique consistant à monitorer régulièrement les progrès réalisés dans un projet afin d'assurer une bonne gestion du temps et des ressources.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13635], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le suivi de l'avancement est essentiel pour gérer efficacement un projet, garantissant que les objectifs sont atteints dans les délais impartis."}, {"concept": {"id": "5b7b4dd7-8934-4844-b72c-ab548c3cebf9", "label": "Communication continue", "definition": "Échange régulier d'informations entre membres d'une équipe pour assurer cohérence et éviter conflits lors du développement collaboratif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13654], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La communication continue est cruciale pour la gestion de projets afin d'assurer une bonne coordination entre les membres de l'équipe impliqués dans le mécénat et le sponsoring."}, {"concept": {"id": "25d8b085-b1a7-41fe-a903-4ee8101bb8c2", "label": "projets critiques", "definition": "Initiatives essentielles au succès opérationnel d'une entreprise, nécessitant une attention particulière en raison de leur impact potentiel sur les résultats financiers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13627], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les projets critiques sont essentiels pour le succès d'une entreprise et leur gestion est cruciale dans tout projet, y compris ceux liés au mécénat et sponsoring."}, {"concept": {"id": "290a7561-1e35-48ee-af31-7c444586dc44", "label": "ROI positif", "definition": "Un retour sur investissement (ROI) positif indique que les bénéfices d'un projet surpassent ses coûts, justifiant ainsi l'investissement initial.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13621], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un ROI positif est crucial pour justifier un projet de mécénat et sponsoring, car il permet d'évaluer si les bénéfices générés par le projet dépassent les coûts engagés, ce qui est central à la prise de décision dans ce domaine."}, {"concept": {"id": "295d4059-ab79-4496-94b9-ee26862fda8d", "label": "Agilité", "definition": "L'agilité est une approche de gestion de projet qui privilégie la flexibilité et l'adaptation rapide aux changements, tout en impliquant continuellement les utilisateurs dans le développement. Elle se manifeste par la capacité d'une entreprise à réagir rapidement aux évolutions du marché, facilitée par des pratiques telles que DevOps et des cycles de développement courts, favorisant ainsi une meilleure collaboration et une livraison continue de valeur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13642, 13663], "aliases": ["8736dd75-20d4-4e7a-94b7-cd09772b6950", "b93ad9d5-b5e5-4a0d-a649-2fe3d41c482e"], "wikientity": {"label": "Management agile", "definition": "Le management agile est l'application des principes du développement agile de logiciels et du Lean Management à divers processus de gestion, notamment le développement de produits et la gestion de projets. Il peut être vu comme une organisation de type holistique et humaniste basée essentiellement sur la motivation rationnelle des ressources humaines. Son émergence, au début des années 1990, a été portée par la vague des nouvelles technologies (NTIC).", "page_id": "2751455", "wikidata_id": "Q556396", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Agilité", "definition": "the gracefulness of a person or animal that is quick and nimble", "name": "agility.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "L'agilité est très pertinente pour conduire un projet, car elle permet une flexibilité et une adaptation rapide aux besoins des parties prenantes dans le cadre d'un projet de mécénat ou de sponsoring."}, {"concept": {"id": "ff0398d0-94e8-40d9-bfe8-71f05ac0a1c9", "label": "règles métier", "definition": "Directives et critères définissant les processus opérationnels d'une entreprise, essentielles pour assurer la cohérence et l'efficacité du système de tarification.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13627], "aliases": [], "wikientity": {"label": "Règles métier", "definition": "Les règles métier (ou règles de gestion, ou « business rules » en anglais) sont des déclarations de haut niveau structurées qui permettent de contraindre, contrôler et influencer un aspect du métier. Aussi ces dernières peuvent diminuer ou augmenter l'impact de risque, et encore prendre des décisions rationnelles.", "page_id": "395956", "wikidata_id": "Q1518244", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Les règles métier sont cruciales pour définir les processus opérationnels d'un projet en mécénat et sponsoring, assurant ainsi que toutes les actions respectent les objectifs fixés."}, {"concept": {"id": "991e534d-656c-4e1f-b591-407211354ea5", "label": "Coordination entre équipes", "definition": "La collaboration nécessaire entre les équipes de développement, test et exploitation pour assurer une transition fluide entre les différents environnements.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13656], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La coordination entre équipes est essentielle pour gérer efficacement un projet, y compris ceux liés au mécénat et au sponsoring, car elle assure une bonne communication et collaboration entre les parties prenantes."}, {"concept": {"id": "0ffe2f05-6237-4364-be36-69daf847bc77", "label": "Débrief", "definition": "Un débrief est une analyse ou un retour d'expérience après un événement, permettant d'évaluer les résultats et d'identifier des améliorations.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13626], "aliases": [], "wikientity": {"label": "Débriefing", "definition": "Le débriefing (de l'anglais debriefing), réunion-bilan, séance d'évaluation ou plus rarement débreffage désigne une évaluation post-événementielle, dans le cadre d'une équipe ayant pris part à l'événement.\nEn psychologie, il s'agit d'un bilan psychologique d'événement, voir l'article Débriefing (psychologie). Ce cas est exclu du présent article.", "page_id": "440209", "wikidata_id": "Q2669680", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "'Débrief' est très pertinent car il s'agit d'une étape essentielle après un événement ou un projet pour évaluer les résultats et planifier des améliorations."}, {"concept": {"id": "ec7a9773-d5da-4b5f-8ea4-be75a3e4eb3b", "label": "Gestion d'Événements", "definition": "La gestion d'événements désigne le processus par lequel les applications web interagissent avec les utilisateurs à travers des événements tels que des clics, des soumissions de formulaires ou des frappes au clavier. Cela inclut l'utilisation de fonctions JavaScript qui réagissent à ces actions et à d'autres événements comme mouseup ou touchend, permettant ainsi une interactivité dynamique et essentielle pour améliorer l'expérience utilisateur dans les applications web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13666, 13708], "aliases": ["4a3ccbaf-84b7-4a16-99ca-c6adc36ac179", "ac1a125e-c3a4-407e-8999-2387b0c3aff8", "4d2802a3-dcaf-4d14-95a4-e62d0ad14be8"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Gestion d'Événements' est très pertinent car elle touche directement à l'organisation et à la gestion d'événements qui peuvent faire partie intégrante d'un projet de mécénat ou de sponsoring."}, {"concept": {"id": "5792c744-4854-454e-8f87-ec4f5ccf2582", "label": "Éco-conception", "definition": "L'éco-conception est une approche de design qui intègre des considérations écologiques et les enjeux environnementaux dans la conception de produits ou services, y compris le développement durable dans la création de sites web. Elle vise à minimiser l'impact environnemental tout au long du cycle de vie des produits ou services, en équilibrant durabilité, faisabilité technique et performance visuelle et économique, tout en cherchant spécifiquement à réduire l'empreinte écologique des plateformes numériques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13689, 13705, 13707, 13710], "aliases": ["38fcc5fa-1e9a-4c59-aae0-84056f944879", "609f9dc6-35e8-4391-930d-0357b9e53ae7", "dfc96dcc-97c8-4069-b1a1-dfbb8ca41f8a", "05a8aba3-d572-485a-b33a-17449f7e81db", "4e4dabed-3dd1-4b7f-a965-da4f5c53ce5d"], "wikientity": {"label": "Écoconception", "definition": "L’écoconception est la volonté de concevoir des produits respectant les principes du développement durable et de l'environnement, en — selon l'Ademe — recourant « aussi peu que possible aux ressources non renouvelables en leur préférant l'utilisation de ressources renouvelables, exploitées en respectant leur taux de renouvellement et associées à une valorisation des déchets qui favorise le réemploi, la réparation et le recyclage », dans un contexte qui évoluerait alors vers une économie circulaire.\nLa définition officielle qui fait foi pour l'ADEME est la suivante : « C’est une démarche préventive et innovante qui permet de réduire les impacts négatifs du produit, service ou bâtiment sur l’environnement sur l’ensemble de son cycle de vie (ACV), tout en conservant ses qualités d’usage. »\nÀ partir de celle-ci, on peut en effet décliner d'autres formulations ou déclinaisons.", "page_id": "3967563", "wikidata_id": "Q795082", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'éco-conception peut être pertinente si le projet inclut des considérations environnementales, ce qui pourrait enrichir une initiative de mécénat responsable."}, {"concept": {"id": "7c15d1a8-6a39-4bb9-b353-1112c86b8900", "label": "Communication digitale", "definition": "Échange d'informations via des plateformes numériques, nécessitant une ergonomie adaptée pour optimiser l'interaction.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Communication numérique", "definition": "La communication numérique, parfois appelée « communication digitale » (anglicisme), est un champ des sciences de l’information relatif à l'utilisation de l’ensemble des médias numériques : le web, les médias sociaux ou les terminaux mobiles par exemple. Ces médias sont utilisés comme des canaux de diffusion, de partage et de création d'informations.", "page_id": "5018281", "wikidata_id": "Q97368847", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La communication digitale est essentielle pour promouvoir un projet de mécénat et sponsoring, car elle permet d'engager les parties prenantes et de diffuser des informations pertinentes."}, {"concept": {"id": "90b4729d-efda-4da6-b320-d6888f6aa71a", "label": "Norme de référence", "definition": "Cadre légal et technique définissant les exigences minimales que doivent respecter les services publics en matière d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Une norme de référence sur l'accessibilité pourrait être très pertinente pour un projet en mécénat si celui-ci vise à améliorer l'accès aux services publics."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Usagers' est central dans tout projet car comprendre les besoins des utilisateurs est essentiel pour concevoir un projet efficace en mécénat et sponsoring."}, {"concept": {"id": "30934c30-b6d3-4037-90e6-eb71fe6e7a50", "label": "Événements Universitaires", "definition": "Activités organisées au sein d'institutions académiques, souvent gérées via des applications dédiées pour faciliter l'accès et la participation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13666], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Événements Universitaires' sont souvent liés aux projets de mécénat et peuvent être une partie intégrante de tels projets, rendant ce concept assez pertinent."}], "exercises": [], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 2.5, "top_pages": [8, 9], "top_minutes": []}]}