{"introduction": "La conception d'une signalétique efficace repose sur une compréhension approfondie des éléments graphiques et de l'accessibilité de l'information. Dans le cadre de la création de dessins techniques, plans ou cartes, il est essentiel d'intégrer des principes ergonomiques et visuels qui garantissent une communication claire et intuitive. Cette synthèse explore les concepts clés nécessaires à la réalisation d'une signalétique adaptée aux besoins des utilisateurs.", "synthesis": "La conception graphique d'une signalétique implique plusieurs éléments essentiels qui contribuent à la clarté et à l'efficacité de la communication visuelle. Les éléments graphiques, tels que les images, icônes et typographie, jouent un rôle crucial dans la transmission d'informations complexes tout en influençant l'interaction utilisateur. L'accessibilité de l'information est également primordiale ; elle garantit que le contenu soit compréhensible indépendamment des caractéristiques visuelles, permettant ainsi une expérience inclusive pour tous les utilisateurs.\n\nL'ergonomie est au cœur du design de signalétique, visant à optimiser l'interaction entre les utilisateurs et leur environnement. Cela inclut non seulement le confort physique mais aussi la facilité d'utilisation des interfaces numériques. La navigation doit être intuitive, facilitée par des systèmes bien conçus comme des menus ou des plans du site qui permettent aux utilisateurs de se déplacer aisément entre différentes sections.\n\nUn autre aspect fondamental est le contraste visuel qui assure la lisibilité du contenu. Une bonne lisibilité dépend également de facteurs tels que la taille de police et l'espacement entre les éléments graphiques. En parallèle, il est crucial que toutes les informations soient accessibles ; cela passe par l'utilisation d'attributs alternatifs pour décrire les contenus visuels afin qu'ils soient compréhensibles par tous, y compris ceux utilisant des technologies d'assistance.\n\nEnfin, respecter des normes telles que la norme européenne EN 301 549 permet de garantir que tous les produits numériques sont utilisables par tous, y compris les personnes en situation de handicap. En intégrant ces principes dans le processus de conception technique pour créer une signalétique efficace, on s'assure non seulement d'une meilleure expérience utilisateur mais aussi d'un accès équitable à l'information.", "concepts": [{"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les éléments graphiques sont au cœur de la conception de signalétique, car ils constituent les composants visuels nécessaires pour communiquer efficacement l'information et influencer l'interaction utilisateur."}, {"concept": {"id": "f8fef91f-49c3-42b5-8011-0d757728f3fe", "label": "Accessibilité de l'information", "definition": "L'accessibilité de l'information stipule que les contenus d'une page web doivent être présentés de manière à ce qu'ils ne dépendent pas uniquement de la forme, de la taille ou de la position pour être compris. Cela implique que l'implémentation des informations doit garantir leur pertinence et leur clarté, indépendamment des caractéristiques visuelles, afin d'assurer une expérience utilisateur inclusive pour tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["00c13664-f2f4-4aa1-9b3d-a10e3b0ad4ce"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "L'accessibilité de l'information est cruciale dans le cadre de la signalétique, car elle garantit que toutes les informations sont compréhensibles indépendamment des caractéristiques visuelles, favorisant ainsi une expérience inclusive."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "Les images jouent un rôle central dans le design graphique et sont essentielles pour transmettre des messages clairs dans une signalétique. Leur utilisation doit toujours être accompagnée d'alternatives textuelles pour garantir l'accessibilité."}, {"concept": {"id": "8bea4ed6-e0be-42d8-9550-08e27e899656", "label": "Étiquette visible", "definition": "L'étiquette visible, également connue sous le nom d'étiquette de champ de formulaire, est un texte descriptif affiché à l'utilisateur qui identifie et décrit la fonction ou le contenu d'un champ de saisie dans un formulaire. Elle informe l'utilisateur sur le type ou le format des données attendues, ce qui est essentiel pour guider les utilisateurs dans la saisie correcte des données et garantir une navigation accessible. Cette étiquette est souvent placée à côté du champ de formulaire et doit être interprétée selon le contexte d'utilisation, contribuant ainsi à l'accessibilité et à la compréhension des données à saisir.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["31a667fd-4d2d-4bf7-9c32-aba87d6f5552", "44e72e3c-caaf-4def-a438-1bb206e2f2b2", "19586bd9-e5ce-4fcc-a937-584141d233ce", "d45a8f20-b129-433c-ab6c-c29fdb0a7a6b", "61ec6f49-ba27-4d21-8335-3aeeb7721617"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "L'étiquette visible est essentielle dans la conception de signalétiques car elle guide l'utilisateur en fournissant des informations claires sur chaque élément du dessin ou du plan."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La description détaillée est essentielle pour l'accessibilité et enrichit la compréhension des éléments visuels dans une signalétique, en fournissant un contexte crucial aux utilisateurs ayant des déficiences visuelles."}, {"concept": {"id": "95951d09-407f-42df-b703-47680e64ec8f", "label": "Ergonomie", "definition": "L'ergonomie est une science interdisciplinaire qui étudie la conception des objets, systèmes et produits afin qu'ils soient adaptés aux utilisateurs. Elle vise à optimiser l'interaction entre l'homme et son environnement en améliorant le confort, l'efficacité, la sécurité et la satisfaction des utilisateurs. Cela inclut également l'adaptation des interfaces aux besoins et comportements des utilisateurs tout en tenant compte de leurs capacités physiques et cognitives.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13710], "aliases": ["80655e5a-4c5c-4bde-90f0-54b72dda4845", "2671d243-2e4f-4a1e-a92e-61a810365839", "b25bf7f5-d332-4992-ac34-d439e39f149b"], "wikientity": {"label": "Ergonomie", "definition": "L’ergonomie est « l'étude scientifique de la relation entre l'humain et ses moyens, méthodes et milieux de travail » et l'application de ces connaissances à la conception de systèmes « qui puissent être utilisés avec le maximum de confort, de sécurité et d'efficacité par le plus grand nombre ».", "page_id": "1268752", "wikidata_id": "Q1750812", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Ergonomie", "definition": "the branch of engineering science in which biological science is used to study the relation between workers and their environments", "name": "biotechnology.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "L'ergonomie est essentielle dans la conception de signalétiques, car elle vise à optimiser l'interaction entre les utilisateurs et les informations présentées, garantissant ainsi une meilleure compréhension et utilisation."}, {"concept": {"id": "c9ee01fb-bf8c-4856-bac0-1ac34883ec8c", "label": "Plan du site", "definition": "Page web listant l'arborescence et les liens vers toutes les sections d'un site, servant de guide pour les utilisateurs et facilitant la navigation ainsi que le référencement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["6526f8bb-9abe-4a56-a20a-7c21a1f4b951"], "wikientity": {"label": "Plan de site", "definition": "Un plan du site (sitemap en anglais) est une représentation de l'architecture d'un site Internet qui liste les ressources proposées, en général sous forme hiérarchique. Il s'agit le plus souvent d'une page web qui permet à l'internaute d'accéder rapidement à l'ensemble des pages proposées à la lecture, et facilite le travail des robots d'indexation.\nGoogle a proposé un protocole nommé Sitemaps en 2005.", "page_id": "424174", "wikidata_id": "Q1503327", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "'Un plan du site est très pertinent car il représente une forme concrète d'organisation visuelle qui aide à structurer l'information dans une signalétique.'"}, {"concept": {"id": "9d54c769-32af-4dfb-bf56-1878ed64d5e5", "label": "Perception des informations", "definition": "Capacité à interpréter et comprendre les données présentées dans une interface; cruciale pour une navigation efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La perception des informations est cruciale pour une signalétique efficace, car elle détermine comment les utilisateurs interprètent les données présentées sur le dessin ou le plan."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La simplicité est un principe fondamental en design qui s'applique directement à la création de signalétiques claires et efficaces, facilitant ainsi leur compréhension par les utilisateurs."}, {"concept": {"id": "9afb0643-e273-456d-8fd2-4ab13b0d8236", "label": "Contraste visuel", "definition": "Le contraste visuel, ou ratio de contraste, désigne la mesure de l'opposition entre la luminosité ou la couleur d'un élément de premier plan et celle d'un arrière-plan. Ce contraste est essentiel pour garantir la lisibilité et l'accessibilité des contenus numériques sur les pages web et les interfaces visuelles, en particulier pour les utilisateurs ayant des déficiences visuelles. Il joue un rôle crucial dans l'expérience utilisateur en assurant que le contenu soit facilement discernable par tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707, 13710, 13708], "aliases": ["5c481e4e-e436-4bb7-a7e9-53bc0830e306", "b12c3286-f79e-4321-a6d3-db4c95e9c849", "650d5354-ed61-4940-8878-706a15f07f6f", "1c2f3e20-96e3-4275-8631-9e9564ed2ed1", "c4dddffe-8da9-4405-8b54-28eb0959e6dd", "7141a9bd-f2a9-4685-95e3-5e81f87d7c9a", "cd3ee3d7-bb6f-4084-9226-a941f6eb43b9"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le contraste visuel est essentiel pour garantir que les informations sur une signalétique soient lisibles et accessibles à tous les utilisateurs, en particulier ceux ayant des déficiences visuelles."}, {"concept": {"id": "abab00ff-8712-4110-9378-5d7cb7ae5952", "label": "attribut label", "definition": "Propriété d'une balise <optgroup> ou <input> qui fournit une description textuelle pour aider à identifier le contenu ou la fonction.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'attribut label est fondamental pour identifier clairement les éléments d'une signalétique, facilitant ainsi leur compréhension et utilisation par les utilisateurs."}, {"concept": {"id": "3f7470d7-442d-4922-9f23-70be2de8c8c8", "label": "Accessibilité des contenus visuels", "definition": "L'accessibilité des contenus visuels se réfère à la fourniture de descriptions textuelles pour les images et éléments graphiques, permettant aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, de comprendre le contenu visuel lorsque celui-ci ne peut pas être affiché. Cela inclut l'utilisation d'attributs alternatifs en HTML qui décrivent ces images, ainsi que la mise à disposition de contenu ou fonctionnalités équivalentes lorsque certaines conditions ne sont pas remplies, garantissant ainsi une accessibilité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7f9d95fb-80ae-4ce9-b4ad-ed8ff0eab829", "104cae17-0a9a-49b6-9395-a7a4af1f4c39", "963fcb43-959a-46ac-8a0e-df703abd85f0", "88400249-4250-499f-b98d-a5cb498ee7cc", "5b26344a-b71c-4c0f-b03c-af99333bff27"], "wikientity": {"label": "Alternative textuelle", "definition": "L'alternative textuelle est un texte que l'on associe à un contenu graphique comme une image, une zone cliquable dans une image ou un élément de formulaire de type image, dans un site web ou dans un document produit par un logiciel d'une suite bureautique, pour que l'utilisateur qui ne peut visualiser l'image puisse être informé de ce qu'elle représente et signifie. L'alternative textuelle est restituée à la place de l'image quand celle-ci n'est pas consultable.\nL'alternative textuelle, dont l'emploi est obligatoire dans le cadre de l'accessibilité du web, concerne tant les personnes qui utilisent un navigateur textuel ou un lecteur d'écran, que celles qui, par choix ou à cause d'un problème technique, ne peuvent visualiser l'image.", "page_id": "7715605", "wikidata_id": "Q1067764", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'accessibilité des contenus visuels est cruciale pour s'assurer que toute signalétique soit compréhensible par tous les utilisateurs, rendant ce concept hautement pertinent."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La lisibilité est essentielle pour toute forme de communication visuelle, y compris les signalisations et les cartes, rendant ce concept très pertinent."}, {"concept": {"id": "0848f0a2-8c68-4f4f-8e65-b78c67566052", "label": "Norme européenne EN 301 549", "definition": "La norme européenne EN 301 549 V2.1.2 définit les exigences d'accessibilité pour les produits et services TIC, garantissant que ces technologies sont utilisables par tous, y compris les personnes en situation de handicap. Elle s'applique à tous les produits et services TIC, y compris les sites web, et vise à assurer l'inclusion numérique. Cette norme intègre également les directives WCAG et couvre des éléments non inclus dans le RGAA, influençant ainsi la conception web accessible.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["3d30ebce-7099-48d2-b959-d64c3e54bf97", "21d8d71b-7fa2-4114-8b74-984884ba1bbc", "c66c9c11-6c72-4ac1-9d6c-cb75869371a5", "cd694ba7-82e0-4385-8930-57e411028350", "154fdc47-2052-4b0e-8a60-3ff084abeece", "3f89fd38-95b8-4e02-bf0f-3788d8c8eefb"], "wikientity": {"label": "EN 301 549", "definition": "EN 301 549 est une norme européenne d'accessibilité numérique. Il spécifie les exigences pour que les technologies de l'information et de la communication soient accessibles aux personnes handicapées.\nLa norme EN 301 549 a été élaborée par le CEN, le CENELEC et l'ETSI pour définir les exigences relatives aux marchés publics pour les produits et services dans l'Union européenne.", "page_id": "15188546", "wikidata_id": "Q29687903", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La norme européenne EN 301 549 est très pertinente car elle définit les exigences d'accessibilité qui doivent être prises en compte lors de la conception de toute forme de communication visuelle, y compris la signalétique."}, {"concept": {"id": "65a2d925-96a7-48d0-94eb-7917f284ca13", "label": "Navigation", "definition": "La navigation, ou système de navigation, désigne le processus et les systèmes utilisés pour se déplacer efficacement et intuitivement à travers les différentes sections ou pages d'une interface web ou d'une application. Cela inclut l'utilisation de menus, de tables des matières, de plans du site et d'autres méthodes qui contribuent à une expérience fluide, à l'ergonomie, à la compréhension du site et à l'accessibilité. Les systèmes de navigation facilitent également la recherche d'informations via des moteurs de recherche intégrés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13666, 13708], "aliases": ["5f336d11-a83e-4c09-b404-30caf3494f2e", "c7ba75e2-9acf-40e4-b21f-c85f713d24b5", "79990658-2b4b-49e2-890e-ea7343e190ce", "886ea679-2ba8-4a0b-885b-281920a96a5e", "810c55c8-6be9-4b80-9b41-622b41ddf2e9"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La navigation est pertinente car elle concerne comment les utilisateurs interagissent avec les informations fournies par une signalétique, facilitant leur compréhension et leur orientation."}, {"concept": {"id": "407bc6c7-7486-4f6b-bc1c-ba5f3664d346", "label": "Ergonomie Numérique", "definition": "L'ergonomie numérique est une discipline qui vise à optimiser l'expérience utilisateur sur les interfaces numériques, notamment sur les appareils mobiles et les sites web. Elle se concentre sur la création d'interfaces intuitives et agréables, facilitant la navigation tout en répondant aux attentes des utilisateurs. L'ergonomie mobile prend en compte la conception spécifique pour les appareils portables, influençant également le classement dans les résultats de recherche Google. En somme, l'ergonomie numérique englobe tous les aspects de la qualité d'interface qui assurent une expérience utilisateur fluide et satisfaisante.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13707, 13710], "aliases": ["92024af3-eda4-4a37-98fb-fe2c19bb10b3", "31986d9e-30f7-4e45-827d-d4017b578758", "dac2c993-0388-4d64-846f-02e56618d8c0"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'ergonomie numérique est très pertinente car elle vise à optimiser l'expérience utilisateur, ce qui est essentiel lors de la conception d'une signalétique efficace et intuitive."}, {"concept": {"id": "bbec4b6c-ecb2-4980-a828-4ea2e6a15f47", "label": "Cohérence", "definition": "Uniformité dans le design et les interactions au sein d'une interface ou d'une application, favorisant une meilleure compréhension et garantissant une expérience fluide pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["df6e29c5-d22e-4955-90b8-9e1627d2e164"], "wikientity": null, "wordnetentity": {"label": "Cohérence", "definition": "a harmonious uniformity or agreement among things or parts", "name": "consistency.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La cohérence dans le design aide à maintenir une expérience utilisateur fluide lors de l'interaction avec une signalétique, rendant son utilisation plus intuitive."}, {"concept": {"id": "a2ed3777-a1b4-47a1-8983-706adaa17b4e", "label": "critère 11.9", "definition": "Exigence d'accessibilité demandant que les intitulés des boutons soient pertinents et informatifs pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le critère 11.9 est très pertinent car il concerne l'accessibilité des éléments de navigation, ce qui est essentiel dans la conception de signalétique pour s'assurer que les utilisateurs comprennent et peuvent interagir avec les informations présentées."}, {"concept": {"id": "aebca6b2-bc8c-4b19-89ce-ec44144d2ae7", "label": "Légende", "definition": "Texte descriptif associé à un groupe de champs, fournissant un contexte ou une instruction sur leur utilisation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": {"label": "Légende", "definition": "brief description accompanying an illustration", "name": "caption.n.03", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La légende est essentielle pour fournir un contexte et des instructions sur l'utilisation d'une signalétique, ce qui en fait un élément central dans la conception de dessins techniques ou de cartes."}, {"concept": {"id": "9063ef01-8369-4bd6-89af-11353700ccf4", "label": "image porteuse d'information", "definition": "Image essentielle à la compréhension du contenu, fournissant des informations critiques et souvent liée à des liens ou boutons.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'image porteuse d'information est essentielle pour transmettre des informations visuelles dans une signalétique, ce qui en fait un concept très pertinent."}, {"concept": {"id": "7fcc9498-9b97-4289-a01d-189889aa59c3", "label": "Couleur comme information", "definition": "Principe selon lequel l'information ne doit pas être transmise uniquement par la couleur ou l'utilisation de couleurs, afin d'assurer l'accessibilité pour tous les utilisateurs et éviter toute confusion pour ceux qui peuvent avoir des difficultés à percevoir les couleurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["1cccf89a-d717-4d5a-8956-63d3432cb9ee"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le principe de couleur comme information est important pour concevoir une signalétique efficace et accessible, car il aide à éviter les confusions liées à l'utilisation exclusive des couleurs."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "<svg> permet d'intégrer des graphiques vectoriels scalables qui peuvent être utilisés dans le cadre d'une signalétique numérique tout en prenant en compte l'accessibilité."}, {"concept": {"id": "826ac735-9873-4b63-a658-7a9022f13f23", "label": "Organisation de page", "definition": "Structure et agencement des éléments d'une page web pour optimiser la navigation et l'expérience utilisateur, en tenant compte de la hiérarchie visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'organisation de page est cruciale pour optimiser la navigation et l'expérience utilisateur; cela s'applique également à la manière dont une signalétique doit être conçue pour être claire et efficace."}, {"concept": {"id": "15a62b20-f459-4e2c-878e-41b378dc3104", "label": "accessibilité", "definition": "La capacité d'un produit ou service, y compris un contenu numérique ou un site web, à être utilisé par toutes les personnes, y compris celles ayant des handicaps. Cela garantit une expérience utilisateur équitable et un accès sans obstacles. Cette accessibilité est souvent régie par des normes telles que les WCAG (Web Content Accessibility Guidelines) et vise à permettre à tous les utilisateurs d'accéder et d'utiliser efficacement le produit ou service.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["241cedb6-cb9a-4f39-95a9-e1b69a5e7b17", "d7f76f3d-fd59-43ba-b939-dd62f6e24ead", "596cb4be-07d8-4022-9374-7314cd48d3a3", "26cd60d9-65ae-45b6-b8cf-453f1f3e44c9", "bdbd4abf-cce9-4489-aa53-43baeaf0e186", "b1ff1e7f-1081-47d9-8179-3eba55f6d47a"], "wikientity": {"label": "Accessibilité aux personnes handicapées", "definition": "L'accessibilité aux personnes handicapées est la possibilité pour les personnes handicapées d'accéder à un lieu physique ou à des informations.\nOn entend généralement par accessibilité l'ensemble des possibilités économiques, matérielles, instrumentales, culturelles ou sociales mises à la disposition d'une personne handicapée.\nEn France, depuis 2006, les pouvoirs publics ont donné une définition à l'accessibilité :\n\n« L’accessibilité permet l’autonomie et la participation des personnes ayant un handicap, en réduisant, voire supprimant, les discordances entre les capacités, les besoins et les souhaits d’une part, et les différentes composantes physiques, organisationnelles et culturelles de leur environnement d’autre part.", "page_id": "436310", "wikidata_id": "Q2822688", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "accessibilité", "definition": "the quality of being at hand when needed", "name": "handiness.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "L'accessibilité est cruciale dans la conception de signalétiques, car elle garantit que toutes les personnes, y compris celles ayant des handicaps, peuvent comprendre et utiliser les informations présentées."}, {"concept": {"id": "35731d03-1f0f-45f7-9e26-a44b29a90f40", "label": "Légende d'image", "definition": "Texte associé à une image, fournissant des informations complémentaires ou contextuelles, essentiel pour l'accessibilité et la compréhension visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La légende d'image est essentielle pour fournir un contexte visuel dans les dessins techniques, ce qui en fait un concept pertinent pour la signalétique."}, {"concept": {"id": "177152a3-de8d-477c-8620-09091c578791", "label": "Technique(s) suffisante(s) WCAG 2.1", "definition": "Méthodes validées par les WCAG permettant de satisfaire aux critères d'accessibilité établis.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les techniques WCAG sont cruciales pour garantir l'accessibilité des documents visuels, ce qui est très pertinent lors de la conception d'une signalétique."}, {"concept": {"id": "09354d25-aac4-46ee-94a5-a74c876a16ae", "label": "Cohérence des étiquettes", "definition": "Principe selon lequel les étiquettes répétées pour des champs similaires doivent rester uniformes sur une même page ou entre plusieurs pages.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Cohérence des étiquettes' est très pertinent car elle touche à l'uniformité et à la clarté nécessaires dans la signalétique pour assurer une bonne compréhension par les utilisateurs."}, {"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'esthétique joue un rôle crucial dans la conception de signalisations, car elle influence l'attrait visuel et l'engagement des utilisateurs avec les informations présentées."}, {"concept": {"id": "af063a7b-697c-4698-a3f9-571b25d446e7", "label": "Ergonomie web", "definition": "Discipline visant à adapter, concevoir et optimiser les interfaces web et utilisateur afin de garantir une utilisation facile, intuitive et confortable, favorisant ainsi la satisfaction des utilisateurs tout en tenant compte des lois psychologiques comme celles de Miller et Fitts, et améliorant l'expérience utilisateur sur les sites internet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707], "aliases": ["a22c9961-6357-4e30-8ce8-913123f918ec", "124581b4-e0cd-46eb-affc-0e2e0d426e33"], "wikientity": {"label": "Ergonomie des interfaces informatiques", "definition": "L'ergonomie informatique (ou ergonomie des interfaces) est une branche de l'ergonomie, qui a pour objectif d'améliorer les interactions homme-machine, la facilité d’utilisation et d’apprentissage des produits interactifs. Cette pratique cherche à concevoir ou modifier des interfaces afin qu'elles soient en adéquation avec les caractéristiques physiologiques, perceptives et cognitives de leurs utilisateurs potentiels. Elle s'appuie sur différentes  méthodes de conception et d’évaluation permettant d’obtenir le logiciel ou le site web le mieux adapté aux utilisateurs visés.", "page_id": "4962192", "wikidata_id": "Q1642623", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'ergonomie web est importante pour concevoir des interfaces accessibles et intuitives. Bien que cela soit plus axé sur le numérique, les principes d'ergonomie peuvent également s'appliquer à la signalétique physique."}, {"concept": {"id": "784d7e55-3719-435a-86eb-e3028d2e8919", "label": "Wireframing", "definition": "Le wireframing est une technique de conception préliminaire qui consiste à créer des maquettes schématiques détaillées, appelées wireframes, pour visualiser et clarifier la structure d'une interface utilisateur. Ces représentations simplifiées illustrent l'organisation des éléments fonctionnels sans se concentrer sur le design graphique final, mettant en évidence les composants visuels et fonctionnels essentiels. Le wireframing facilite ainsi la communication entre les acteurs d'un projet et sert de base pour le développement ultérieur de l'interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13701, 13670], "aliases": ["8607c39a-55b1-40f8-8b39-ee886df7f5c4", "921d5cb0-7bcf-489d-a50d-b4d68fd9021b", "5f1c6c26-18d5-449d-b645-6a543026b932", "47d3e47c-d891-43b9-a34c-fbf9a0688c2f", "41e39ed6-99a3-48ec-9920-20d04624e85a"], "wikientity": {"label": "Wireframe (design)", "definition": "Le wireframe ou maquette fonctionnelle est un schéma utilisé lors de la conception d'une interface utilisateur pour définir les zones et composants qu'elle doit contenir. À partir d'un wireframe peut être réalisée l'interface proprement dite par un graphiste. La démarche de recourir à des wireframes s'inscrit dans une recherche d'ergonomie.", "page_id": "4035421", "wikidata_id": "Q3045202", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le wireframing est pertinent car il s'agit d'une étape préliminaire dans la conception de signalétiques, permettant de visualiser la structure et l'organisation des éléments avant leur réalisation finale."}, {"concept": {"id": "74b9d860-1aad-4827-9be7-88dbfc257c7b", "label": "critère 11.8", "definition": "Norme d'accessibilité stipulant que chaque groupe d'options doit avoir un attribut label pertinent pour garantir la clarté.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le critère d'accessibilité est important pour garantir que la signalétique soit claire et compréhensible pour tous les utilisateurs, ce qui est crucial dans un contexte de conception."}, {"concept": {"id": "d29a67c0-9518-47da-bcd6-3eb36bf02e1a", "label": "Navigation cohérente", "definition": "Principe d'accessibilité web garantissant que les éléments de navigation restent identiques en position et ordre sur toutes les pages, facilitant l'orientation des utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La navigation cohérente est importante pour l'orientation des utilisateurs, ce qui peut être pertinent dans le contexte d'une signalétique bien conçue."}, {"concept": {"id": "77e5ae9a-6d43-443b-8de9-fe1cbea5f1b4", "label": "Intitulé visible", "definition": "Texte affiché sur un bouton ou un lien, servant d'étiquette pour un champ de formulaire, essentiel pour l'accessibilité et la navigation utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'intitulé visible est crucial pour l'accessibilité et la compréhension des éléments interactifs, ce qui est important dans le cadre d'une signalétique claire et informative."}, {"concept": {"id": "90b4729d-efda-4da6-b320-d6888f6aa71a", "label": "Norme de référence", "definition": "Cadre légal et technique définissant les exigences minimales que doivent respecter les services publics en matière d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La norme de référence est importante pour garantir que la signalétique respecte les exigences d'accessibilité, ce qui est crucial dans le contexte de la création de plans ou cartes."}, {"concept": {"id": "14c0dfc4-ae59-4351-b9d4-991278432fb8", "label": "Contenu alternatif", "definition": "Information présentée différemment mais équivalente à un autre contenu, respectant les critères d'accessibilité du RGAA.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Contenus alternatifs", "definition": "Un contenu alternatif est un programme diffusé au cinéma mais qui n’est pas un film. Il peut s’agir d’un ballet, d’un opéra, d’un concert, d’un match sportif, de gaming, d’une émission de télévision… Le contenu alternatif peut aussi bien être retransmis en direct qu’en différé. L’arrivée du numérique a beaucoup contribué au développement des contenus alternatifs.", "page_id": "6415654", "wikidata_id": "Q2995542", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le contenu alternatif est pertinent car il assure que toutes les informations sont accessibles sous différentes formes, ce qui est essentiel lors de la conception de signalétiques inclusives."}, {"concept": {"id": "7843365f-32d0-4ace-98d4-f900474fa71e", "label": "UI Designer", "definition": "Designer d'interface utilisateur responsable de l'apparence visuelle et de l'interactivité d'un produit numérique, complémentaire au travail de l'UX designer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un UI Designer joue un rôle clé dans la création d'interfaces visuelles, ce qui peut inclure la conception de signalétiques numériques, bien que cela ne soit pas directement lié aux dessins techniques."}, {"concept": {"id": "1d12b37a-39b8-4cdb-a08f-40ddbca22d1c", "label": "Plan d'action annuel", "definition": "Document détaillant les mesures spécifiques à mettre en œuvre chaque année pour améliorer l'accessibilité numérique au sein d'une entité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un plan d'action annuel pour améliorer l'accessibilité numérique peut inclure des éléments liés à la conception de signalétiques accessibles, bien qu'il soit plus général."}, {"concept": {"id": "8d90b1e8-9214-40c0-8ea2-d694bbdc1f06", "label": "WCAG (Web Content Accessibility Guidelines)", "definition": "Les Web Content Accessibility Guidelines (WCAG) sont des recommandations internationales établies par le W3C pour améliorer l'accessibilité du contenu web aux personnes handicapées. Ces directives, notamment WCAG 2.0 et 2.1, fournissent des normes précises et des critères techniques visant à garantir que les sites web soient utilisables par tous, y compris les personnes ayant des limitations visuelles, auditives ou motrices. Les WCAG abordent divers aspects de l'accessibilité, tels que le texte alternatif, la navigation, la structure du contenu, le contraste et les médias, ainsi que des critères spécifiques comme les étiquettes de formulaire. L'objectif est d'assurer une expérience utilisateur équitable et inclusive sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13707, 13708, 13710], "aliases": ["dceb0408-1c1d-4ad9-83ba-62aca3073998", "af7e08b6-e6fe-4968-b6ef-2f81b18f8561", "38d2a4c0-32c9-4903-8d36-cc51b3b381d3", "fdfa8bab-970c-4b08-b15b-2f11574e3904", "9351a93a-918a-45a7-8e11-66403b254438", "86e20d40-7304-4a51-9fea-ce16236922ae", "5c7ac2f9-fb21-41f7-be37-9f7efcf2b8f4", "e826fa27-fad7-4032-9d2c-081161b42f2c", "81a04174-f57e-4c09-8bb1-c4723b364d39", "383540f8-1e4c-4a63-9e58-13942911aa00", "d1870c3b-7e0a-4e42-b28a-b26f4ecf89d1", "a9875d19-6de2-4e6b-b142-5727c16e5395", "a5cac6da-9512-4375-a50f-3e676a3cef72", "612d828f-d279-415d-9fb0-660d624b7126", "8dc523d9-7aa3-4e7e-ae02-9a9dd8a7d88e", "58fb5136-3031-4f0c-9e26-14389d70cfb4", "6ddfd490-85a9-464f-bf75-6e1310c2880c", "fe72be57-e5ba-4a3d-921a-70ea338c35e2", "74b9f07f-a45f-406b-a3b4-2ec3ab0a2a7f", "460fdeb0-899f-447f-981b-c5a7f3802dea", "d96bf9d0-518b-4408-89c6-968266580fec", "b6c407f3-b031-4351-9603-c9a46f019d45", "7b2dc7a4-aacf-4e29-a8f1-816429bbd23b", "969b6ad1-c9d0-485d-aa69-60d291b04801", "c7071fe7-69ff-4dd4-9888-8b84c8c45a2f", "17a7a4c1-b49b-4ae9-a3b7-0f64d47d2005", "e662fbd3-546d-4479-88c3-8c885c5b476c", "d2d330e4-b74a-48d8-9b9a-934efe5c0bf1", "21ab5c3a-69d7-4015-ad96-a6a5427ce37f", "40393381-ae7e-4897-8d88-acdf7bb72733", "d3d0be5b-f36e-4359-a741-bde28874143e", "fba7c1ef-1025-47a1-8934-0da7f2f5a11c", "0356959e-b460-4b0d-ba2a-8a5eb27d7284", "69ea8b6b-f00d-4c22-a0fe-efd62940c05e", "d184d33b-2948-4cf6-afcc-7eb9a8e46ce6", "f235bc29-d9aa-4635-b873-96967ce54fdb", "88742b40-ec3b-4f2e-b412-891fc76ed9ad", "f1213999-0c17-4bb1-a929-4803442c4539", "49e0d661-d21f-4e6b-bd0c-cc5afb2190bf", "239c0474-77a0-4274-a604-1a29094d2a06", "045b0545-1eeb-4d15-b1ef-b4232ccefbd6", "c01bafcd-745a-47e9-b2f1-596bfd04b1c6", "58e002ff-ef37-4632-a35e-6d686a50474e"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les WCAG sont essentielles pour garantir que tout contenu (y compris les signalisations) soit accessible aux personnes handicapées, rendant leur application très pertinente dans le contexte donné."}, {"concept": {"id": "07d8379e-8120-4106-af4d-a32c61880a80", "label": "Liste structurée", "definition": "Une collection d'éléments organisés selon une hiérarchie ou une séquence, facilitant la navigation et la compréhension dans les documents HTML.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Une liste structurée peut aider à organiser les informations sur une signalétique, facilitant ainsi leur compréhension et leur navigation."}, {"concept": {"id": "ff356c21-a6a9-4643-9b85-5ea63c1962d7", "label": "Composants d'Interface Utilisateur", "definition": "Les composants d'interface utilisateur sont des unités graphiques indépendantes et réutilisables, telles que des boutons, des liens ou des cartes, qui encapsulent la logique et le rendu d'une partie de l'interface. Ils permettent aux utilisateurs d'interagir avec le contenu et les fonctionnalités sur une page web. Dans des outils comme Figma, ces éléments aident les designers à maintenir une cohérence visuelle tout en facilitant les mises à jour, s'assemblant pour former des structures plus complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13668, 13708], "aliases": ["aa4065a5-c93e-4843-8784-987b3fb4a95b", "a52293d6-e08a-4666-9aa0-34c8daaf1426", "c177b8d1-7c43-4e1e-8b3d-ae5c9e7b3057"], "wikientity": {"label": "Composant logiciel", "definition": "En architecture logicielle, un composant logiciel est un élément constitutif d'un logiciel destiné à être incorporé en tant que pièce détachée dans des applications. Les paquets, les bibliothèques logicielles, les exécutables, les fichiers, les bases de données ou encore des éléments de configuration (paramètres, scripts, fichiers de commandes) sont des composants logiciels. \nLes composants logiciels sont développés par des professionnels de l'informatique en vue d'être réutilisés dans leurs propres logiciels, ou en vue d'être mis sur le marché et incorporés dans des logiciels tiers.", "page_id": "1824031", "wikidata_id": "Q17176533", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Composants d'Interface Utilisateur' sont importants pour créer une interface cohérente et fonctionnelle qui pourrait être appliquée dans un logiciel utilisé pour concevoir des signalisations."}, {"concept": {"id": "8d20d835-630d-4c6b-8a00-86480b18dc06", "label": "Conception pour les pouces", "definition": "Approche de design axée sur l'accessibilité des éléments d'interface pour une utilisation à une main, particulièrement pertinente pour les appareils mobiles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La conception pour les pouces est pertinente car elle aborde l'accessibilité et l'ergonomie, aspects importants lors de la création d'une signalétique efficace sur appareils mobiles."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le format vectoriel est très pertinent car il permet une création précise et redimensionnable d'images, ce qui est essentiel dans le dessin technique et la conception graphique pour des signalisations."}, {"concept": {"id": "d90c15d6-a890-40ff-9021-d9e24563d56a", "label": "Contexte d'utilisation", "definition": "Ensemble des conditions dans lesquelles un produit est utilisé, influençant son ergonomie et son efficacité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Utilisabilité", "definition": "L’utilisabilité, ou encore aptitude à l'utilisation est définie par la norme ISO 9241-11 comme « le degré selon lequel un produit peut être utilisé, par des utilisateurs identifiés, pour atteindre des buts définis avec efficacité, efficience et satisfaction, dans un contexte d’utilisation spécifié ».\nC'est une notion proche de celle d'affordance, ou même d’ergonomie qui est cependant plus large.\nLes critères de l’utilisabilité sont :\n\nl’efficacité : le produit permet à ses utilisateurs d’atteindre le résultat prévu.", "page_id": "142385", "wikidata_id": "Q216378", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le contexte d'utilisation est pertinent car il influence la manière dont une signalétique doit être conçue pour être efficace et ergonomique dans son environnement."}, {"concept": {"id": "21922d9a-d238-42c7-ba72-ba49bca4f04b", "label": "Lien dont la nature n'est pas évidente", "definition": "Lien pouvant être confondu avec du texte normal si signalé uniquement par couleur, posant problème aux utilisateurs malvoyants.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Ce concept aborde un aspect important de l'accessibilité dans la signalétique, en soulignant les problèmes potentiels pour les utilisateurs malvoyants. Cela a une pertinence significative pour s'assurer que les éléments d'une carte ou d'un plan sont clairement identifiables."}], "exercises": [{"exercise": {"id": "ed54c2f40bd14820b101299c86b3975f", "statement": "Un lien signalé uniquement par la couleur peut être ignoré par certains utilisateurs, surtout s'ils ne distinguent pas bien les couleurs.", "veracity": true, "feedback": "Il est exact que si un lien n'est signalé que par la couleur, les utilisateurs ayant une difficulté à percevoir les couleurs peuvent ne pas l'identifier, surtout en l'absence d'autres marqueurs visuels comme un soulignement ou une icône.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité et la lisibilité des informations. En soulignant que les liens signalés uniquement par la couleur peuvent être ignorés par certains utilisateurs, il met en lumière l'importance d'utiliser plusieurs éléments graphiques pour garantir une communication efficace et inclusive. L'explication fournie renforce cette idée en mentionnant l'importance d'autres marqueurs visuels, ce qui est en adéquation avec les principes abordés dans la synthèse. Cependant, un léger manque de diversité dans les types de questions pourrait empêcher une évaluation complète des compétences liées à tous les aspects du design de signalétique."}, {"exercise": {"id": "8e0704032c5145a4b8a08d720994221a", "question": "Quel attribut contient l'alternative textuelle pour une image accompagnée d'une description détaillée?", "answers": ["L'attribut WAI-ARIA aria-label"], "distractors": ["L'attribut img-label-description", "L'attribut data-accessibility-text", "Un élément de balise desc", "L'attribut caption-alt", "L'attribut alt-describe", "Une balise HTML aria-img-desc", "Un identifiant aria-text-support", "Une classe CSS dédié à l'accessibilité", "Un élément de légende"], "feedback": "Dans cette situation, l'attribut WAI-ARIA aria-label permet de fournir une alternative textuelle pour l'image accompagnée d'une référence à une description détaillée adjacente. Cela permet aux personnes en situation de handicap d'accéder à l'information présente dans l'image.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité de l'information par le biais d'attributs alternatifs pour les contenus visuels. La question porte spécifiquement sur l'utilisation des attributs WAI-ARIA, ce qui est pertinent dans le contexte de garantir que les informations soient compréhensibles pour tous, y compris les personnes en situation de handicap. Cependant, bien que cela soit un élément important, l'exercice ne couvre pas entièrement d'autres aspects mentionnés dans la synthèse, tels que l'ergonomie ou le contraste visuel. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "43ed5db4b45b4c63965cd7cf6749ea3c", "statement": "L'attribut WAI-ARIA aria-label contient à la fois l'alternative textuelle et une référence à une description détaillée adjacente.", "veracity": false, "feedback": "L'attribut WAI-ARIA aria-label ne contient que l'alternative textuelle. La référence à une description détaillée est mentionnée séparément, mais ne fait pas partie de l'attribut aria-label lui-même.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des attributs WAI-ARIA, qui sont essentiels pour garantir l'accessibilité de la signalétique numérique. Bien que l'exercice ne traite pas directement de la conception graphique ou des éléments visuels mentionnés dans la référence, il aborde un aspect crucial de l'accessibilité, qui est fondamental pour une signalétique efficace. La question teste la connaissance d'un détail technique important qui contribue à rendre les informations compréhensibles pour tous les utilisateurs, ce qui est en ligne avec les objectifs d'apprentissage liés à la conception d'une signalétique accessible. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments directement liés à la création graphique ou au design ergonomique."}, {"exercise": {"id": "b3e57401533842d0be619dce4af41dfc", "statement": "La condition de test doit garantir que la restitution est pertinente pour l'accessibilité.", "veracity": true, "feedback": "Effectivement, la restitution doit être évaluée quant à sa pertinence pour une accessibilité correcte, assurant ainsi que l'élément ou le dispositif est compatible avec les standards d'accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité. La question sur la pertinence de la restitution pour l'accessibilité est directement liée aux principes abordés dans la synthèse, notamment l'importance d'assurer que le contenu soit compréhensible pour tous les utilisateurs, y compris ceux en situation de handicap. Cependant, bien que cela soit pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres aspects du design graphique et ergonomique qui sont également cruciaux dans la conception de signalétique."}, {"exercise": {"id": "a98a45abc7014c27850699d06e697a15", "question": "Quel critère doit respecter le plan du site pour assurer la navigation utilisateur?", "answers": ["Permettre d'accéder à toutes les pages du site"], "distractors": ["Contenir tous les liens externes du site", "Inclure un lien vers la page d'accueil", "Être visible sur chaque page du site", "Répertorier uniquement les pages principales", "Empêcher l'accès aux sections protégées", "Cacher les pages de contenu secondaire", "Proposer une navigation en mode hors ligne", "Ne référencer que les pages populaires", "Lister toutes les images présentes sur le site"], "feedback": "Le critère à respecter pour assurer la navigation utilisateur est de permettre d'accéder à toutes les pages du site. Le plan du site doit donc fournir un moyen pour l'utilisateur de naviguer vers toutes les pages du site, sans en exclure aucune. Tous les distracteurs proposent des critères qui ne garantissent pas une navigation complète pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9eebbd66191f47bdb5446f8a1a7640c6", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Note 2 : il n'est pas nécessaire que le plan du site contienne les liens vers toutes les pages du site, en revanche il est nécessaire qu'à partir du plan du site, l'utilisateur puisse atteindre l'ensemble des pages du site. Note 2 : la valeur des attributs WAI-ARIA aria- labelledby ou aria-describedby ne doivent pas créer de référence récursive (A référence B qui référence A) ou traversante (A qui référence B qui référence C);", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c966566ada424caf8bb0704e44c038fa", "next_id": "1e1ad141a8b7419fb264514ef3eed4a9", "prev_id": "904c81eab0874eb49a216bbdec53ccb6", "associated_block_ids": [], "first_page": 116, "last_page": 116, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'ergonomie et la navigation intuitive. La question porte sur un critère essentiel pour assurer une bonne expérience utilisateur, ce qui est en ligne avec les objectifs d'apprentissage mentionnés dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à la clarté visuelle ou à l'accessibilité, qui sont également cruciaux dans le contexte de la signalétique. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'une signalétique, notamment en ce qui concerne la visibilité et l'accessibilité des informations. L'affirmation met en avant l'importance de rendre les fonctions essentielles d'une interface plus visibles, ce qui est directement lié à l'ergonomie et à la lisibilité mentionnées dans la synthèse. De plus, l'explication fait référence à la loi de Fitts, qui est pertinente pour optimiser l'interaction utilisateur. Cependant, bien que cela touche des aspects importants du design de signalétique, l'exercice pourrait être amélioré en intégrant davantage d'éléments spécifiques liés aux icônes ou à la typographie pour une évaluation encore plus complète."}, {"exercise": {"id": "2f426f30fa264f6f94c2b738c0c0a2e0", "question": "Quels textes sont concernés par la mesure de contraste selon les directives ?", "answers": ["Le texte, le texte en image et les sous-titres des vidéos"], "distractors": ["Les icônes et illustrations graphiques", "Le texte dans les arrière-plans d'images", "Les bordures et décorations CSS", "Les zones blanches dans une page web", "Les logos dans les animations", "Les liens hypertextes externes", "Les titres des documents PDF", "Les boutons et menus déroulants", "Les annotations dans les diagrammes"], "feedback": "Les directives de contraste s'appliquent au texte principal ainsi qu'aux textes incrustés dans les images et animations (comme les sous-titres). Ces textes doivent être suffisamment contrastés pour être lisibles, même pour les personnes ayant une déficience visuelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f2b15e9b2aef439686cbd8a9e3eaf4ca", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Note : la pratique qui consiste à gérer des images en propriété de fond d'éléments via CSS est formellement déconseillée, même si elle est accompagnée d'un texte caché. Note : la mesure de contraste concerne le texte, le texte en image, le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos. Pour le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos, la taille de la police doit être mesurée par rapport à la taille d'affichage par défaut (telle qu'affichée). Les textes présents dans les éléments d'une image ou d'une vidéo (par exemple un écriteau, une affiche etc.) ne sont pas concernés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1ab34767803b452ab46a6755582f7b5e", "next_id": "3767e8e96bdf494f8cd8e6b538967a95", "prev_id": "f3447a85d2f14376bd33f7dc7d7e8923", "associated_block_ids": [], "first_page": 94, "last_page": 96, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des directives de contraste, qui est un aspect essentiel de la conception graphique d'une signalétique. En se concentrant sur les textes concernés par ces mesures, l'exercice teste la connaissance des éléments qui influencent la lisibilité et l'accessibilité de l'information, conformément aux principes abordés dans la synthèse. Cependant, il pourrait être amélioré en incluant des questions sur d'autres éléments graphiques ou ergonomiques mentionnés dans le contexte de la signalétique pour une évaluation plus complète."}, {"exercise": {"id": "f1f4e80cb280417598d14efa8b949f6e", "question": "Quelle est la longueur maximale recommandée pour une alternative textuelle accessible ?", "answers": ["80 caractères au maximum sont fortement recommandés"], "distractors": ["100 caractères au maximum sont fortement recommandés", "120 caractères au maximum sont fortement recommandés", "40 caractères au maximum sont fortement recommandés", "70 caractères au maximum sont fortement recommandés", "90 caractères au maximum sont fortement recommandés", "50 caractères au maximum sont fortement recommandés", "130 caractères au maximum sont fortement recommandés", "110 caractères au maximum sont fortement recommandés", "60 caractères au maximum sont fortement recommandés"], "feedback": "Une longueur maximale de 80 caractères est fortement recommandée pour que les utilisateurs de plages braille ou de loupes d'écran puissent lire l'alternative sans avoir à effectuer plusieurs manipulations. Cela garantit une meilleure accessibilité pour ces utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité des informations visuelles par le biais d'alternatives textuelles. La question sur la longueur maximale recommandée pour une alternative textuelle est pertinente car elle touche directement aux principes d'accessibilité mentionnés dans la synthèse. Cependant, bien que cela soit un élément important, l'exercice pourrait être amélioré en incluant des questions sur d'autres aspects du design de signalétique, comme l'ergonomie ou le contraste visuel. Cela justifie une note élevée mais pas parfaite."}, {"exercise": {"id": "48bcec0fe85e486b997ca81cb67263c1", "query": "Pour faciliter l'accessibilité, la longueur maximale recommandée pour une alternative textuelle est de <blank>.", "answers": ["80 caractères"], "distractors": [["50 caractères", "100 caractères", "120 caractères", "60 caractères", "70 caractères", "90 caractères"]], "feedback": "La longueur maximale de 80 caractères est recommandée car elle permet de limiter les manipulations pour les utilisateurs de technologies d'assistance telles que des plages braille ou des loupes d'écran. Un texte plus long pourrait compliquer la lecture pour ces outils.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité des informations visuelles. En demandant aux apprenants de connaître la longueur maximale recommandée pour une alternative textuelle, il teste leur connaissance des normes d'accessibilité qui sont essentielles dans le design graphique. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à d'autres aspects du design de signalétique mentionnés dans la synthèse, comme l'ergonomie ou le contraste visuel."}, {"exercise": {"id": "616b5d2ed72e4a31ba53f684e25b1e18", "statement": "Une alternative textuelle doit impérativement contenir moins de 80 caractères pour être accessible.", "veracity": false, "feedback": "Il est recommandé que l'alternative textuelle ne dépasse pas 80 caractères pour limiter les manipulations des utilisateurs de technologies d'assistance, mais ce n'est pas une obligation stricte. Le nombre maximal de 80 caractères est une bonne pratique conseillée, non une règle absolue.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'accessibilité dans la conception de signalétique, un aspect clé de la référence. Il aborde spécifiquement l'importance des alternatives textuelles pour les utilisateurs de technologies d'assistance, ce qui est en ligne avec l'objectif pédagogique de garantir une communication visuelle efficace et inclusive. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres aspects du design graphique ou ergonomique mentionnés dans la synthèse."}, {"exercise": {"id": "6959a0ee488345c7b82f166b7c72587f", "statement": "Les technologies comme les plages braille et les loupes d'écran peuvent faciliter la lecture des alternatives textuelles.", "veracity": true, "feedback": "Il est mentionné que les technologies d'assistance telles que les plages braille et les loupes d’écran permettent aux utilisateurs d’accéder aux alternatives textuelles. Ces outils aident notamment dans la restitution de texte destiné à ceux ayant des limitations visuelles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité dans la conception de signalétique, un aspect clé mentionné dans la référence. En posant une question sur les technologies d'assistance et leur rôle dans l'accès à l'information, il teste la connaissance des apprenants sur les moyens d'assurer que le contenu soit compréhensible pour tous, y compris les personnes en situation de handicap. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à la conception graphique ou ergonomique de la signalétique elle-même."}, {"exercise": {"id": "e7506aae28b3446ea38572551f9f70c5", "question": "Quand un composant d'interface est-il accessible au clavier et au dispositif de pointage ?", "answers": ["Lorsque le focus peut être pris par un pointeur ou tabulation"], "distractors": ["Lorsque le composant change de couleur en interaction", "Si le double-clic ajoute un raccourci clavier", "Si l'utilisateur peut utiliser un seul périphérique pour interagir", "Dès qu'il est conçu avec un script dynamique intégré", "Lorsque la navigation est restreinte au mode tactile", "Lorsqu'il répond au toucher et à la voix simultanément", "Si les informations sont uniquement visibles après défilement", "Au moment du lancement manuel d'un script d'accessibilité", "Lorsque le dispositif de pointage est exclusif à l'événement"], "feedback": "La bonne réponse indique que le composant d'interface doit être accessible à la fois au clavier et au dispositif de pointage, en offrant la possibilité à l'utilisateur de prendre le focus par un pointeur ou la touche tabulation. Cela garantit une accessibilité pour les utilisateurs ayant des limitations physiques différentes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "87b33737243340c795246a47bf6fb002", "order": 14.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particulier lorsque la fonctionnalité nécessite que le comportement attendu soit réalisé lors d'un événement descendant, par exemple, un émulateur de clavier dont les touches doivent s'activer à la pression comme sur un clavier physique. Dans ces situations, le critère est non applicable. · Un composant d'interface (lien, bouton, ... ) est accessible au clavier et par tout dispositif de pointage lorsque l'utilisateur peut prendre, indifféremment, le focus par un pointeur ou la touche tabulation.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "49faef6e06c24bfb90a077b52bee2b5e", "next_id": "519b8d83ef37420291ffd381c99a97fc", "prev_id": "e6bcb138677542dbb5175b82ad96ec29", "associated_block_ids": [], "first_page": 83, "last_page": 84, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité des composants d'interface, un aspect essentiel de la conception de signalétique mentionné dans la référence. En se concentrant sur l'accessibilité au clavier et au dispositif de pointage, il aborde directement les principes d'ergonomie et d'inclusivité qui sont cruciaux pour une signalétique efficace. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques à la conception graphique ou à l'utilisation des éléments visuels dans le contexte de la signalétique, ce qui lui aurait permis d'obtenir une note maximale."}, {"exercise": {"id": "98e4a74f235e4dc1a2c1d0fc6551ae85", "query": "Il est important que l'étiquette et son champ soient visuellement <blank>, afin d'éviter toute confusion sur leur relation.", "answers": ["proches"], "distractors": [["séparés", "indépendants", "dissociés", "distants", "espacés", "invisibles"]], "feedback": "L'étiquette doit être visuellement proche de son champ pour que l'utilisateur puisse facilement comprendre qu'ils sont liés. Si l'étiquette est trop distante ou dissociée de son champ, cela peut entraîner une confusion pour l'utilisateur sur la fonctionnalité associée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'importance de la proximité visuelle entre une étiquette et son champ. Cela fait directement référence à l'ergonomie et à la lisibilité, qui sont des éléments essentiels mentionnés dans la synthèse. En demandant aux apprenants de remplir un texte à trou avec le mot 'proches', l'exercice teste leur capacité à reconnaître comment une bonne conception graphique facilite l'interaction utilisateur. Cependant, il pourrait être amélioré en incluant d'autres concepts comme le contraste visuel ou l'accessibilité pour obtenir une note parfaite."}, {"exercise": {"id": "6ca4c7b0e56e4844b746c5c3333c8553", "statement": "L'étiquette et son champ doivent toujours être séparés visuellement pour éviter toute confusion.", "veracity": false, "feedback": "Au contraire, l'étiquette et son champ doivent être visuellement proches afin de créer une relation claire entre les deux et d'éviter la confusion. Une telle proximité permet aux utilisateurs de comprendre plus facilement quelle étiquette correspond à quel champ de saisie.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception graphique liés à la signalétique, en particulier l'importance de la proximité visuelle entre les éléments (étiquette et champ). Cela fait écho aux concepts d'ergonomie et de lisibilité mentionnés dans la synthèse. Cependant, il pourrait être amélioré en intégrant davantage d'aspects comme le contraste visuel ou l'accessibilité pour obtenir une note parfaite."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception graphique liés à la signalétique, en se concentrant sur l'importance de respecter les normes et d'éviter de brouiller les pistes pour l'utilisateur. Cela correspond bien aux éléments clés mentionnés dans la synthèse, tels que l'accessibilité, l'ergonomie et la lisibilité. Cependant, il pourrait être amélioré en incluant des questions plus variées qui couvrent également d'autres aspects comme le contraste visuel ou l'utilisation d'icônes. Néanmoins, il reste pertinent et utile pour tester la maîtrise des concepts essentiels liés à la conception de signalétique."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'importance de l'expérience utilisateur. Cette notion est centrale dans le contexte donné, qui souligne l'ergonomie et l'interaction entre les utilisateurs et leur environnement. Cependant, bien que la réponse correcte soit pertinente, elle pourrait être enrichie par des éléments supplémentaires tels que l'accessibilité ou le contraste visuel, qui sont également cruciaux pour une signalétique efficace. Les distracteurs proposés sont variés et permettent de tester la capacité de l'apprenant à distinguer les éléments pertinents du design graphique. Ainsi, bien que pertinent, l'exercice ne couvre pas tous les aspects essentiels mentionnés dans la synthèse."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur dans le design, ce qui est un aspect clé de la conception d'une signalétique efficace. La référence mentionne explicitement l'ergonomie et l'interaction entre les utilisateurs et leur environnement, ce qui inclut la nécessité d'une expérience utilisateur positive. Cependant, bien que pertinent, l'exercice ne couvre pas tous les éléments essentiels tels que la clarté visuelle, le contraste ou l'accessibilité des informations. Il se concentre principalement sur un seul aspect du design, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du terme 'design' dans le contexte de la signalétique, ce qui est pertinent par rapport à la référence qui traite de la conception graphique et de l'ergonomie. L'affirmation teste si l'apprenant peut distinguer entre la simple création visuelle et une approche plus holistique qui inclut l'organisation et l'expérience utilisateur. Cependant, il aurait pu être encore plus efficace s'il avait inclus des éléments supplémentaires sur les principes d'accessibilité ou d'ergonomie mentionnés dans la synthèse."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes de clarté et de cohérence dans la conception d'une signalétique, ce qui est un aspect clé mentionné dans la référence. L'affirmation souligne l'importance de ces normes pour éviter de perdre l'utilisateur, ce qui est en ligne avec les principes d'ergonomie et d'accessibilité abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques sur les aspects graphiques ou techniques du design de signalétique, tels que le contraste visuel ou l'utilisation d'icônes. Cela aurait permis une évaluation encore plus complète des compétences liées à la conception graphique."}, {"exercise": {"id": "9a099c489b864346b9811c59dacad8ce", "question": "Comment améliorer la navigation en renseignant la position de l'utilisateur ?", "answers": ["Utiliser un fil d'Ariane pour indiquer la localisation de l'internaute"], "distractors": ["Créer des raccourcis clavier personnalisés pour chaque page", "Ajouter un message popup à chaque étape", "Utiliser uniquement des icônes pour naviguer", "Insérer un message texte fixe sur chaque page", "Limiter la navigation à un seul niveau de profondeur", "Ajouter des numéros de page en haut de chaque section", "Utiliser une animation de défilement pour chaque changement de page", "Modifier la couleur du fond selon la section", "Intégrer des éléments visuels encombrants pour attirer l'attention"], "feedback": "Utiliser un fil d'Ariane pour indiquer la localisation de l'internaute permet à l'utilisateur de savoir où il se trouve dans la navigation et de revenir facilement en arrière s'il le souhaite. Cela facilite également la compréhension de la structure du site pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'ergonomie et la navigation intuitive. La question sur l'amélioration de la navigation en renseignant la position de l'utilisateur est pertinente car elle touche directement à l'accessibilité et à l'expérience utilisateur, qui sont des éléments essentiels dans le contexte donné. La réponse correcte, qui mentionne l'utilisation d'un fil d'Ariane, est appropriée et démontre une bonne compréhension des principes de navigation. Cependant, bien que cela soit pertinent, l'exercice pourrait être encore plus complet en intégrant d'autres aspects tels que le contraste visuel ou les normes d'accessibilité. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "e6abe4b7c1c049b39f395ba056388e95", "question": "Quelle stratégie est recommandée pour l'architecture de menu ?", "answers": ["Favoriser la largeur plutôt que la profondeur du menu"], "distractors": ["Rendre les menus aussi profonds que possible", "Utiliser une seule icône pour chaque menu", "Limiter le nombre d’options visibles à l’écran", "Toujours placer les options populaires en bas du menu", "Privilégier une navigation en profondeur, de multiple niveaux", "Utiliser au maximum des sous-catégories", "Créer des menus très textuels avec de nombreux détails sur chaque option", "Réduire la largeur du menu à un minimum", "Séparer les menus en plusieurs sections indépendantes"], "feedback": "Il est recommandé de favoriser une largeur plutôt qu'une profondeur importante dans l'architecture des menus pour faciliter la navigation. En proposant plus d'options visibles à l'écran, cela permet à l'utilisateur de trouver plus facilement ce qu'il cherche sans être perdu dans un menu trop profond.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de navigation intuitive dans le design de signalétique, qui sont des éléments clés mentionnés dans la référence. La question sur l'architecture du menu se rapporte directement à l'idée d'optimiser l'interaction utilisateur, en favorisant une structure de menu qui facilite la navigation. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'aspects liés à la conception graphique et à l'accessibilité visuelle pour obtenir une note parfaite."}, {"exercise": {"id": "8ac6c3f6b595481f886c30555728b99b", "statement": "Le fil d'Ariane aide à indiquer la position de l'utilisateur sur un site.", "veracity": true, "feedback": "Le fil d'Ariane est un élément de navigation qui informe l'utilisateur de son emplacement actuel dans le site, facilitant ainsi le repérage et la navigation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un élément clé de la signalétique numérique, à savoir le fil d'Ariane, qui est essentiel pour une navigation intuitive et ergonomique. Il teste la capacité de l'apprenant à reconnaître comment cet outil contribue à l'accessibilité et à la clarté de l'information sur un site. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des aspects supplémentaires liés aux éléments graphiques ou au contraste visuel mentionnés dans la synthèse. Cela aurait permis une évaluation plus complète des compétences liées à la conception de signalétique."}, {"exercise": {"id": "44a1cb1994f54733b945e6d994952d37", "question": "Quelle méthode garantit l'accessibilité des fonctionnalités par défaut ?", "answers": ["La touche de tabulation doit permettre d'accéder à chaque fonctionnalité"], "distractors": ["Les fonctionnalités doivent être accessibles uniquement par une commande vocale.", "Toutes les fonctionnalités doivent être activées automatiquement sans intervention.", "L'accès aux fonctionnalités ne peut se faire que via la souris.", "Les utilisateurs doivent installer un logiciel tiers pour accéder aux fonctions.", "Seuls les utilisateurs avancés peuvent personnaliser l'accessibilité.", "Il faut activer un mode spécial pour accéder aux fonctionnalités.", "L'accessibilité ne doit pas être priorisée pour les dispositifs mobiles.", "Les fonctionnalités n'ont pas besoin d'être accessibles sans support visuel.", "Un code d'accès est nécessaire pour chaque fonctionnalité."], "feedback": "La touche de tabulation est une méthode largement utilisée pour naviguer rapidement entre les différentes fonctionnalités d'un système informatique. En garantissant l'accès des fonctionnalités par cette touche, on assure une accessibilité intuitive et pratique pour tous les utilisateurs, indépendamment de leur dispositif de pointage ou de leurs capacités physiques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité des fonctionnalités. La question sur la méthode garantissant l'accessibilité par défaut est pertinente car elle touche directement aux principes d'ergonomie et d'inclusivité mentionnés dans la synthèse. Cependant, bien que cela soit un élément important, l'exercice pourrait être amélioré en intégrant des questions qui abordent également d'autres aspects tels que le contraste visuel ou les éléments graphiques. Néanmoins, il teste efficacement une compétence essentielle liée à l'objectif pédagogique."}, {"exercise": {"id": "86294924eb3743d7b318c1e40e49cd57", "statement": "L'attribut aria-labelledby est destiné uniquement aux images et ne peut pas être appliqué à d'autres types d'éléments dans une page web.", "veracity": false, "feedback": "L'attribut 'aria-labelledby' peut être appliqué à divers types d'éléments dans une page web, pas uniquement aux images. Il est utilisé pour améliorer l'accessibilité en reliant des éléments HTML à des descriptions textuelles indépendamment du type d'élément auquel il est associé.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité dans la conception graphique, un aspect clé de la référence sur la signalétique. En testant les connaissances sur l'attribut 'aria-labelledby', il aborde directement le besoin d'assurer que l'information soit accessible à tous, ce qui est fondamental dans le contexte de la signalétique. Cependant, bien que pertinent, l'exercice ne couvre pas explicitement d'autres éléments essentiels tels que le design visuel ou l'ergonomie, ce qui empêche une note parfaite. Néanmoins, il reste très pertinent par rapport aux objectifs d'apprentissage liés à la signalétique."}, {"exercise": {"id": "bf47f33226de4cdab9e487370d70123e", "statement": "L'attribut WAI-ARIA aria-labelledby permet d'associer un passage de texte alternatif et un autre passage pour une description détaillée.", "veracity": true, "feedback": "L'attribut 'aria-labelledby' est effectivement utilisé pour lier des passages de texte, où l'un sert d'alternative textuelle (comme une étiquette) et l'autre fournit une description plus détaillée. Cela aide à améliorer l'accessibilité pour les utilisateurs de technologies d'assistance en leur offrant plus d'informations contextuelles sur les éléments d'une interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'accessibilité dans la conception de signalétique, en se concentrant sur l'utilisation des attributs WAI-ARIA pour améliorer l'expérience utilisateur. Cela est pertinent par rapport à la référence qui souligne l'importance de rendre les informations accessibles et compréhensibles pour tous les utilisateurs, y compris ceux utilisant des technologies d'assistance. Cependant, bien que cela touche un élément essentiel de la signalétique, l'exercice pourrait être encore plus pertinent s'il incluait des éléments supplémentaires liés à la conception graphique ou ergonomique mentionnés dans la synthèse."}, {"exercise": {"id": "458dffabe57e43d784bad2274d28e806", "statement": "L'utilisateur doit pouvoir accéder à toutes les fonctionnalités par la touche tabulation ou par un dispositif de pointage.", "veracity": true, "feedback": "Toutes les fonctionnalités doivent être accessibles soit via le clavier (notamment avec la touche de tabulation), soit via un dispositif de pointage, garantissant ainsi l'accessibilité pour différents types d'utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'accessibilité dans la conception de signalétique, un aspect clé mentionné dans la référence. En demandant à l'apprenant de valider une affirmation sur l'accessibilité des fonctionnalités, il teste leur connaissance des normes ergonomiques et d'interaction utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires liés à la conception graphique ou à l'ergonomie visuelle pour obtenir une note maximale."}, {"exercise": {"id": "aa56f61857f44205a2ba7fef386130a4", "question": "Pourquoi faut-il lier une légende à son image par une relation de structure ?", "answers": ["Pour un traitement unifié par les technologies d'assistance"], "distractors": ["Pour faciliter le téléchargement de l'image", "Pour permettre l'impression de la légende seule", "Afin de rendre l'image plus rapide à charger", "Pour garantir que l'image soit centrée sur la page", "Pour éviter les erreurs dans le code CSS", "Pour accroître la visibilité du texte alternatif", "Pour réduire la taille du fichier HTML", "Pour assurer une mise en page responsive", "Pour améliorer le référencement dans les moteurs de recherche"], "feedback": "Lier la légende d'une image à l'image elle-même permet de traiter l'image et sa légende comme un ensemble unique, facilitant ainsi le traitement par les technologies d'assistance. Cela garantit également que l'image et sa légende soient présentées ensemble et évite tout risque de confusion pour les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité dans la conception graphique d'une signalétique, un aspect clé mentionné dans la référence. En demandant pourquoi il est essentiel de lier une légende à son image, il teste la connaissance des principes qui garantissent que le contenu soit compréhensible pour tous les utilisateurs, y compris ceux utilisant des technologies d'assistance. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des questions sur d'autres éléments essentiels tels que le contraste visuel ou l'ergonomie, ce qui lui aurait permis d'obtenir une note plus élevée."}, {"exercise": {"id": "7a9a0d8eaaca4a9eacdbd3f5cf15cd73", "query": "Lorsqu'une image est légendée, il est important d'associer la légende de l'image à l'image par une relation de <blank> afin que les technologies d'assistance puissent interpréter correctement cet ensemble.", "answers": ["structure"], "distractors": [["couleur", "signalisation", "marqueur", "contenu visuel", "connexion", "sémantique"]], "feedback": "Il est essentiel de relier une légende à son image par une relation de structure pour que les technologies d'assistance puissent traiter les deux comme un seul élément. Sans cette relation, ces technologies risquent de ne pas comprendre que la légende et l'image sont liées, ce qui pourrait rendre l'information inaccessible.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension d'un concept clé lié à l'accessibilité de l'information dans la conception de signalétique, en particulier l'importance de relier une légende à son image pour les technologies d'assistance. Cela correspond bien aux éléments abordés dans la synthèse, notamment sur l'accessibilité et la lisibilité des contenus visuels. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des aspects supplémentaires tels que le contraste visuel ou l'ergonomie dans le design. Néanmoins, il teste efficacement un aspect fondamental de la signalétique."}, {"exercise": {"id": "995e290cda554dceb9314682933f7829", "statement": "L'espace blanc, ou espace négatif, est utilisé pour représenter les parties textuelles du design.", "veracity": false, "feedback": "L'espace blanc, également appelé espace négatif, se réfère au vide autour ou à l'intérieur des éléments de conception, et non aux parties textuelles. Il s'agit d'un élément clé pour améliorer la lisibilité et la hiérarchie visuelle dans un design.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé de la conception graphique, à savoir l'utilisation de l'espace blanc (ou espace négatif) dans le design. Bien que cela ne couvre pas tous les aspects mentionnés dans la référence, comme l'accessibilité ou l'ergonomie, il touche à des éléments essentiels pour une signalétique efficace, notamment la lisibilité et la hiérarchie visuelle. L'explication fournie renforce cette compréhension en clarifiant le rôle de l'espace blanc dans le design. Cependant, un lien plus direct avec d'autres concepts abordés dans la synthèse aurait pu renforcer sa pertinence globale."}, {"exercise": {"id": "13247fe064be47ff9a12fc3711eb01ec", "query": "Il est recommandé de limiter le nombre d'options dans un menu de navigation à <blank> pour faciliter la compréhension par l'utilisateur.", "answers": ["7"], "distractors": [["5", "10", "15", "20", "3", "12"]], "feedback": "Le cerveau humain a une capacité limitée à traiter simultanément plusieurs informations, et il est recommandé de limiter le nombre d'options de navigation à 7 au maximum pour réduire la surcharge cognitive. Choisir un nombre plus élevé comme 10 ou 15 compliquerait l'assimilation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5dbc8b0bd3404789aa35b91256382f16", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "En web, on proclame que 20% du contenu permet de satisfaire 80% des recherches. Ce qui revient à dire qu'une « bonne » architecture doit servir en priorité « seulement » 20% des contenus les plus importants quitte à éventuellement délaisser le reste. Le cerveau humain étant limité dans sa capacité à traiter l'information, celui-ci aborde la complexité en traitant l'information par blocs. Ce fait est souvent utilisé comme un argument pour limiter le nombre d'options de navigation d'un menu à 7 maximum.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d7449175be5f4d5abb6a02e0a986fa0e", "next_id": "786f9d6e532046c6a6395a4085cce92f", "prev_id": "49495f581f1a4c16a156717fde22db5e", "associated_block_ids": [], "first_page": 12, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un principe clé de l'ergonomie et de la conception de signalétique, à savoir la limitation du nombre d'options dans un menu pour faciliter la navigation. Cela est directement lié aux concepts abordés dans la référence, notamment l'optimisation de l'interaction utilisateur et la clarté de l'information. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la synthèse, comme l'accessibilité ou le contraste visuel. Il pourrait être amélioré en intégrant des éléments supplémentaires liés à ces autres concepts."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'ergonomie dans la conception de signalétique, ce qui est un aspect clé de la référence. En demandant à l'apprenant de juger la véracité d'une affirmation sur l'importance de l'étude des usagers pour sélectionner les éléments ergonomiques, il teste leur capacité à relier théorie et pratique. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres aspects mentionnés dans la synthèse, comme le contraste visuel ou l'accessibilité."}, {"exercise": {"id": "9a504526d73f47a88f26d0337fa74295", "statement": "Le manque de connaissances peut être une circonstance légitime pour ne pas respecter les obligations d'accessibilité.", "veracity": false, "feedback": "Le manque de temps ou de connaissances n'est pas considéré comme une circonstance légitime pour ne pas respecter les obligations d'accessibilité. Les obligations doivent être respectées quelles que soient les difficultés rencontrées dans ces domaines.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "21cd46a699a744ce9c5384e58084e2ee", "order": 14.0, "image_url": null, "origin_type": "document_content", "text": "L'estimation des coûts peut comprendre les dépenses d'investissement, les dépenses de fonctionnement et le temps de travail, les qualifications requises. L'absence de priorité, le manque de temps ou de connaissances ne constituent pas des circonstances légitimes. Lorsqu'un site internet, extranet, intranet, une application mobile relève simultanément des obligations d'accessibilité imposées par l'article 47 de la loi du 11 février 2005, et de celles prescrites par les dispositions légales et réglementaires relatives à la lutte contre les discriminations et transposant la directive 2000/78/CE du 27 novembre 2000, l'appréciation de la portée et du niveau des obligations d'accessibilité, ainsi que le cas échéant de la charge disproportionnée se", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "341f2d8f9108461da3b90b38375817da", "next_id": "b7caac4d40af437aa342f2c3b2c2f9d9", "prev_id": "ea8b2c8be77540f6ae65210315d7359e", "associated_block_ids": [], "first_page": 8, "last_page": 8, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des obligations d'accessibilité, qui est un aspect fondamental de la conception de signalétique efficace. La question aborde directement l'importance de respecter les normes d'accessibilité, ce qui est en lien avec le contexte donné sur la création d'une signalétique. Cependant, bien que pertinent, l'exercice ne teste pas directement les compétences pratiques liées à la conception graphique ou à l'ergonomie dans le design de signalétique. Il se concentre davantage sur une connaissance théorique des obligations légales plutôt que sur des compétences concrètes en design. Cela justifie une note élevée mais pas maximale."}, {"exercise": {"id": "61f1c0b8a36c429c8447c37deec46a19", "question": "Comment doit être organisée la relation entre une étiquette et son champ associé ?", "answers": ["Ils doivent être visuellement proches pour éviter toute confusion"], "distractors": ["Ils doivent apparaître sur des lignes différentes séparées", "Ils doivent avoir des couleurs fortement contrastées", "Ils doivent être dans des blocs distincts", "Ils doivent être placés dans le pied de page", "Ils doivent être interactifs et cliquables", "Ils doivent avoir un lien réciproque avec le champ", "Ils doivent être centrés sur la page", "Ils doivent inclure un numéro identifiant commun", "Ils doivent s'afficher uniquement au survol du curseur"], "feedback": "En plaçant visuellement l'étiquette et son champ associé proches l'un de l'autre, il est plus facile pour les utilisateurs de comprendre quelle étiquette correspond à quel champ et évite ainsi toute confusion.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'organisation visuelle des éléments dans une signalétique, ce qui est un aspect clé de la conception graphique mentionnée dans la référence. La question sur la relation entre une étiquette et son champ associé touche directement à l'ergonomie et à la clarté de l'information, deux concepts essentiels pour créer une signalétique efficace. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects comme le contraste visuel ou l'accessibilité, ce qui lui empêche d'obtenir un score parfait."}, {"exercise": {"id": "7fd94d1cfb6a4172bd075fce05d98d4b", "statement": "Un lien d'évitement permet de sauter une zone dans la page pour faciliter la navigation.", "veracity": true, "feedback": "Les liens d'évitement sont en effet destinés à permettre aux utilisateurs de sauter certaines zones d'une page, ce qui améliore l'expérience de navigation, notamment pour ceux qui utilisent des lecteurs d'écran ou la navigation au clavier.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à l'accessibilité et à l'ergonomie dans la conception de signalétique, en se concentrant sur les liens d'évitement qui facilitent la navigation. Cela correspond bien aux objectifs de la référence, qui souligne l'importance de rendre l'information accessible et d'optimiser l'interaction utilisateur. Cependant, il aurait pu être encore plus pertinent s'il avait inclus des éléments supplémentaires sur les aspects graphiques ou visuels de la signalétique."}, {"exercise": {"id": "25fceaccd6604787b236e3b8ee677194", "statement": "Les tests de compatibilité avec l'accessibilité sont réalisés uniquement sur les navigateurs.", "veracity": false, "feedback": "Les tests de compatibilité avec l'accessibilité sont effectués en utilisant une combinaison de plusieurs facteurs : la technologie d'assistance, le système d'exploitation et le navigateur. Ce n'est donc pas limité aux seuls navigateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "babebf0e5f764a16b8bfe86e55f54be3", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Zone contenant les principaux contenus de la page, là où se trouvent les informations et fonctionnalités de fond (donc en dehors des menus, de la recherche ou des zones secondaires de publicités, actualités connexes ... ). Les tests effectués selon ces combinaisons (technologie d'assistance, système d'exploitation, navigateur) permettent de déclarer qu'un dispositif HTML / WAI-ARIA est compatible avec l'accessibilité tel que défini par WCAG. Les combinaisons ont été établies à partir de la liste des technologies d'assistance dont l'usage est suffisamment répandu, ou, dans certains cas lorsqu'elle est fournie de manière native et constitue le moyen privilégié d'accès à l'information et aux fonctionnalités.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "next_id": "5969ad50d6c645599081e11fc2ed299d", "prev_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "associated_block_ids": [], "first_page": 125, "last_page": 126, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'accessibilité, qui est un aspect fondamental de la conception de signalétique selon la référence. En questionnant l'affirmation sur les tests de compatibilité avec l'accessibilité, il incite l'apprenant à réfléchir sur les divers éléments qui influencent l'accessibilité dans le design graphique. Cependant, bien que pertinent, cet exercice ne couvre pas directement tous les aspects mentionnés dans la synthèse, tels que l'ergonomie ou le contraste visuel. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "deab729352214406ac6c8c35c97411bb", "statement": "Le critère 7.1 permet d'assurer la compatibilité avec les technologies d'assistance en utilisant uniquement WAI-ARIA.", "veracity": false, "feedback": "Le critère 7.1 vise à garantir la compatibilité avec les technologies d'assistance, mais ne repose pas uniquement sur WAI-ARIA. Il fait aussi référence aux WCAG (Web Content Accessibility Guidelines) pour définir cette compatibilité. WAI-ARIA est une des solutions utilisées, mais pas la seule composante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1a680aa224f54de983968257909443c2", "order": 18.0, "image_url": null, "origin_type": "document_content", "text": ". Le nom, le rôle, la valeur, le paramétrage et les changements d'états sont accessibles aux technologies d'assistance via une API d'accessibilité. Le critère 7.1 implémente la notion de « compatible avec les technologies d'assistance » tel que définie par les WCAG, ainsi que le recours à WAI-ARIA pour rendre un composant ou une fonctionnalité accessible. Le bon usage de WAI-ARIA est vérifié via les tests 7.1.1, 7.1.2, 7.1.3.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf92b5f2e30c4b72a9939e35bc21a854", "next_id": "d7efe816cb244a4884acccc33faa83a4", "prev_id": "c229b6e3dc5741aeb67f2b0851550af3", "associated_block_ids": [], "first_page": 47, "last_page": 48, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes d'accessibilité, qui sont essentielles dans la conception de signalétique, comme mentionné dans la référence. Il teste la connaissance des critères de compatibilité avec les technologies d'assistance, ce qui est un aspect clé pour garantir que l'information soit accessible à tous. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à la conception graphique et ergonomique de la signalétique elle-même."}, {"exercise": {"id": "abbae56786c04c0f9bf1c3985592057c", "statement": "Les contenus créés par des tiers sous le contrôle de l'organisme concerné ne sont pas soumis aux exigences d'accessibilité.", "veracity": false, "feedback": "Les contenus créés par des tiers qui ne sont ni financés, ni développés, ni sous le contrôle de l'organisme concerné ne sont pas soumis aux exigences d'accessibilité. Cependant, si l'organisme finance ou contrôle le contenu, les exigences s'appliquent.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b169105936c64ea5a46f3a4859ec37f9", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "2. Les contenus audio et vidéo préenregistrés, y compris ceux comprenant des composants interactifs, publiés avant le 23 septembre 2020 ; 5. Les contenus de tiers qui ne sont ni financés ni développés par l'organisme concerné et qui ne sont pas sous son contrôle ; a) Soit de l'incompatibilité des exigences en matière d'accessibilité avec la préservation de la pièce concernée ou l'authenticité de la reproduction notamment en termes de contraste ;", "short_summary": null, "long_summary": null, "title": null, "html_tag": "li", "children_ids": [], "parent_id": "ee367cc07b7f494cbdde1ee0e24336f4", "next_id": "be93f82627334ecd846946f1446fba26", "prev_id": "ef3ca7b7978c41c0aa9cb985a1c1a5b9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des exigences d'accessibilité, qui est un aspect fondamental de la conception de signalétique. La question aborde directement la nécessité de respecter les normes d'accessibilité pour tous les contenus, y compris ceux créés par des tiers sous le contrôle d'un organisme. Cela reflète bien l'importance de l'accessibilité mentionnée dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques sur la conception graphique ou ergonomique de la signalétique elle-même, ce qui lui aurait permis d'obtenir une note parfaite."}, {"exercise": {"id": "97024cd133a447e3a0958df90bae8beb", "statement": "Les normes internationales d'accessibilité numérique exigent que les contenus web répondent uniquement aux critères de succès de niveau simple A (A) des WCAG 2.1.", "veracity": false, "feedback": "Les normes internationales en matière d'accessibilité numérique exigent que les contenus web répondent aux critères de succès des niveaux simple A (A) et double A (AA) des WCAG 2.1, et non seulement au niveau simple A (A).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2c3c3aa286694ef49c1694da6568fce2", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Pour les personnes mentionnées au 4° du I de l'article 47 qui font le choix de se référer aux normes internationales en matière d'accessibilité numérique, leurs contenus et services web doivent en conséquence satisfaire aux critères de succès des Règles pour l'accessibilité des contenus Web (WCAG) 2.1 de niveau simple A (A) et double A (AA).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "af33fef0fe3b4477ba123292fd7efbbe", "next_id": "341f2d8f9108461da3b90b38375817da", "prev_id": "fd7e750ee1164c8bb45d42f99bc1ac2f", "associated_block_ids": [], "first_page": 7, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes d'accessibilité, qui est un aspect clé de la conception de signalétique mentionné dans la référence. En effet, l'accessibilité est primordiale pour garantir que le contenu soit compréhensible par tous les utilisateurs, y compris ceux en situation de handicap. L'affirmation testée aborde directement les exigences des WCAG 2.1, ce qui est pertinent pour le contexte de la signalétique. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques sur la conception graphique ou ergonomique de la signalétique elle-même, plutôt que de se concentrer uniquement sur les normes d'accessibilité."}, {"exercise": {"id": "e7e1673132b44458805f53b7217e6beb", "statement": "Le contenu caché peut être restitué par les technologies d'assistance après une action de l'utilisateur, comme un repositionnement du focus.", "veracity": true, "feedback": "Le contenu caché est rendu accessible aux technologies d'assistance après que l'utilisateur effectue certaines actions, notamment en utilisant le clavier ou un dispositif de pointage pour interagir avec un élément précédent ou en repositionnant le focus sur le contenu caché.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "81a4133a958f4554b9449289bc14fb56", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "· Le contenu caché n'a pas vocation à être ignoré par les technologies d'assistances et est rendu restituable par les technologies d'assistance suite à une action de l'utilisateur réalisable au clavier ou par tout dispositif de pointage sur un élément précédent le contenu caché ou suite à un repositionnement du focus dessus. Sauf si le contenu contrôlé par aria-hidden n'a pas vocation à être restitué par les technologies d'assistance, la valeur de l'attribut aria-hidden doit être cohérente avec l'état affiché ou masqué du contenu à l'écran.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e3c23a998e6743b0afa4a47412aecb95", "next_id": "92da586e97e94e9f810c3382f2a24e26", "prev_id": "0bcf73e79ee24cd0ae021d935ac733eb", "associated_block_ids": [], "first_page": 59, "last_page": 59, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception de signalétique, à savoir l'accessibilité de l'information pour les utilisateurs, y compris ceux utilisant des technologies d'assistance. La question sur le contenu caché et son accessibilité est directement liée aux principes abordés dans la synthèse, notamment en ce qui concerne l'importance de rendre toutes les informations compréhensibles et accessibles. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires sur d'autres aspects du design graphique ou ergonomique mentionnés dans la référence."}, {"exercise": {"id": "c7980d9a056f450988c3b8452c9d224b", "question": "Que signifie un lien signalé uniquement par la couleur dans un contenu web ?", "answers": ["L'absence de tout autre marqueur visuel comme icône ou soulignement"], "distractors": ["Le lien est invisible pour les utilisateurs non voyants", "Il est accompagné d'une bordure et d'un fond coloré", "Les utilisateurs peuvent cliquer sur n'importe quel texte visible", "Il est accessible même sans technologie d'assistance", "Le lien est toujours signifié par une icône spécifique", "Un lien cliquable avec une animation particulière", "Le lien est forcément écrit en gras", "Les accès direct via clavier sans repérage visuel", "Ce type de lien est activé automatiquement"], "feedback": "Un lien signalé uniquement par la couleur est un lien qui n'est accompagné d'aucun autre marqueur visuel, comme une icône ou un soulignement. Cela signifie que le lien peut être difficilement repéré par les utilisateurs non voyants ou malvoyants, qui ne peuvent pas percevoir la couleur du lien. Il est donc important de fournir des alternatives visuelles ou des indicateurs supplémentaires pour ces liens afin qu'ils soient accessibles à tous.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'accessibilité dans la conception de signalétique, un aspect clé de la référence. En posant une question sur les implications d'un lien signalé uniquement par la couleur, il teste la connaissance des apprenants sur l'importance d'utiliser plusieurs marqueurs visuels pour garantir que l'information soit accessible à tous, y compris aux personnes en situation de handicap. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments spécifiques à la conception graphique et ergonomique mentionnés dans la synthèse."}, {"exercise": {"id": "2f7d688d2dfe42259fea3dd5882400bd", "question": "Quelle caractéristique principale rend la police Arial particulièrement adaptée à une utilisation numérique ?", "answers": ["Elle offre une grande lisibilité même sur les supports numériques"], "distractors": ["Elle est spécialement conçue pour le design d'identités visuelles complexes.", "Elle utilise des empattements distincts pour améliorer l'esthétique de la page.", "Elle a été développée pour être utilisée uniquement dans le secteur financier.", "Elle a un style manuscrit qui fonctionne bien pour les invitations formelles.", "Elle propose différentes versions en italique et gras animées.", "Elle inclut des ligatures uniques pour chaque lettre de l'alphabet.", "Elle est principalement reconnue pour ses courbes élégantes.", "Elle est inspirée du style calligraphique traditionnel.", "Elle a été initialement conçue pour les panneaux de signalisation."], "feedback": "La police Arial est adaptée à une utilisation numérique grâce à sa grande lisibilité, même si elle peut également être utilisée pour le design d'identités visuelles complexes, les invitations formelles et les panneaux de signalisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5f01e31af3b049b398126317552f9ae2", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Pour moi, Arial est une police web-safe et sans empattements réussie, simple et efficace. C'est une police polyvalente qui fonctionne pour tous les secteurs d'activité et offre une grande lisibilité, même si elle a été conçue principalement pour une utilisation numérique. La police Geneva est connue pour s'inspirer du style grotesque. Elle est légèrement étroite et est plébiscitée par les grandes marques comme Facebook et Apple (l'entreprise dont elle est issue).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "5161d25144774c9092ef4e27d690ba62", "next_id": null, "prev_id": "d562f923eb3c4ec7bd755624e31f1e41", "associated_block_ids": [], "first_page": 303, "last_page": 304, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception graphique de signalétique, à savoir la lisibilité des polices sur les supports numériques. La question cible spécifiquement une caractéristique de la police Arial qui est pertinente pour garantir une bonne communication visuelle, ce qui est en ligne avec l'objectif de concevoir une signalétique efficace. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à l'accessibilité et à l'ergonomie mentionnés dans la synthèse, afin de couvrir plus largement les concepts abordés dans la référence."}, {"exercise": {"id": "f4b28520ee1f4e42b907e9f23a587b75", "query": "Les espaces blancs passifs sont des lacunes qui apparaissent naturellement dans la conception ou la typographie, tandis que les espaces blancs actifs sont ajoutés intentionnellement pour <blank>.", "answers": ["faciliter la lecture"], "distractors": [["améliorer le contraste", "réduire la fatigue oculaire", "remplir les zones vides", "augmenter l'espace visuel", "contrôler l'esthétique", "optimiser la typographie"]], "feedback": "La bonne réponse est 'faciliter la lecture' car les espaces blancs actifs ont pour but explicite de diriger l'attention d'un utilisateur en rendant la page plus facile à parcourir. Ils ne sont pas accidentels mais créés pour améliorer la lisibilité et le flux visuel.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des espaces blancs dans la conception graphique, ce qui est pertinent pour la signalétique. En effet, l'utilisation efficace des espaces blancs contribue à la lisibilité et à l'ergonomie de la signalétique, deux éléments clés mentionnés dans la synthèse. Cependant, l'exercice se concentre uniquement sur un aspect spécifique (les espaces blancs) sans aborder d'autres concepts cruciaux comme l'accessibilité ou le contraste visuel. Cela limite légèrement sa portée par rapport à l'ensemble des compétences nécessaires pour concevoir une signalétique efficace."}, {"exercise": {"id": "bc4a3de35f2e426aa928b95008ea9f99", "statement": "La zone d'en-tête et celle de navigation principale doivent respecter certaines conditions spécifiques lorsqu'elles sont présentes sur une page web.", "veracity": true, "feedback": "Lorsqu'elles sont présentes sur une page web, la zone d'en-tête, de navigation principale, et autres zones spécifiques comme le contenu principal, le pied de page et le moteur de recherche doivent respecter au moins une condition préétablie. Cela vise à garantir une bonne accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3567704ff8cd4aa5ab54ff79f986bc2b", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Note : l'appréciation d'un nombre très limité de pages devrait être réservée à un site dont l'ensemble des pages sont atteignables depuis la page d'accueil. . Test 12.6.1 : Dans chaque page web où elles sont presentes, la zone d'en-tête, de navigation principale, de contenu principal, de pied de page et de moteur de recherche respectent-elles au moins une de ces conditions :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d959c4185060456ead3c839626017e3e", "next_id": "071df3f2c64d4fa08b65e9b273680145", "prev_id": "8b07ae8f8182408598a96104daf72349", "associated_block_ids": [], "first_page": 73, "last_page": 75, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des principes d'accessibilité et de navigation, qui sont des éléments clés dans la conception d'une signalétique efficace. En se concentrant sur les zones d'en-tête et de navigation principale, l'exercice aborde indirectement l'ergonomie et la clarté visuelle nécessaires pour une bonne signalétique. Cependant, il pourrait être amélioré en intégrant des aspects plus spécifiques liés à la création graphique de la signalétique elle-même, comme l'utilisation d'icônes ou de typographie. Ainsi, bien que pertinent, il ne couvre pas entièrement tous les aspects mentionnés dans la référence."}, {"exercise": {"id": "37e722b43c2447cea81131e2194b84bb", "statement": "Le cerveau humain peut traiter simultanément un grand nombre d'options dans un menu, c'est pourquoi il est recommandé d'avoir plus de 10 options de navigation.", "veracity": false, "feedback": "C'est inexact. En réalité, le cerveau humain a une capacité limitée à traiter l'information, ce qui justifie la recommandation de limiter le nombre d'options de navigation à 7 ou moins. Cette limite permet au cerveau de mieux appréhender la complexité tout en facilitant la prise de décision pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5dbc8b0bd3404789aa35b91256382f16", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "En web, on proclame que 20% du contenu permet de satisfaire 80% des recherches. Ce qui revient à dire qu'une « bonne » architecture doit servir en priorité « seulement » 20% des contenus les plus importants quitte à éventuellement délaisser le reste. Le cerveau humain étant limité dans sa capacité à traiter l'information, celui-ci aborde la complexité en traitant l'information par blocs. Ce fait est souvent utilisé comme un argument pour limiter le nombre d'options de navigation d'un menu à 7 maximum.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d7449175be5f4d5abb6a02e0a986fa0e", "next_id": "786f9d6e532046c6a6395a4085cce92f", "prev_id": "49495f581f1a4c16a156717fde22db5e", "associated_block_ids": [], "first_page": 12, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de navigation intuitive, qui sont des éléments clés dans la conception d'une signalétique. En abordant la capacité du cerveau humain à traiter les informations, il met en lumière l'importance de limiter le nombre d'options pour améliorer l'expérience utilisateur. Cependant, bien que pertinent, l'exercice ne couvre pas directement tous les aspects mentionnés dans la référence, tels que l'accessibilité visuelle ou le contraste graphique. Il aurait pu être renforcé par des questions supplémentaires sur ces autres éléments essentiels."}, {"exercise": {"id": "2b71f18669974c0aaeff9e376d51e756", "query": "Un lien d'évitement permet <blank> dans la page afin d'améliorer l'accessibilité pour les utilisateurs.", "answers": ["de sauter une zone"], "distractors": [["d'ouvrir un nouveau site", "de charger une nouvelle section", "de fermer une fenêtre", "de lancer une aide technique", "d'activer un formulaire", "de générer un contenu"]], "feedback": "Un lien d'évitement permet aux utilisateurs, notamment ceux naviguant avec un clavier ou utilisant des aides techniques, de sauter une zone spécifique de la page afin de ne pas avoir à parcourir tout le contenu séquentiellement. Cela contribue à améliorer l'accessibilité en permettant une navigation plus fluide.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à l'accessibilité, qui est un aspect fondamental de la conception de signalétique. En demandant aux apprenants de compléter une phrase sur les liens d'évitement, il évalue leur connaissance des pratiques visant à améliorer l'expérience utilisateur pour tous, y compris les personnes en situation de handicap. Cependant, bien que pertinent, cet exercice ne couvre pas directement d'autres éléments essentiels mentionnés dans la synthèse, tels que le design graphique ou l'ergonomie. Il aurait pu être renforcé par des questions supplémentaires portant sur ces autres aspects pour obtenir une note plus élevée."}, {"exercise": {"id": "2ff72267ec8041dcbde6e12c2edb44cc", "statement": "Les dispositifs HTML/WAI-ARIA doivent respecter les normes d'accessibilité définies par WCAG.", "veracity": true, "feedback": "Les dispositifs HTML/WAI-ARIA, afin d'assurer une meilleure accessibilité pour les utilisateurs, doivent bien respecter les directives du WCAG (Web Content Accessibility Guidelines), qui fournissent des standards d'accessibilité pour le web.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "babebf0e5f764a16b8bfe86e55f54be3", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Zone contenant les principaux contenus de la page, là où se trouvent les informations et fonctionnalités de fond (donc en dehors des menus, de la recherche ou des zones secondaires de publicités, actualités connexes ... ). Les tests effectués selon ces combinaisons (technologie d'assistance, système d'exploitation, navigateur) permettent de déclarer qu'un dispositif HTML / WAI-ARIA est compatible avec l'accessibilité tel que défini par WCAG. Les combinaisons ont été établies à partir de la liste des technologies d'assistance dont l'usage est suffisamment répandu, ou, dans certains cas lorsqu'elle est fournie de manière native et constitue le moyen privilégié d'accès à l'information et aux fonctionnalités.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "next_id": "5969ad50d6c645599081e11fc2ed299d", "prev_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "associated_block_ids": [], "first_page": 125, "last_page": 126, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des normes d'accessibilité, qui est un aspect clé de la conception de signalétique efficace. Bien que l'affirmation porte spécifiquement sur les dispositifs HTML/WAI-ARIA et les directives WCAG, elle reste pertinente dans le contexte plus large de l'accessibilité mentionnée dans la synthèse. Cependant, l'exercice ne couvre pas directement d'autres éléments essentiels comme la clarté visuelle, l'ergonomie ou le design graphique en général, ce qui limite sa portée par rapport à l'ensemble des concepts abordés dans la référence."}, {"exercise": {"id": "4d2c6dd1ed6c481780a12d74693b288c", "question": "Où recommande WCAG de placer l'intitulé visible dans le nom accessible ?", "answers": ["Au début du nom accessible"], "distractors": ["À la fin du nom accessible", "Au milieu du texte accessible", "Après les caractères spéciaux", "Entre les balises HTML", "Avant les informations de priorité", "Dans le corps du paragraphe", "Au-dessus du contenu principal", "Sous la description de l’élément", "Entre les sections de rédaction"], "feedback": "En plaçant l'intitulé visible au début du nom accessible, cela permet aux personnes utilisant un lecteur d'écran de comprendre rapidement où ils se trouvent sur la page et d'accéder plus facilement aux informations souhaitées. Cela contribue à rendre la navigation plus fluide et plus efficace pour les personnes en situation de handicap.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "524e790cda4c40ec9c5caebbfb7758a3", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "· WCAG insiste sur le placement de l'intitulé visible au début du nom accessible sans toutefois réserver l'exclusivité de cet emplacement ; · WCAG considère comme un cas d'échec une correspondance non exacte de la chaîne de caractères de l'intitulé visible au sein du nom accessible.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "81035f9849744b8bac8f4a763c6a328e", "next_id": "e146d2624dbc40be87425503ef20e656", "prev_id": "910d3b5f0d5640b8aba686f5784f334d", "associated_block_ids": [], "first_page": 46, "last_page": 46, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité dans la conception de signalétique, en se concentrant sur le placement des intitulés visibles pour les utilisateurs de lecteurs d'écran. Cela est pertinent par rapport à la référence qui souligne l'importance de rendre l'information accessible et compréhensible pour tous. Cependant, l'exercice ne couvre pas directement d'autres éléments clés mentionnés dans la synthèse, tels que les éléments graphiques, l'ergonomie ou le contraste visuel. Par conséquent, bien qu'il soit pertinent, il ne teste pas complètement tous les aspects essentiels de la conception d'une signalétique efficace."}, {"exercise": {"id": "b661842bdd6d475db6f0661594078159", "statement": "Les étiquettes de champs de formulaire réclamant une même information doivent être uniformes pour éviter toute confusion chez l'utilisateur.", "veracity": true, "feedback": "Il est important que les libellés des champs de formulaire soient formulés de manière cohérente et sans ambiguïté pour que l'utilisateur comprenne qu'il est invité à fournir la même information.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "fb008f0151564ff5993187df2692da2a", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les étiquettes de champs de formulaire présentes dans une même page ou dans un ensemble de pages et réclamant la saisie d'une même information doivent être formulées sans ambiguïté pour que l'utilisateur sache que l'information qu'il doit communiquer est la même. Le langage CSS destiné à la mise en forme des éléments du contenu (exemples : couleur du fond de la page, taille/police/couleur des caractères, positionnement de l'information dans la page web ... ). Les styles CSS peuvent être externes (fichier CSS), embarqués (déclarés dans l'en-tête de la page) ou en ligne (déclarés via l'attribut style d'une balise).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d45eb7df2c3b436daf6bd8c0432f70f7", "next_id": "d0f408607e244872923937a422d113ab", "prev_id": "d45eb7df2c3b436daf6bd8c0432f70f7", "associated_block_ids": [], "first_page": 100, "last_page": 100, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de la clarté et de la cohérence dans la communication visuelle, ce qui est pertinent pour la conception d'une signalétique. Cependant, il se concentre spécifiquement sur les étiquettes des champs de formulaire, un aspect relativement limité par rapport à l'ensemble des concepts abordés dans la référence, tels que l'accessibilité, l'ergonomie et le contraste visuel. Bien qu'il soit lié au sujet général de la signalétique, il ne couvre pas suffisamment les autres éléments clés mentionnés dans la synthèse."}, {"exercise": {"id": "f62536fea51746029e15701b14cd6474", "statement": "Une différence mineure entre l'intitulé visible et le nom accessible est considérée comme un échec par WCAG.", "veracity": true, "feedback": "Selon WCAG, une correspondance non exacte entre la chaîne de caractères de l'intitulé visible et celle du nom accessible est effectivement considérée comme un échec. L'exactitude de la correspondance est donc essentielle pour valider le critère.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "524e790cda4c40ec9c5caebbfb7758a3", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "· WCAG insiste sur le placement de l'intitulé visible au début du nom accessible sans toutefois réserver l'exclusivité de cet emplacement ; · WCAG considère comme un cas d'échec une correspondance non exacte de la chaîne de caractères de l'intitulé visible au sein du nom accessible.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "81035f9849744b8bac8f4a763c6a328e", "next_id": "e146d2624dbc40be87425503ef20e656", "prev_id": "910d3b5f0d5640b8aba686f5784f334d", "associated_block_ids": [], "first_page": 46, "last_page": 46, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité dans la conception de signalétique, en se référant aux normes WCAG qui garantissent que les informations soient compréhensibles pour tous, y compris les personnes en situation de handicap. Cela est pertinent par rapport à la référence qui souligne l'importance de l'accessibilité et des normes dans le design graphique. Cependant, l'exercice se concentre principalement sur un détail spécifique concernant la correspondance des titres et noms accessibles, ce qui ne couvre pas entièrement les autres éléments clés mentionnés dans la synthèse, tels que l'ergonomie ou le contraste visuel. Ainsi, bien qu'il soit pertinent, il ne teste pas complètement tous les concepts clés liés à la conception d'une signalétique."}, {"exercise": {"id": "e547cfac7af6470596201e4ee72635a6", "statement": "WCAG impose obligatoirement que l'intitulé visible soit toujours au début du nom accessible.", "veracity": false, "feedback": "WCAG préconise que l'intitulé visible soit placé au début du nom accessible, mais n'impose pas cette position de manière exclusive. Il s'agit d'une recommandation, et non d'une obligation stricte.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "524e790cda4c40ec9c5caebbfb7758a3", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "· WCAG insiste sur le placement de l'intitulé visible au début du nom accessible sans toutefois réserver l'exclusivité de cet emplacement ; · WCAG considère comme un cas d'échec une correspondance non exacte de la chaîne de caractères de l'intitulé visible au sein du nom accessible.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "81035f9849744b8bac8f4a763c6a328e", "next_id": "e146d2624dbc40be87425503ef20e656", "prev_id": "910d3b5f0d5640b8aba686f5784f334d", "associated_block_ids": [], "first_page": 46, "last_page": 46, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité dans la conception de signalétique, en se référant aux WCAG (Web Content Accessibility Guidelines). Bien que cela soit pertinent pour le contexte de la signalétique, l'exercice ne teste pas directement les compétences liées à la création d'un dessin technique, d'un plan ou d'une carte. Il se concentre plutôt sur une règle spécifique concernant l'accessibilité des contenus numériques. Cela dit, il reste lié au thème général de l'accessibilité et de la lisibilité, ce qui justifie une note relativement positive."}, {"exercise": {"id": "2ecd877fc44d4d979a4a60133a77c61f", "question": "Quel est le rôle principal de l'attribut aria-label ledby ?", "answers": ["Fournir une alternative textuelle avec une description détaillée"], "distractors": ["Faciliter la gestion des événements clavier", "Structurer les balises HTML dans un document", "Contrôler la visibilité d'éléments sur différents écrans", "Activer la correction automatique du texte", "Prioriser l'ordre d'apparition des éléments", "Délimiter les sections d'un formulaire", "Assigner une valeur par défaut aux formulaires", "Associer des images à du contenu de texte", "Gérer des conflits entre balises intéractives"], "feedback": "Le rôle principal de l'attribut aria-label ledby est de fournir une alternative textuelle avec une description détaillée pour un élément. Cela permet aux utilisateurs non-voyants de comprendre le contenu de cet élément et de naviguer sur la page plus facilement grâce aux lecteurs d'écran.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect technique lié à l'accessibilité, qui est un élément clé de la conception de signalétique. En effet, l'utilisation d'attributs comme 'aria-label' est essentielle pour garantir que les informations soient accessibles à tous, y compris aux personnes en situation de handicap. Cependant, l'exercice se concentre spécifiquement sur un attribut ARIA et ne couvre pas d'autres aspects importants mentionnés dans la référence, tels que le design graphique, l'ergonomie ou le contraste visuel. Ainsi, bien qu'il soit pertinent pour une partie de la signalétique, il ne teste pas complètement tous les concepts clés abordés dans la synthèse."}, {"exercise": {"id": "6015c7d5473a4aa6a073f4730908e579", "question": "Quand est-il nécessaire de fournir une alternative textuelle à une fonctionnalité sonore ?", "answers": ["Si la fonctionnalité sonore nécessite une explication pour certains utilisateurs"], "distractors": ["Toujours, même lorsqu'il n'y a pas de son associé à une fonctionnalité.", "Seulement si l'utilisateur utilise un écran tactile.", "Lorsque le son est activé automatiquement à chaque démarrage.", "Uniquement si la fonctionnalité sonore est très complexe à comprendre.", "Si la fonctionnalité audiophonique emploie des basses fréquences.", "Quand la fonctionnalité sonore fait partie d'une application mobile spécifique.", "Dès que l'utilisateur essaie de désactiver le son.", "Si la fonctionnalité inclut une vidéo sans sous-titres.", "Lorsqu'une condition temporelle est associée à la fonctionnalité son."], "feedback": "L'alternative textuelle est nécessaire lorsque la fonctionnalité sonore n'est pas suffisamment compréhensible pour certains utilisateurs, par exemple les personnes sourdes ou malentendantes. Cela peut être dû à la complexité du son, à l'absence d'informations visuelles associées, ou à tout autre élément rendant difficile la compréhension de la fonctionnalité pour ces utilisateurs. Fournir une alternative textuelle permet de garantir une accessibilité équivalente pour tous les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'accessibilité, qui est un aspect fondamental de la conception d'une signalétique efficace. En demandant quand il est nécessaire de fournir une alternative textuelle à une fonctionnalité sonore, l'exercice teste la compréhension des principes d'accessibilité et d'inclusivité dans le design graphique. Cependant, bien que pertinent, cet exercice ne couvre pas directement les éléments spécifiques liés à la création d'un dessin technique, d'un plan ou d'une carte, qui sont également des aspects clés de la référence. Par conséquent, bien qu'il soit en lien avec certains concepts abordés dans la synthèse, il ne teste pas entièrement tous les objectifs d'apprentissage associés à la conception de signalétique."}, {"exercise": {"id": "cf5d22df526b473d886b2f9185bbbade", "question": "Quel est l'objectif principal du wireframe par rapport aux éléments présents ?", "answers": ["Organiser les éléments sans travailler l'aspect visuel"], "distractors": ["Créer directement le design visuel final des éléments", "Ajouter uniquement des images et des vidéos réelles", "Tester la réactivité des éléments graphiques", "Optimiser l'esthétique des composants graphiques", "Gérer les contenus textuels et visuels définitifs", "Mettre en place les animations et transitions", "Valider les couleurs et typographie définitives", "Finaliser le branding et la charte graphique", "Ajuster les dimensions des blocs selon l'aspect visuel"], "feedback": "Le wireframe permet de structurer et d'organiser visuellement les éléments sans se préoccuper de leur design final. Il s'agit d'une étape importante dans la conception d'un projet web, car cela permet de valider l'ergonomie et la hiérarchie visuelle avant de se concentrer sur l'aspect esthétique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "df14018e8ccc48c8a8344bcbf15123a3", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le wireframe est la suite logique du zoning. Chaque bloc réalisé lors de l'étape précédente se voit doté d'image(s), de texte(s) ou de vidéo(s). Ce contenu peut être fictif car les informations finales ne sont pas toujours connues à ce stade du projet. L'objectif est de définir l'organisation des éléments et des formes sans travailler l'aspect visuel, le graphisme n'interviendra que plus tard. On se base davantage sur les standards et souhaits ergonomiques pour orienter la réflexion.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9710cc0d10234b97b29e4b67712a7549", "next_id": "0c89f3ee23f341a0b428d9309f5b4e75", "prev_id": "9710cc0d10234b97b29e4b67712a7549", "associated_block_ids": [], "first_page": 206, "last_page": 206, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension du concept de wireframe, qui est un outil essentiel dans le processus de conception graphique, y compris pour la signalétique. Bien que l'exercice ne traite pas directement des éléments spécifiques à la signalétique comme l'accessibilité ou le contraste visuel, il aborde des principes fondamentaux d'ergonomie et d'organisation visuelle qui sont pertinents pour concevoir une signalétique efficace. Cependant, il pourrait être amélioré en intégrant des questions plus directement liées aux spécificités de la signalétique mentionnées dans la synthèse."}, {"exercise": {"id": "9705a7226b494b009033c21cabddf20d", "query": "La police Helvetica est réputée pour <blank>, ce qui la rend populaire notamment pour retranscrire des textes longs et denses.", "answers": ["sa lisibilité"], "distractors": [["ses complexité", "ses subtilité", "ses rigidité", "ses élégance", "ses singularité", "ses beauté"]], "feedback": "La bonne réponse est 'lisibilité' car Helvetica est principalement reconnue pour la facilité avec laquelle on peut lire les caractères qui la composent. C'est cette qualité qui fait que la police est souvent utilisée pour des textes longs et denses. Les autres termes comme 'complexité', 'subtilité', ou 'élégance' n'ont pas de lien direct avec l'usage principal de la police.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "75bf3e0555244e87883df8a4e922c34c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "La police Helvetica est réputée pour sa lisibilité. Certains la voit comme la police contemporaine la plus populaire, et elle a longtemps été considérée comme efficace pour retranscrire des textes longs et denses. Tous les jours, dans la rue, au bureau, à la maison, nous sommes en contact avec des milliers de caractères typographiques différents. Nous les lisons, nous les écrivons, nous les envoyons. Times, Futura, Helvetica, Mistral, Bodoni, Garamond : ces «sacrés caractères» sont des intimes inconnus que nous fréquentons sans même le savoir. Les polices révèlent les personnalités souvent excentriques et obsessionnelles de leurs créateurs. Sculpteurs, peintres, historiens ou typographes ont consacré des années de leur vie à dessiner des caractères qui, pour certains, leur survivront pendant des siècles.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ada1c2a2beb648628c46076dc4c6b8fa", "next_id": null, "prev_id": "baab71b4f65d45e89cef6fe208c211b8", "associated_block_ids": [], "first_page": 305, "last_page": 307, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance de la lisibilité d'une police de caractères, ce qui est un aspect pertinent dans le contexte de la conception graphique d'une signalétique. Cependant, il ne couvre pas l'ensemble des éléments essentiels mentionnés dans la synthèse, tels que l'ergonomie, l'accessibilité ou le contraste visuel. Bien qu'il soit lié à un concept clé (la lisibilité), il ne permet pas d'évaluer pleinement la compréhension des principes globaux nécessaires à une conception efficace de signalétique. Par conséquent, bien que pertinent, cet exercice n'est pas suffisamment complet pour obtenir une note plus élevée."}, {"exercise": {"id": "e2ba18bd43a347cbad64189d532ed1d1", "statement": "Les personnes concernées peuvent choisir de se référer aux normes internationales pour garantir l'accessibilité numérique de leurs services web.", "veracity": true, "feedback": "Il est vrai que les personnes mentionnées ont la possibilité de se référer aux normes internationales pour assurer l’accessibilité numérique de leurs contenus et services web.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2c3c3aa286694ef49c1694da6568fce2", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Pour les personnes mentionnées au 4° du I de l'article 47 qui font le choix de se référer aux normes internationales en matière d'accessibilité numérique, leurs contenus et services web doivent en conséquence satisfaire aux critères de succès des Règles pour l'accessibilité des contenus Web (WCAG) 2.1 de niveau simple A (A) et double A (AA).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "af33fef0fe3b4477ba123292fd7efbbe", "next_id": "341f2d8f9108461da3b90b38375817da", "prev_id": "fd7e750ee1164c8bb45d42f99bc1ac2f", "associated_block_ids": [], "first_page": 7, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception de signalétique, à savoir l'accessibilité numérique et les normes qui garantissent cette accessibilité. Cependant, il se concentre principalement sur la véracité d'une affirmation plutôt que sur des éléments pratiques de conception graphique ou d'ergonomie liés à la création d'une signalétique. Bien qu'il soit pertinent dans le contexte de l'accessibilité, il ne teste pas directement les compétences en matière de conception technique ou d'interaction utilisateur, ce qui limite sa pertinence par rapport à l'ensemble des concepts clés identifiés dans la référence."}, {"exercise": {"id": "6189fae992924e9d9bbea0a50ca68427", "question": "Quels éléments peuvent donner lieu à une bifurcation sur un site web ?", "answers": ["Le menu ou les liens internes"], "distractors": ["Les couleurs des boutons", "La taille des polices", "La disposition des images", "L'alignement du texte", "Les émissions de l'utilisateur", "L'emplacement des vidéos", "L'absence de cookies", "La vitesse du défilement", "Le son des interactions"], "feedback": "Les menus et les liens internes sont des éléments de navigation sur un site web qui peuvent conduire à différentes parties de l'interface, créant ainsi une bifurcation dans le parcours de l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des éléments de navigation sur un site web, ce qui est pertinent pour le contexte de la signalétique et de l'ergonomie. Cependant, il ne couvre pas directement les aspects spécifiques de la conception graphique tels que l'accessibilité, le contraste visuel ou l'utilisation d'éléments graphiques. Bien qu'il touche à des concepts importants liés à la navigation, il pourrait être amélioré en intégrant des questions plus directement liées aux principes de conception graphique et d'accessibilité mentionnés dans la synthèse."}, {"exercise": {"id": "d54493bfc49e475391dfb249fb95159f", "statement": "Il est recommandé d'organiser les menus en profondeur plutôt qu'en largeur.", "veracity": false, "feedback": "La recommandation est de privilégier une architecture de menu large plutôt que profonde. Une organisation trop profonde allonge les parcours de navigation, tandis qu'une structuration large permet d'accéder plus rapidement aux informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de navigation dans le contexte de la conception de signalétique, ce qui est pertinent par rapport à la référence. Cependant, il se concentre uniquement sur l'organisation des menus et ne couvre pas d'autres aspects essentiels tels que les éléments graphiques, l'accessibilité ou le contraste visuel. Bien qu'il teste une compétence clé liée à la navigation intuitive, il manque une portée plus large pour atteindre une note plus élevée."}, {"exercise": {"id": "b9d6104fa4ec4307beed0984f5d33ad4", "question": "Que faut-il vérifier lors d'un test de restitution d'un dispositif ?", "answers": ["La compatibilité avec l'accessibilité"], "distractors": ["La rapidité d'exécution du test", "La qualité graphique du dispositif", "Le taux d'erreurs du système", "La consommation en ressources de l'outil", "Le nombre de combinaisons d'environnements", "La facilité à utiliser pour toutes les bases de référence", "La convivialité du dispositif", "La durée de la restitution", "L'apparence visuelle des résultats"], "feedback": "Lors d'un test de restitution d'un dispositif, il est essentiel de vérifier que le dispositif est compatible avec l'accessibilité afin de garantir que toutes les bases de référence puissent l'utiliser sans problème. Les autres choix sont des critères qui peuvent être importants lors d'un test, mais ils ne sont pas spécifiquement liés à la restitution du dispositif.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception de signalétique, à savoir l'accessibilité. Cela correspond à l'un des éléments clés mentionnés dans la synthèse, qui souligne l'importance d'assurer que le contenu soit compréhensible pour tous les utilisateurs, y compris ceux utilisant des technologies d'assistance. Cependant, la question posée concerne spécifiquement un test de restitution d'un dispositif et ne traite pas directement de la conception graphique ou des éléments visuels liés à la signalétique elle-même. Bien que pertinent, l'exercice ne couvre pas entièrement les autres aspects essentiels tels que l'ergonomie ou le contraste visuel. Par conséquent, il obtient une note intermédiaire."}, {"exercise": {"id": "a18931b80bd24eeabfd44ab30e2abc15", "question": "Que permet l'attribut WAI-ARIA aria-label ledby ?", "answers": ["Associer un texte alternatif et une description détaillée"], "distractors": ["Associer deux sections de texte différentes", "Séparer les parties importantes d'un contenu", "Définir le rôle d'un élément visuel", "Associer plusieurs labels à un élément", "Gérer la hiérarchie des éléments interactifs", "Marquer les éléments interactifs d'une page", "Configurer l'ordre de navigation des éléments", "Cacher certains éléments aux lecteurs d'écran", "Associer plusieurs scripts à une fonctionnalité"], "feedback": "L'attribut WAI-ARIA aria-label ledby permet d'associer à un élément une alternative textuelle, qui sera utilisée par les lecteurs d'écran par exemple, et une description détaillée, qui fournit plus d'informations sur le rôle ou la fonction de l'élément pour les utilisateurs non-voyants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect technique lié à l'accessibilité, qui est un élément clé de la conception de signalétique. En effet, l'utilisation d'attributs comme WAI-ARIA est essentielle pour garantir que les informations soient accessibles à tous, y compris aux personnes en situation de handicap. Cependant, l'exercice se concentre spécifiquement sur un attribut particulier sans aborder directement les autres éléments importants mentionnés dans la référence, tels que le design graphique, l'ergonomie ou le contraste visuel. Bien qu'il soit pertinent, il ne couvre pas entièrement la portée de la conception d'une signalétique efficace."}, {"exercise": {"id": "85f18f92f25a4d5eaccbf6b62a6099b2", "question": "Que se passe-t-il si un média est utilisé à des fins décoratives ?", "answers": ["Le critère d'accessibilité devient non applicable"], "distractors": ["Les technologies d'assistance signalent une erreur", "L'API ajuste le rôle du média automatiquement", "Un message d'avertissement est généré pour l'utilisateur", "Le média devient invisible aux utilisateurs non assistés", "Le média affiche un texte alternatif requis", "Une description textuelle est automatiquement ajoutée au média", "Le média décoratif doit être référencé manuellement", "Le média est traité comme une image informative", "Il n'y a aucun impact sur l'accessibilité du média"], "feedback": "Lorsqu'un média est utilisé à des fins décoratives, cela signifie qu'il ne contient aucune information pertinente pour les utilisateurs. Par conséquent, il n'y a aucun impact sur l'accessibilité du média et le critère devient non applicable. Les autres distracteurs peuvent sembler plausibles mais ils ne sont pas liés au cas particulier mentionné dans la question.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e57586e1061541cbbb90025b19137eca", "order": 26.0, "image_url": null, "origin_type": "document_content", "text": "· Le nom, le rôle, la valeur, le paramétrage et les changements d'états des composants d'interfaces sont accessibles aux technologies d'assistance via une API d'accessibilité. Il existe une gestion de cas particulier lorsque le média temporel ou non temporel est utilisé à des fins décoratives (c'est-à-dire qu'il n'apporte aucune information). Dans ces situations, le critère est non applicable. Si l'attribut headers est implémenté sur une cellule déjà reliée à un en-tête (de ligne ou de colonne) avec l'attribut scope (avec la valeur col ou row), c'est l'en-tête ou les en-têtes référencés par l'attribut headers qui seront restitués aux technologies d'assistance. Les en-têtes reliés avec l'attribut scope seront ignorés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "20c625cf818d4f95b9da1107913afa57", "next_id": "6444725bd6784c8fa8ff069a087d4073", "prev_id": "021c210bb5254fdc9121cdc3c5de9a10", "associated_block_ids": [], "first_page": 41, "last_page": 45, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'accessibilité des médias dans le contexte de la signalétique, ce qui est pertinent par rapport à la référence sur la conception graphique d'une signalétique. Cependant, il se concentre spécifiquement sur les médias décoratifs et leur impact sur l'accessibilité, sans explorer d'autres aspects cruciaux tels que l'ergonomie, le contraste visuel ou l'utilisation d'éléments graphiques pour une communication efficace. Bien qu'il teste une compréhension importante liée à l'accessibilité, il ne couvre pas suffisamment les autres éléments clés mentionnés dans la synthèse pour obtenir un score plus élevé."}, {"exercise": {"id": "9f11fe79d5ff44e0a4961f860b7a114c", "query": "Le test visant à vérifier la restitution d'un dispositif doit s'assurer que celle-ci est compatible avec <blank>.", "answers": ["l'accessibilité"], "distractors": [["la sécurité", "la performance", "l'efficacité", "la compatibilité technique", "l'ergonomie", "la fiabilité"]], "feedback": "La bonne réponse est 'l'accessibilité', car l'objectif du test est de garantir que la restitution d'un dispositif ou d'une alternative fonctionne correctement dans un environnement accessible. D'autres options comme la sécurité ou la performance ne sont pas pertinentes dans ce contexte où l'accessibilité est le critère principal.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept clé lié à la signalétique, à savoir l'accessibilité. Cependant, il ne couvre pas directement les autres éléments essentiels mentionnés dans la référence, tels que l'ergonomie, le contraste visuel ou les normes de conception. Bien que l'accessibilité soit un aspect important de la conception graphique et qu'elle soit mentionnée dans la synthèse, l'exercice pourrait être amélioré en intégrant des questions qui évaluent également d'autres compétences ou concepts liés à la création d'une signalétique efficace."}, {"exercise": {"id": "379a2834d3734490b11d86cadf86d1d1", "query": "L'attribut WAI-ARIA <blank> est utilisé pour associer un passage de texte faisant office d'alternative textuelle et un autre passage offrant une description détaillée.", "answers": ["aria-labelledby"], "distractors": [["aria-describedby", "aria-hidden", "aria-label", "aria-controls", "aria-expanded", "aria-autocomplete"]], "feedback": "La bonne réponse est 'aria-labelledby' car cet attribut permet d'associer un élément à un autre, où le premier agit comme alternative textuelle (titre) et le second fournit une description plus détaillée. Les autres réponses proposées sont également des attributs WAI-ARIA mais ne remplissent pas cette fonction spécifique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'un attribut WAI-ARIA, qui est pertinent pour l'accessibilité de la signalétique, un aspect mentionné dans la synthèse. Cependant, il ne couvre pas directement les concepts clés liés à la conception graphique de la signalétique elle-même, tels que l'ergonomie, le contraste visuel ou l'utilisation d'éléments graphiques. Bien qu'il soit utile pour comprendre comment rendre une signalétique accessible, il ne permet pas d'évaluer pleinement la maîtrise des compétences nécessaires à la création d'une signalétique efficace dans son ensemble."}, {"exercise": {"id": "407fe2fd6cfa4336b4c2b6d2f561df04", "statement": "Les composants d'interfaces sont accessibles aux technologies d'assistance uniquement via des attributs HTML spécifiques.", "veracity": false, "feedback": "Les composants d'interfaces sont accessibles aux technologies d'assistance via une API d'accessibilité, et non uniquement par des attributs HTML spécifiques. L'API permet de transmettre des informations comme le rôle, la valeur et les changements d'état des composants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e57586e1061541cbbb90025b19137eca", "order": 26.0, "image_url": null, "origin_type": "document_content", "text": "· Le nom, le rôle, la valeur, le paramétrage et les changements d'états des composants d'interfaces sont accessibles aux technologies d'assistance via une API d'accessibilité. Il existe une gestion de cas particulier lorsque le média temporel ou non temporel est utilisé à des fins décoratives (c'est-à-dire qu'il n'apporte aucune information). Dans ces situations, le critère est non applicable. Si l'attribut headers est implémenté sur une cellule déjà reliée à un en-tête (de ligne ou de colonne) avec l'attribut scope (avec la valeur col ou row), c'est l'en-tête ou les en-têtes référencés par l'attribut headers qui seront restitués aux technologies d'assistance. Les en-têtes reliés avec l'attribut scope seront ignorés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "20c625cf818d4f95b9da1107913afa57", "next_id": "6444725bd6784c8fa8ff069a087d4073", "prev_id": "021c210bb5254fdc9121cdc3c5de9a10", "associated_block_ids": [], "first_page": 41, "last_page": 45, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'accessibilité des composants d'interfaces, ce qui est un aspect important dans la conception de signalétique. Cependant, il se concentre principalement sur les technologies d'assistance et leur fonctionnement technique, sans explorer directement les éléments graphiques, l'ergonomie ou le contraste visuel qui sont également cruciaux pour concevoir une signalétique efficace. Bien que pertinent, l'exercice ne couvre pas tous les aspects clés mentionnés dans la référence."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception ergonomique, qui est l'étude des usagers. Cela se relie à la référence sur la signalétique, car comprendre les utilisateurs est essentiel pour créer une signalétique efficace et accessible. Cependant, l'exercice ne couvre pas directement d'autres éléments clés mentionnés dans la synthèse, tels que les éléments graphiques, le contraste visuel ou l'accessibilité de l'information. Bien qu'il soit pertinent, il ne teste pas entièrement tous les concepts essentiels liés à la conception d'une signalétique."}, {"exercise": {"id": "f2c383430cc64c0da4db75976569aee8", "question": "Combien d'options de navigation est-il recommandé de maximiser dans un menu ?", "answers": ["7 maximum"], "distractors": ["8 maximum", "10 maximum", "9 maximum", "3 maximum", "5 maximum", "12 maximum", "6 maximum", "11 maximum", "4 maximum"], "feedback": "Le cerveau humain a une capacité limitée à traiter l'information. Pour faciliter sa compréhension, il est conseillé de limiter le nombre d'options dans un menu à 7 maximum. Cela permet aux utilisateurs de mieux s'orienter et de ne pas être submergés par trop d'informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5dbc8b0bd3404789aa35b91256382f16", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "En web, on proclame que 20% du contenu permet de satisfaire 80% des recherches. Ce qui revient à dire qu'une « bonne » architecture doit servir en priorité « seulement » 20% des contenus les plus importants quitte à éventuellement délaisser le reste. Le cerveau humain étant limité dans sa capacité à traiter l'information, celui-ci aborde la complexité en traitant l'information par blocs. Ce fait est souvent utilisé comme un argument pour limiter le nombre d'options de navigation d'un menu à 7 maximum.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d7449175be5f4d5abb6a02e0a986fa0e", "next_id": "786f9d6e532046c6a6395a4085cce92f", "prev_id": "49495f581f1a4c16a156717fde22db5e", "associated_block_ids": [], "first_page": 12, "last_page": 14, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un principe de conception ergonomique lié à la navigation dans un menu, ce qui est pertinent pour la signalétique. Cependant, il ne couvre pas directement les aspects graphiques ou visuels de la signalétique mentionnés dans la référence, tels que l'utilisation d'éléments graphiques, le contraste visuel ou l'accessibilité. Bien qu'il soit en lien avec l'ergonomie et l'interaction utilisateur, il manque une connexion plus forte avec les éléments spécifiques de conception graphique abordés dans la synthèse."}, {"exercise": {"id": "2814a37146f740729ed37839e00c69ea", "question": "Quand un intitulé de lien est-il considéré comme non-explicite ?", "answers": ["Quand le nom accessible diffère de l'intitulé visible du lien"], "distractors": ["Quand le lien ne redirige pas correctement", "Quand il y a plusieurs URL pour un même lien", "Quand l'attribut title contient des balises HTML erronées", "Quand le nom accessible contient des caractères spéciaux non supportés", "Quand l'intitulé visible n'est pas traduit", "Quand le lien ouvre une nouvelle fenêtre sans avertissement", "Quand le lien se trouve dans une zone répétitive de la page", "Quand le texte du lien comprend plus de trois mots", "Quand l'attribut title n'est pas présent"], "feedback": "La réponse correcte indique que l'on considère un intitulé de lien comme non-explicite lorsque le nom accessible présent dans l'attribut title diffère de l'intitulé visible du lien, ce qui peut entraîner des problèmes d'accessibilité pour certains utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "87065915b6c64d61a9077eb6539efe48", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Note 1 : un intitulé de lien sera considéré comme non-explicite dans le cas où le « nom accessible » ne reprend pas l'intitulé visible du lien. Note 2 : en raison de la configuration possible des aides techniques permettant de forcer la restitution de « nom accessible » issu du contenu de attribut tit le au détriment du « nom accessible » issu du contenu du lien. Un intitulé de lien sera considéré comme non-explicite dans le cas où le lien possède un attribut tit le dont la valeur ne reprendrait pas au moins le « nom accessible » issu du contenu du lien.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6eb38da4889d4289a5aa6ca2e733eeff", "next_id": "2b71734dfd0549ff81963e92a07165f7", "prev_id": "10e752518b084e25b454c0c51afb9733", "associated_block_ids": [], "first_page": 105, "last_page": 105, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des concepts d'accessibilité et de clarté dans la signalétique, qui sont des éléments clés mentionnés dans la référence. La question sur l'intitulé de lien non-explicite touche à l'importance de la communication visuelle efficace et accessible. Cependant, l'exercice pourrait être amélioré en se concentrant davantage sur les aspects spécifiques du design graphique ou ergonomique de la signalétique, comme le contraste visuel ou l'utilisation d'icônes. Bien qu'il soit pertinent, il ne couvre pas entièrement tous les aspects essentiels de la conception d'une signalétique efficace."}, {"exercise": {"id": "1bd0091527ff4a1ea9718baeb9ebf8cf", "statement": "Un lien sera considéré non-explicite si son intitulé visible ne correspond pas à son 'nom accessible'.", "veracity": true, "feedback": "Cette affirmation est correcte. Si l'intitulé visible d'un lien ne reprend pas son 'nom accessible', il est effectivement jugé comme non-explicite, car cela peut créer de la confusion pour les utilisateurs et les aides techniques qui lisent le lien sans fournir une indication claire de sa destination ou de sa fonction.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "87065915b6c64d61a9077eb6539efe48", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Note 1 : un intitulé de lien sera considéré comme non-explicite dans le cas où le « nom accessible » ne reprend pas l'intitulé visible du lien. Note 2 : en raison de la configuration possible des aides techniques permettant de forcer la restitution de « nom accessible » issu du contenu de attribut tit le au détriment du « nom accessible » issu du contenu du lien. Un intitulé de lien sera considéré comme non-explicite dans le cas où le lien possède un attribut tit le dont la valeur ne reprendrait pas au moins le « nom accessible » issu du contenu du lien.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6eb38da4889d4289a5aa6ca2e733eeff", "next_id": "2b71734dfd0549ff81963e92a07165f7", "prev_id": "10e752518b084e25b454c0c51afb9733", "associated_block_ids": [], "first_page": 105, "last_page": 105, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect important de l'accessibilité dans la conception de signalétique, en se concentrant sur la clarté des liens et leur correspondance avec les noms accessibles. Cela est pertinent pour le contexte de la signalétique, qui doit être claire et compréhensible pour tous les utilisateurs. Cependant, l'exercice ne couvre pas directement d'autres éléments clés mentionnés dans la référence, tels que l'ergonomie, le contraste visuel ou les normes spécifiques à respecter. Il aurait été plus complet s'il avait inclus des questions sur ces autres aspects essentiels du design de signalétique."}, {"exercise": {"id": "1419f7539bfc4cddab1dec25b459552b", "statement": "Les Règles pour l'accessibilité des contenus Web (WCAG) 2.0 visent à rendre les contenus Web accessibles aux personnes en situation de handicap.", "veracity": true, "feedback": "C'est exact. Les WCAG 2.0 ont pour but de définir des méthodes pour rendre les contenus Web plus accessibles aux personnes ayant divers types de handicaps.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c70b8f193fbe4b059d4f4438eebfc40c", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Opquast (Open Quality Standards) a pour objectif d'améliorer la qualité des services en ligne grâce des check-lists (226 bonnes pratiques) sous licence ouverte (Creative Commons BY-SA) et des outils validés et utilisés par une large communauté de professionnels du web. Les Règles pour l'accessibilité des contenus Web (WCAG) 2.0 définissent la façon de rendre les contenus Web plus accessibles aux personnes en situation de handicap", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e84573ff412c46ae9983afed596faca0", "next_id": "0ffc552290bd48fcaf2a1f0ab168f84c", "prev_id": "d5f2445ab17f4033bfdb9e027e3a6609", "associated_block_ids": [], "first_page": 51, "last_page": 52, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception de signalétique, à savoir l'accessibilité des contenus, qui est mentionnée dans la synthèse. Cependant, il se concentre spécifiquement sur les WCAG 2.0, qui sont des directives pour le contenu web et non directement sur la signalétique elle-même. Bien que cela soit pertinent pour le contexte plus large de l'accessibilité dans le design graphique, l'exercice ne teste pas directement les compétences liées à la création d'une signalétique ou à l'utilisation d'éléments graphiques spécifiques comme les images ou typographies. Par conséquent, bien qu'il soit pertinent, il ne couvre pas entièrement tous les aspects clés de la référence."}, {"exercise": {"id": "28d759f70f784404931cde866e59005e", "statement": "L'attribut aria-hidden doit toujours avoir la valeur 'true' pour les technologies d'assistance quel que soit l'état affiché ou masqué à l'écran.", "veracity": false, "feedback": "L'attribut aria-hidden doit être cohérent avec l'état du contenu à l'écran. Si le contenu est affiché, aria-hidden ne doit pas être défini sur true, car cela le rendrait inaccessible aux technologies d'assistance. Il ne doit être défini sur 'true' que si le contenu n'est pas destiné à être restitué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "81a4133a958f4554b9449289bc14fb56", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "· Le contenu caché n'a pas vocation à être ignoré par les technologies d'assistances et est rendu restituable par les technologies d'assistance suite à une action de l'utilisateur réalisable au clavier ou par tout dispositif de pointage sur un élément précédent le contenu caché ou suite à un repositionnement du focus dessus. Sauf si le contenu contrôlé par aria-hidden n'a pas vocation à être restitué par les technologies d'assistance, la valeur de l'attribut aria-hidden doit être cohérente avec l'état affiché ou masqué du contenu à l'écran.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e3c23a998e6743b0afa4a47412aecb95", "next_id": "92da586e97e94e9f810c3382f2a24e26", "prev_id": "0bcf73e79ee24cd0ae021d935ac733eb", "associated_block_ids": [], "first_page": 59, "last_page": 59, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect spécifique de l'accessibilité dans le design de signalétique, en se concentrant sur l'utilisation correcte de l'attribut aria-hidden. Bien que cela soit pertinent pour la conception graphique et l'accessibilité, il ne couvre pas directement tous les éléments clés mentionnés dans la référence, tels que les éléments graphiques, l'ergonomie ou le contraste visuel. L'exercice est donc pertinent mais ne teste qu'une partie des compétences nécessaires à la conception d'une signalétique efficace."}, {"exercise": {"id": "1e8837a2fa214391911afea8e4445731", "statement": "Les liens d'accès rapide et d'évitement ne modifient pas l'endroit où commence la navigation clavier après leur activation.", "veracity": false, "feedback": "Les liens fonctionnels d'accès rapide et d'évitement doivent précisément permettre de reprendre la navigation clavier directement à partir de la cible visée par le lien, facilitant ainsi un accès plus direct aux sections importantes d'une page.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des liens d'accès rapide et d'évitement, qui sont des éléments importants pour l'ergonomie et l'accessibilité dans la conception de signalétique. Bien que cela soit pertinent pour le contexte de la signalétique, l'exercice ne couvre pas directement les aspects graphiques ou visuels mentionnés dans la référence, tels que le design graphique, le contraste visuel ou l'utilisation d'éléments graphiques. Il se concentre plutôt sur un aspect technique de la navigation clavier. Ainsi, bien qu'il soit lié à l'accessibilité, il ne teste pas tous les concepts clés de manière exhaustive."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 25.0, "top_pages": [68, 25], "top_minutes": []}, {"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.3, "top_pages": [276, 277], "top_minutes": []}]}