{"introduction": "La réalisation d'une œuvre plastique, qu'il s'agisse de peinture ou de sculpture, repose sur une compréhension approfondie des principes esthétiques et techniques qui guident le processus créatif. Cette synthèse explore les concepts clés liés à l'esthétique, à la représentation visuelle et aux outils numériques qui enrichissent la création artistique. En intégrant ces éléments, l'artiste peut non seulement exprimer sa vision personnelle mais aussi garantir que son œuvre soit accessible et engageante pour un large public.", "synthesis": "L'esthétique joue un rôle fondamental dans la création artistique, car elle détermine la qualité visuelle d'une œuvre et influence les émotions du spectateur. Dans ce contexte, le contraste visuel est essentiel pour assurer que les éléments d'une composition se distinguent clairement les uns des autres, facilitant ainsi la lisibilité et l'impact visuel. Parallèlement, la couleur d'arrière-plan contiguë contribue à l'harmonie générale de l'œuvre en influençant la perception globale des couleurs utilisées.\n\nLa simplicité est également un principe clé dans le design artistique. En réduisant les éléments superflus, l'artiste peut créer une œuvre plus claire et intuitive qui attire l'attention sur les aspects essentiels de sa création. Ce minimalisme favorise une expérience esthétique plaisante tout en permettant au spectateur de se concentrer sur le message véhiculé par l'œuvre.\n\nLes médias non temporels tels que les images statiques sont cruciaux dans le domaine artistique car ils permettent une interaction sans contrainte temporelle. Les artistes utilisent souvent des formats vectoriels pour garantir que leurs œuvres conservent leur qualité quelle que soit leur taille ou leur support d'affichage. Des plateformes comme Dribbble et Behance offrent aux créateurs un espace pour partager leurs travaux et s'inspirer mutuellement, renforçant ainsi la communauté artistique.\n\nEnfin, il est important de considérer l'accessibilité dans la création artistique numérique. L'utilisation de balises comme <svg> et <canvas> permet aux artistes d'intégrer des graphiques dynamiques tout en garantissant que ces contenus soient accessibles à tous les utilisateurs grâce à des descriptions textuelles appropriées. Le principe selon lequel la couleur ne doit pas être le seul vecteur d'information assure également que toutes les œuvres puissent être appréciées par un public diversifié, indépendamment de leurs capacités visuelles.", "concepts": [{"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Esthétique' est hautement pertinent car elle est essentielle dans toute forme d'art visuel, y compris le dessin, influençant directement l'engagement et la perception du spectateur."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "L'image est essentielle dans le processus créatif et artistique, car elle représente visuellement des idées et des émotions, ce qui en fait un concept central à la réalisation d'un dessin artistique."}, {"concept": {"id": "9afb0643-e273-456d-8fd2-4ab13b0d8236", "label": "Contraste visuel", "definition": "Le contraste visuel, ou ratio de contraste, désigne la mesure de l'opposition entre la luminosité ou la couleur d'un élément de premier plan et celle d'un arrière-plan. Ce contraste est essentiel pour garantir la lisibilité et l'accessibilité des contenus numériques sur les pages web et les interfaces visuelles, en particulier pour les utilisateurs ayant des déficiences visuelles. Il joue un rôle crucial dans l'expérience utilisateur en assurant que le contenu soit facilement discernable par tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707, 13710, 13708], "aliases": ["5c481e4e-e436-4bb7-a7e9-53bc0830e306", "b12c3286-f79e-4321-a6d3-db4c95e9c849", "650d5354-ed61-4940-8878-706a15f07f6f", "1c2f3e20-96e3-4275-8631-9e9564ed2ed1", "c4dddffe-8da9-4405-8b54-28eb0959e6dd", "7141a9bd-f2a9-4685-95e3-5e81f87d7c9a", "cd3ee3d7-bb6f-4084-9226-a941f6eb43b9"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Contraste visuel' est essentiel dans le dessin artistique car il influence fortement l'esthétique et la lisibilité des œuvres, rendant ce concept très pertinent."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le format vectoriel est hautement pertinent pour les dessins artistiques numériques, car il permet une flexibilité dans le redimensionnement sans perte de qualité, ce qui est essentiel en graphisme."}, {"concept": {"id": "a2024caf-bad3-4b20-a384-8d3cea0b2ff7", "label": "Dribbble", "definition": "Plateforme en ligne pour designers permettant de partager des travaux créatifs et de s'inspirer des tendances actuelles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": {"label": "Dribbble", "definition": "Dribbble est un site internet qui regroupe des travaux de designer. Il sert de plate-forme de conception de portfolio , l'une des plus grandes plates-formes permettant aux concepteurs de partager leur travail en ligne. La société est entièrement isolée, sans siège social.", "page_id": "12597240", "wikidata_id": "Q7605173", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Dribbble est une plateforme dédiée aux designers pour partager leurs créations, ce qui en fait un concept pertinent pour ceux qui réalisent des œuvres artistiques."}, {"concept": {"id": "64c3e433-c882-4e59-b5c8-457895680f56", "label": "Behance", "definition": "Réseau social pour les professionnels créatifs où ils peuvent présenter leurs projets et découvrir des œuvres innovantes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": {"label": "Behance", "definition": "Behance (stylisé Bēhance) est un site web où des artistes et créateurs postent leurs créations. Le propriétaire de Behance est Adobe Systems. Ses concurrents sont Dribbble et DeviantArt.", "page_id": "12597294", "wikidata_id": "Q4880667", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Behance est également une plateforme où les artistes peuvent présenter leur travail, ce qui en fait un concept pertinent pour ceux qui réalisent des dessins artistiques."}, {"concept": {"id": "3763ff44-edb7-487e-8bb8-3a9241bb67ff", "label": "Couleur d'arrière-plan contiguë", "definition": "Couleur directement adjacente au bord extérieur d'un élément graphique, influençant la perception visuelle et l'esthétique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La couleur d'arrière-plan contiguë est directement liée à l'esthétique et à la perception visuelle dans un dessin artistique, ce qui en fait un concept pertinent pour réaliser une œuvre plastique."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La simplicité en design est très pertinente pour réaliser un dessin artistique, car elle encourage une approche minimaliste qui peut enrichir l'expression visuelle et l'impact esthétique."}, {"concept": {"id": "74af9aa5-bfae-4e80-80d1-95a93d803eca", "label": "Média non temporel", "definition": "Un média non temporel est un type de contenu statique qui ne dépend pas du temps pour sa consultation, permettant une interaction à travers divers dispositifs. Cela inclut des éléments tels que des images, des tableaux, des cartes interactives et des diaporamas, qui peuvent être consultés sans déroulement temporel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["e39ff41e-2a23-4a5c-bab2-9639401ab497"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Média non temporel' est pertinent car le dessin artistique peut être considéré comme un contenu statique qui ne dépend pas du temps pour sa consultation, ce qui en fait un élément central dans le contexte des œuvres plastiques."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "La balise <svg> est pertinente car elle permet de créer des graphiques vectoriels, ce qui peut être utilisé dans le cadre du dessin numérique ou de l'art graphique."}, {"concept": {"id": "916d45fb-8de8-4d6d-b59f-490f45450c93", "label": "Balise <canvas>", "definition": "La balise <canvas> est un élément HTML5 qui permet de dessiner des graphiques dynamiques via JavaScript sur une page web. Elle est souvent utilisée pour créer des images bitmap, des animations, des jeux et des applications visuelles interactives. Il est essentiel de fournir une description textuelle du contenu de la balise <canvas> pour les utilisateurs ayant des déficiences visuelles, car cela améliore l'accessibilité du contenu graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["eae02101-e80c-411d-8adc-caed6eb3022e", "98686082-c428-4b5d-aa6c-21436ac97aa7", "34dfcfa2-04a9-43d4-8f33-29c9fe8f0f87", "a186b0f2-f065-4ed4-a10b-3924bc3aef84", "5d801026-5898-497b-8954-039fc91e3ab9"], "wikientity": {"label": "Canvas (HTML)", "definition": "L'élément canvas est un composant du langage Web HTML qui permet d'effectuer des rendus dynamiques d'images bitmap en utilisant des scripts dans des langages tels que le javascript. Déjà implémenté dans certains navigateurs, il fait partie de la spécification HTML5. Canvas peut également être utilisé pour mettre en place un moyen de traçage de l'utilisateur sur le site sans avoir à collecter ses données personnelles grâce au canvas fingerprinting.", "page_id": "622027", "wikidata_id": "Q657954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "<canvas> permet de créer des graphiques dynamiques et peut être utilisé dans un contexte artistique numérique, bien qu'il soit plus technique que purement artistique."}, {"concept": {"id": "7fcc9498-9b97-4289-a01d-189889aa59c3", "label": "Couleur comme information", "definition": "Principe selon lequel l'information ne doit pas être transmise uniquement par la couleur ou l'utilisation de couleurs, afin d'assurer l'accessibilité pour tous les utilisateurs et éviter toute confusion pour ceux qui peuvent avoir des difficultés à percevoir les couleurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["1cccf89a-d717-4d5a-8956-63d3432cb9ee"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le principe de couleur comme information a une certaine pertinence dans le contexte artistique, car il touche à l'utilisation consciente des couleurs dans les œuvres afin d'assurer accessibilité et clarté visuelle."}], "exercises": [], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 6.5, "top_pages": [20, 21], "top_minutes": []}]}