{"introduction": "La conception d'un projet de communication multicanal implique une approche stratégique et intégrée, visant à optimiser l'interaction avec les usagers à travers divers médias. Dans ce contexte, il est essentiel d'explorer des concepts clés tels que la qualité des contenus, l'accessibilité numérique et les objectifs stratégiques, qui ensemble, permettent de créer une expérience utilisateur fluide et engageante.", "synthesis": "La conception d'un projet de communication multicanal repose sur plusieurs thèmes centraux qui interagissent pour garantir une expérience utilisateur optimale. Tout d'abord, la qualité des contenus est primordiale ; elle doit répondre aux besoins des usagers tout en étant pertinente et attrayante. Les contenus peuvent être classés en deux catégories : les médias temporels, comme les vidéos et audios qui nécessitent un contrôle utilisateur pour leur consultation efficace, et les médias non temporels, tels que les images et tableaux interactifs qui offrent une interaction sans contrainte temporelle.\n\nUn autre aspect fondamental est l'ergonomie du site web ou de l'application. Cela inclut la lisibilité du contenu, qui détermine la facilité avec laquelle un texte peut être compris par les utilisateurs. Des éléments comme la taille de police et le contraste sont cruciaux pour maintenir l'engagement du lecteur. De plus, la navigation joue un rôle clé dans l'expérience utilisateur ; elle doit être intuitive pour permettre aux usagers de se déplacer facilement à travers le contenu proposé.\n\nL'évaluation de l'accessibilité numérique est également essentielle dans ce processus. Elle comprend des tests utilisateurs pour s'assurer que tous les services numériques respectent les normes d'accessibilité établies. La version accessible d'un document garantit qu'il peut être utilisé par tous, y compris ceux ayant des handicaps. Les réclamations concernant l'accessibilité doivent également être prises en compte pour améliorer continuellement le service offert.\n\nEn parallèle, la gestion agile du projet favorise une flexibilité nécessaire face aux évolutions rapides du marché. Cela implique une communication continue entre les équipes ainsi qu'une coordination efficace lors du développement collaboratif. Le suivi de l'avancement permet également d'ajuster rapidement le tir si nécessaire.\n\nEnfin, il est crucial de définir des objectifs stratégiques clairs guidant le design et l'ergonomie en fonction des exigences utilisateurs. L'utilisation d'indicateurs clés de performance (KPI) permet d'évaluer le succès du projet tout en facilitant la prise de décisions éclairées basées sur des données concrètes. En somme, concevoir un projet de communication multicanal nécessite une approche holistique intégrant ces différents concepts afin d'assurer une interaction enrichissante avec les usagers.", "concepts": [{"concept": {"id": "9639a3d5-c874-4c14-9acd-54637974eae7", "label": "Contenus", "definition": "Les contenus désignent la qualité et la pertinence des informations et médias présentés sur un site web, qui sont essentiels pour répondre aux besoins des utilisateurs, attirer et retenir leur attention.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": ["4fed0e65-9f10-4101-9ab6-daa5c6feae5f"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les contenus sont au cœur d'un projet de communication multicanal, car leur qualité et pertinence déterminent directement l'engagement des utilisateurs à travers différents canaux."}, {"concept": {"id": "6120606d-278e-4565-98b8-539617ffb076", "label": "Média temporel", "definition": "Le média temporel est un contenu multimédia, tel que l'audio ou la vidéo, qui se déroule dans le temps et présente des informations de manière chronologique. Ce type de média inclut des éléments pré-enregistrés nécessitant des adaptations pour garantir leur accessibilité à tous les utilisateurs. Il peut également comprendre des vidéos et des animations qui exigent un contrôle utilisateur pour une consultation efficace, tout en pouvant être synchronisé avec d'autres formats pour enrichir l'information présentée. Utilisé dans divers contextes, le média temporel doit respecter des critères d'accessibilité spécifiques afin de faciliter la communication d'informations.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["4cfe3e60-c925-42bc-b119-3039b2749fd0", "2df08ee6-9aec-43cc-85db-183d578af82d", "734fb3be-3d4c-4e66-ae37-94f75dafb78d", "8f23a820-1893-475d-9021-9aca79a59383", "52cd9271-7273-4d63-a93f-0aaed1de7d20"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le média temporel joue un rôle central dans les projets de communication multicanal en enrichissant le contenu et en facilitant l'engagement des utilisateurs grâce à des formats dynamiques et accessibles."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les usagers doivent être au centre du processus de conception dans tout projet de communication, rendant ce concept fondamental et hautement pertinent."}, {"concept": {"id": "d5978979-95eb-4c2f-bbf0-34d3ca920f47", "label": "Objectifs stratégiques", "definition": "Buts définis par un site web ou une application qui guident le design et l'ergonomie en fonction des besoins des usagers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les objectifs stratégiques guident la conception et l'ergonomie d'un projet de communication multicanal, rendant ce concept fondamental et hautement pertinent."}, {"concept": {"id": "7c15d1a8-6a39-4bb9-b353-1112c86b8900", "label": "Communication digitale", "definition": "Échange d'informations via des plateformes numériques, nécessitant une ergonomie adaptée pour optimiser l'interaction.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Communication numérique", "definition": "La communication numérique, parfois appelée « communication digitale » (anglicisme), est un champ des sciences de l’information relatif à l'utilisation de l’ensemble des médias numériques : le web, les médias sociaux ou les terminaux mobiles par exemple. Ces médias sont utilisés comme des canaux de diffusion, de partage et de création d'informations.", "page_id": "5018281", "wikidata_id": "Q97368847", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La communication digitale est essentielle dans un projet de communication multicanal, car elle implique l'utilisation de plateformes numériques pour interagir avec le public cible."}, {"concept": {"id": "5b7b4dd7-8934-4844-b72c-ab548c3cebf9", "label": "Communication continue", "definition": "Échange régulier d'informations entre membres d'une équipe pour assurer cohérence et éviter conflits lors du développement collaboratif.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13654], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La communication continue favorise la cohérence et la collaboration au sein des équipes, ce qui est fondamental pour le succès d'un projet de communication multicanal."}, {"concept": {"id": "97773262-3ef9-493f-8aea-44b4ef91a06d", "label": "Marketing", "definition": "Discipline visant à promouvoir et vendre des produits ou services, incluant des stratégies comme le mass mailing, le suivi de campagnes sponsorisées, ainsi que des techniques pour attirer et fidéliser les clients dans un environnement concurrentiel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13707, 13710], "aliases": ["f5d04d30-82c0-4c13-a061-0e9142cd3990"], "wikientity": {"label": "Marketing", "definition": "Le marketing, ou la mercatique, est le processus d'identification des clients et de « création, communication, livraison et échange » de biens et services pour la satisfaction et la fidélisation de ces clients. C'est l'un des principaux composants de business management et du commerce.\nLe marketing est généralement réalisé par le vendeur, généralement un détaillant ou un fabricant.", "page_id": "26873", "wikidata_id": "Q39809", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Marketing", "definition": "the commercial processes involved in promoting and selling and distributing a product or service", "name": "marketing.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "Le marketing est central à la conception d'un projet de communication multicanal, car il englobe les stratégies nécessaires pour promouvoir et vendre des produits ou services à travers divers canaux."}, {"concept": {"id": "93243cf1-1c62-40e6-b2ac-c4f1322cfadb", "label": "Utilisabilité", "definition": "Mesure de l'efficacité et de la satisfaction d'une interface utilisateur, essentielle pour garantir une interaction fluide et intuitive.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": {"label": "Utilisabilité", "definition": "L’utilisabilité, ou encore aptitude à l'utilisation est définie par la norme ISO 9241-11 comme « le degré selon lequel un produit peut être utilisé, par des utilisateurs identifiés, pour atteindre des buts définis avec efficacité, efficience et satisfaction, dans un contexte d’utilisation spécifié ».\nC'est une notion proche de celle d'affordance, ou même d’ergonomie qui est cependant plus large.\nLes critères de l’utilisabilité sont :\n\nl’efficacité : le produit permet à ses utilisateurs d’atteindre le résultat prévu.", "page_id": "142385", "wikidata_id": "Q216378", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'utilisabilité est essentielle dans un projet de communication multicanal, car elle garantit que les utilisateurs peuvent interagir efficacement avec tous les canaux proposés."}, {"concept": {"id": "295d4059-ab79-4496-94b9-ee26862fda8d", "label": "Agilité", "definition": "L'agilité est une approche de gestion de projet qui privilégie la flexibilité et l'adaptation rapide aux changements, tout en impliquant continuellement les utilisateurs dans le développement. Elle se manifeste par la capacité d'une entreprise à réagir rapidement aux évolutions du marché, facilitée par des pratiques telles que DevOps et des cycles de développement courts, favorisant ainsi une meilleure collaboration et une livraison continue de valeur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13642, 13663], "aliases": ["8736dd75-20d4-4e7a-94b7-cd09772b6950", "b93ad9d5-b5e5-4a0d-a649-2fe3d41c482e"], "wikientity": {"label": "Management agile", "definition": "Le management agile est l'application des principes du développement agile de logiciels et du Lean Management à divers processus de gestion, notamment le développement de produits et la gestion de projets. Il peut être vu comme une organisation de type holistique et humaniste basée essentiellement sur la motivation rationnelle des ressources humaines. Son émergence, au début des années 1990, a été portée par la vague des nouvelles technologies (NTIC).", "page_id": "2751455", "wikidata_id": "Q556396", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Agilité", "definition": "the gracefulness of a person or animal that is quick and nimble", "name": "agility.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "L'agilité est cruciale pour concevoir et gérer efficacement un projet de communication multicanal, car elle permet une adaptation rapide aux besoins changeants des utilisateurs et du marché."}, {"concept": {"id": "74af9aa5-bfae-4e80-80d1-95a93d803eca", "label": "Média non temporel", "definition": "Un média non temporel est un type de contenu statique qui ne dépend pas du temps pour sa consultation, permettant une interaction à travers divers dispositifs. Cela inclut des éléments tels que des images, des tableaux, des cartes interactives et des diaporamas, qui peuvent être consultés sans déroulement temporel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["e39ff41e-2a23-4a5c-bab2-9639401ab497"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le média non temporel est très pertinent car il représente une forme essentielle de contenu utilisé dans les projets de communication multicanal."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "'La lisibilité' est cruciale pour toute forme de communication écrite et visuelle. Elle impacte directement l'efficacité des messages transmis dans un projet multicanal."}, {"concept": {"id": "508e59d0-7579-4592-80fd-c6d25c20e116", "label": "Évaluation de l'accessibilité numérique et conformité", "definition": "L'évaluation de l'accessibilité numérique et conformité englobe à la fois des tests utilisateurs impliquant des évaluations pratiques par des utilisateurs réels, y compris ceux en situation de handicap, pour mesurer l'efficacité des services numériques, ainsi que des audits systématiques visant à déterminer si un site web ou une application respecte les normes d'accessibilité établies telles que les WCAG et le RGAA. Ces évaluations incluent le contrôle utilisateur permettant aux utilisateurs de gérer les éléments multimédias selon leurs préférences, tout en vérifiant la conformité des éléments d'une page pour garantir qu'ils répondent aux critères nécessaires pour être accessibles à tous les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13708], "aliases": ["891f6388-a63e-4be6-8ab0-bf5c24dbb403", "0fd3853a-3bed-480a-9ecf-ffb0e73d711f", "7f5d7ff9-99bb-42c1-87c0-ef1900f6dfe1", "661dc91d-3db3-46cc-9aa1-b713ee263478", "7542f898-8b6f-4a03-86bc-3217ef289dfe", "12bef637-5431-4b9d-9d5f-e109daf6bc2a", "f8ab9cdc-92b3-4de9-b6ed-fd218181bc0e"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'évaluation de l'accessibilité numérique et conformité est essentielle pour garantir que les projets de communication multicanal soient accessibles à tous les utilisateurs, ce qui en fait un concept très pertinent."}, {"concept": {"id": "014a978d-3545-4c6c-b114-f50b1e083ec9", "label": "Version accessible", "definition": "Document ou fichier rendu conforme aux normes d'accessibilité, permettant une utilisation optimale par tous les utilisateurs, y compris ceux ayant des handicaps.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Une version accessible est cruciale pour garantir que tous les utilisateurs peuvent interagir avec le contenu du projet de communication, rendant ce concept très pertinent."}, {"concept": {"id": "287ef751-850a-45f8-8aea-12aa5b7582a2", "label": "Webmarketing", "definition": "Le webmarketing désigne l'ensemble des techniques marketing appliquées sur Internet, incluant le mobile marketing, pour promouvoir efficacement des produits ou services et atteindre les utilisateurs mobiles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13710], "aliases": ["b6c20415-9ad7-46af-aa62-7a735d5564d4"], "wikientity": {"label": "Webmarketing", "definition": "Le webmarketing (ou netmarketing ou cybermarketing - termes obsolètes) est une sous-catégorie du marketing digital qui se concentre spécifiquement sur les activités de marketing en ligne. Le marketing digital, quant à lui, englobe toutes les formes de marketing numérique, qu'elles soient en ligne ou hors ligne, et utilise une gamme de canaux et de technologies pour atteindre les consommateurs. Le webmarketing a pour objectif d'améliorer la visibilité et le trafic d'un site Web en utilisant Internet comme principal canal de prospection.", "page_id": "499657", "wikidata_id": "Q3008173", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le webmarketing est central à tout projet de communication multicanal car il englobe les techniques nécessaires pour atteindre et engager le public cible sur différentes plateformes."}, {"concept": {"id": "bf9dcd29-03f3-4cd8-a076-8331895e019d", "label": "KPI (Indicateurs Clés de Performance)", "definition": "Les KPI, ou Indicateurs Clés de Performance, sont des mesures quantifiables utilisées pour évaluer le succès et l'efficacité d'un produit, service ou stratégie marketing. Ils jouent un rôle essentiel dans le suivi des performances des équipes, notamment dans les objectifs DevOps, en facilitant la prise de décisions éclairées et en permettant d'ajuster les actions si nécessaire.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676, 13644], "aliases": ["87e70941-61ac-4056-9449-16f5a2eb30de", "73f1aa64-cede-40bc-b84c-46a66b3d5549"], "wikientity": {"label": "Indicateur clé de performance", "definition": "Un indicateur clé de performance (ICP) – en anglais : key performance indicator (KPI) – est un indicateur utilisé pour l'aide à la décision dans les organisations. Les ICP sont utilisés particulièrement en gestion de la performance organisationnelle.", "page_id": "1432151", "wikidata_id": "Q860554", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les KPI sont essentiels pour évaluer le succès d'une stratégie de communication multicanal et ajuster les actions en fonction des résultats obtenus."}, {"concept": {"id": "d1399dcb-0f7a-440f-b595-a2d69301f387", "label": "Livraison Continue", "definition": "La Livraison Continue est une pratique et un processus d'amélioration continue qui consiste à livrer fréquemment des mises à jour logicielles tout en maintenant un état toujours prêt à être déployé en production. Cela est réalisé grâce à des tests fréquents et une intégration régulière, ce qui réduit les risques et permet un retour rapide sur les modifications, tout en garantissant que les utilisateurs finaux reçoivent ces mises à jour avec un minimum d'interruption.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13642, 13645, 13659], "aliases": ["b6b2bea5-221a-407c-b95d-0de8e8672072", "4a407511-a52c-4109-a984-f6a4a2157b72"], "wikientity": {"label": "Livraison continue", "definition": "La livraison continue (en anglais : continuous delivery, CD) est une approche d’ingénierie logicielle dans laquelle les équipes produisent des logiciels ans des cycles courts, ce qui permet de le mettre à disposition à n’importe quel moment. Le but est de construire, tester et diffuser un logiciel plus rapidement.\nL’approche aide à réduire le temps d'évaluation des risques, et les risques associés à la livraison de changement en adoptant une approche plus incrémentielle des modifications en production.", "page_id": "10770792", "wikidata_id": "Q2507377", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "La livraison continue est très pertinente pour un projet de communication multicanal car elle permet une mise à jour rapide et efficace des contenus tout en maintenant une qualité constante grâce à des tests fréquents."}, {"concept": {"id": "65a2d925-96a7-48d0-94eb-7917f284ca13", "label": "Navigation", "definition": "La navigation, ou système de navigation, désigne le processus et les systèmes utilisés pour se déplacer efficacement et intuitivement à travers les différentes sections ou pages d'une interface web ou d'une application. Cela inclut l'utilisation de menus, de tables des matières, de plans du site et d'autres méthodes qui contribuent à une expérience fluide, à l'ergonomie, à la compréhension du site et à l'accessibilité. Les systèmes de navigation facilitent également la recherche d'informations via des moteurs de recherche intégrés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13666, 13708], "aliases": ["5f336d11-a83e-4c09-b404-30caf3494f2e", "c7ba75e2-9acf-40e4-b21f-c85f713d24b5", "79990658-2b4b-49e2-890e-ea7343e190ce", "886ea679-2ba8-4a0b-885b-281920a96a5e", "810c55c8-6be9-4b80-9b41-622b41ddf2e9"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "La navigation est cruciale pour un projet de communication multicanal car elle détermine comment les utilisateurs interagissent avec le contenu sur différentes plateformes."}, {"concept": {"id": "ec7a9773-d5da-4b5f-8ea4-be75a3e4eb3b", "label": "Gestion d'Événements", "definition": "La gestion d'événements désigne le processus par lequel les applications web interagissent avec les utilisateurs à travers des événements tels que des clics, des soumissions de formulaires ou des frappes au clavier. Cela inclut l'utilisation de fonctions JavaScript qui réagissent à ces actions et à d'autres événements comme mouseup ou touchend, permettant ainsi une interactivité dynamique et essentielle pour améliorer l'expérience utilisateur dans les applications web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13666, 13708], "aliases": ["4a3ccbaf-84b7-4a16-99ca-c6adc36ac179", "ac1a125e-c3a4-407e-8999-2387b0c3aff8", "4d2802a3-dcaf-4d14-95a4-e62d0ad14be8"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Gestion d'Événements' est essentielle pour interagir avec les utilisateurs dans un projet multicanal, rendant l'expérience utilisateur dynamique et engageante."}, {"concept": {"id": "2172016e-bb68-48f3-9747-553c8e14c159", "label": "Réclamations", "definition": "Demandes formelles faites par les utilisateurs concernant l'accessibilité des services en ligne, permettant de signaler des problèmes ou des manquements.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les réclamations concernant l'accessibilité sont essentielles à prendre en compte lors de la conception d'un projet multicanal afin d'assurer que tous les utilisateurs puissent accéder aux services offerts."}, {"concept": {"id": "a3e4a324-8a40-4d42-90c1-995c08e2c180", "label": "Suivi de l'avancement", "definition": "Pratique consistant à monitorer régulièrement les progrès réalisés dans un projet afin d'assurer une bonne gestion du temps et des ressources.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13635], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le suivi de l'avancement est crucial pour gérer efficacement un projet, permettant d'assurer que les objectifs de communication sont atteints dans les délais impartis."}, {"concept": {"id": "991e534d-656c-4e1f-b591-407211354ea5", "label": "Coordination entre équipes", "definition": "La collaboration nécessaire entre les équipes de développement, test et exploitation pour assurer une transition fluide entre les différents environnements.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13656], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La coordination entre équipes est essentielle pour assurer que tous les aspects du projet sont alignés et fonctionnent ensemble efficacement."}, {"concept": {"id": "78538d75-6f04-4f07-a015-e6fc99f5b5a1", "label": "Exigences utilisateurs", "definition": "Critères fondamentaux que les utilisateurs attendent d'un site web, incluant visibilité, perception, technique, contenus et services.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les exigences utilisateurs sont cruciales pour concevoir un projet efficace, car elles définissent ce que les utilisateurs attendent réellement du produit final."}, {"concept": {"id": "25d8b085-b1a7-41fe-a903-4ee8101bb8c2", "label": "projets critiques", "definition": "Initiatives essentielles au succès opérationnel d'une entreprise, nécessitant une attention particulière en raison de leur impact potentiel sur les résultats financiers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13627], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les projets critiques sont directement liés à la gestion et à la réussite des initiatives importantes comme celles liées à la communication multicanal, ce qui en fait un concept très pertinent."}, {"concept": {"id": "77e5ae9a-6d43-443b-8de9-fe1cbea5f1b4", "label": "Intitulé visible", "definition": "Texte affiché sur un bouton ou un lien, servant d'étiquette pour un champ de formulaire, essentiel pour l'accessibilité et la navigation utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'intitulé visible est crucial pour l'accessibilité et la navigation utilisateur dans un projet de communication multicanal, car il améliore l'expérience utilisateur sur différentes plateformes."}, {"concept": {"id": "b7f243a6-eb18-41d5-8c7d-26f0677e5db2", "label": "Services de communication au public en ligne", "definition": "Mise à disposition du public de contenus via des procédés électroniques, excluant la correspondance privée.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les services de communication au public en ligne sont directement liés à un projet multicanal, car ils impliquent la diffusion d'informations via divers moyens électroniques."}, {"concept": {"id": "5b5b67d8-d1bb-4024-8e9f-9d246df2d7a7", "label": "Critère 4.8", "definition": "Exigence selon laquelle chaque média non temporel doit avoir une alternative accessible si nécessaire.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le critère d'accessibilité des médias est très pertinent pour un projet de communication multicanal, car il garantit que tous les utilisateurs peuvent accéder au contenu, ce qui est essentiel dans une approche inclusive."}, {"concept": {"id": "9d54c769-32af-4dfb-bf56-1878ed64d5e5", "label": "Perception des informations", "definition": "Capacité à interpréter et comprendre les données présentées dans une interface; cruciale pour une navigation efficace.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La perception des informations est cruciale pour une interface utilisateur efficace dans un projet de communication multicanal, car elle affecte l'expérience utilisateur."}, {"concept": {"id": "7cff2f67-e7cc-4264-ade4-2d0d96f0cadb", "label": "Outils de design web", "definition": "Logiciels utilisés par les designers pour créer des interfaces utilisateur attrayantes et fonctionnelles, tels que Adobe XD ou Figma.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les outils de design web sont essentiels pour créer des interfaces attrayantes dans un projet de communication multicanal, ce qui en fait un concept très pertinent."}, {"concept": {"id": "25607d68-d4d4-4728-aeb8-1efc423cda6b", "label": "Compatibilité avec les technologies d'assistance", "definition": "Capacité d'un contenu à fonctionner avec des outils facilitant l'accès pour les utilisateurs ayant des besoins spécifiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La compatibilité avec les technologies d'assistance est cruciale pour assurer que le contenu soit accessible aux utilisateurs ayant des besoins spécifiques, ce qui est fondamental dans un projet de communication multicanal."}, {"concept": {"id": "b5030c9d-54f4-4aab-bd56-a2a4cc97d1f5", "label": "Test de contraste", "definition": "Évaluations spécifiques pour mesurer si le rapport de contraste entre le texte et l'arrière-plan respecte les normes d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le test de contraste est important pour s'assurer que le contenu visuel respecte les normes d'accessibilité, ce qui est essentiel dans tout projet visant une large audience."}, {"concept": {"id": "98fdf280-0e65-49d1-b38d-1c9e7b030c03", "label": "LanguageContext", "definition": "Un contexte spécifique créé pour gérer et partager les préférences linguistiques ou la langue sélectionnée au sein d'une application multilingue, améliorant l'expérience utilisateur et l'accessibilité des données.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13669, 13668], "aliases": ["c372c533-46da-4387-8fd5-0ba4eb46d997"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "LanguageContext est très pertinent car il traite de la gestion des préférences linguistiques dans une application multilingue, ce qui est essentiel pour un projet de communication multicanal."}, {"concept": {"id": "b9d7c7c8-1112-4815-b5b4-98b68859e1a9", "label": "Système de navigation multiple", "definition": "Un système de navigation multiple implique plusieurs moyens d'accéder au contenu d'un site web, améliorant ainsi l'accessibilité et l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un système de navigation multiple améliore l'expérience utilisateur et l'accessibilité dans un projet de communication multicanal, ce qui en fait un concept très pertinent."}, {"concept": {"id": "bbec4b6c-ecb2-4980-a828-4ea2e6a15f47", "label": "Cohérence", "definition": "Uniformité dans le design et les interactions au sein d'une interface ou d'une application, favorisant une meilleure compréhension et garantissant une expérience fluide pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["df6e29c5-d22e-4955-90b8-9e1627d2e164"], "wikientity": null, "wordnetentity": {"label": "Cohérence", "definition": "a harmonious uniformity or agreement among things or parts", "name": "consistency.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "La cohérence est cruciale dans un projet de communication multicanal pour assurer une expérience utilisateur fluide et harmonieuse à travers différents canaux."}, {"concept": {"id": "6950796e-29f2-4064-93d6-b57b697a2787", "label": "Amélioration continue", "definition": "Processus et philosophie d'optimisation régulière et continue des processus et produits, fondée sur les retours d'expérience et les contributions, visant à améliorer la qualité du contenu ou du produit final, particulièrement cruciale dans des environnements tels que DevOps pour s'adapter aux changements rapides du marché.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13635, 13642], "aliases": ["14cad394-b64e-4ba1-8087-ed70164c8744"], "wikientity": {"label": "Processus d'amélioration continue", "definition": "Le processus d'amélioration continue consiste en un effort continu pour améliorer les produits, les services ou les processus. Ces efforts peuvent viser à apporter des petites améliorations à intervalles réguliers (de façon incrémentale) ou, au contraire, à regrouper toutes les améliorations dans une implémentation globale. L'efficience, la praticabilité et la flexibilité des processus ayant un impact sur le client sont constamment évalués et améliorés.", "page_id": "9321400", "wikidata_id": "Q1318104", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'amélioration continue est cruciale pour gérer efficacement un projet de communication multicanal, permettant d'adapter les stratégies en fonction des retours et évolutions du marché."}, {"concept": {"id": "0b0d2c62-46f8-451f-beea-e49362979252", "label": "Accès rapide", "definition": "Liens facilitant un accès direct à des zones spécifiques dans une page web, optimisant la navigation pour les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'accès rapide est essentiel pour optimiser l'expérience utilisateur dans un projet de communication multicanal, facilitant la navigation et l'interaction avec le contenu."}, {"concept": {"id": "c9ee01fb-bf8c-4856-bac0-1ac34883ec8c", "label": "Plan du site", "definition": "Page web listant l'arborescence et les liens vers toutes les sections d'un site, servant de guide pour les utilisateurs et facilitant la navigation ainsi que le référencement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["6526f8bb-9abe-4a56-a20a-7c21a1f4b951"], "wikientity": {"label": "Plan de site", "definition": "Un plan du site (sitemap en anglais) est une représentation de l'architecture d'un site Internet qui liste les ressources proposées, en général sous forme hiérarchique. Il s'agit le plus souvent d'une page web qui permet à l'internaute d'accéder rapidement à l'ensemble des pages proposées à la lecture, et facilite le travail des robots d'indexation.\nGoogle a proposé un protocole nommé Sitemaps en 2005.", "page_id": "424174", "wikidata_id": "Q1503327", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "Le plan du site aide à structurer et guider les utilisateurs à travers un site web, ce qui est fondamental pour une bonne expérience utilisateur dans un projet de communication multicanal."}, {"concept": {"id": "0dddae51-ce19-42d5-a47b-e48f7783a11a", "label": "Données client master", "definition": "Informations essentielles sur les clients utilisées pour la gestion des relations commerciales.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13615], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les données client master sont cruciales pour concevoir un projet de communication multicanal, car elles permettent de personnaliser les messages et d'améliorer l'engagement des clients."}, {"concept": {"id": "31ac4ee4-538f-4368-a749-fa9f3a27306e", "label": "Environnement maîtrisé", "definition": "Un cadre où l'accès à l'information et aux technologies est contrôlé, garantissant la compatibilité des outils utilisés par les utilisateurs, notamment ceux en situation de handicap.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un environnement maîtrisé est crucial pour garantir que tous les utilisateurs aient accès aux outils nécessaires dans un projet de communication multicanal, surtout ceux en situation de handicap."}, {"concept": {"id": "a1be02e7-3ebb-4e47-b321-ff67b13706b9", "label": "<embed>", "definition": "La balise <embed> est une balise HTML utilisée pour intégrer des contenus multimédias externes, tels que des images ou des vidéos, dans une page web. Elle nécessite souvent une description adéquate pour garantir l'accessibilité, car elle peut être utilisée sans alternative textuelle, ce qui pose des défis pour les utilisateurs ayant des besoins d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["301bc082-9f69-441e-86c6-34d6be648193"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "<embed> est pertinent car l'intégration de contenus multimédias est essentielle dans un projet de communication multicanal pour enrichir l'expérience utilisateur."}, {"concept": {"id": "f009e74d-6c5b-4761-b732-969300d62140", "label": "Alternative accessible", "definition": "Version d'un contenu qui permet aux utilisateurs ayant des besoins spécifiques d'accéder à la même information ou fonctionnalité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'alternative accessible est très pertinente pour garantir que tous les utilisateurs peuvent accéder à la communication multicanal, ce qui est essentiel dans la conception inclusive."}, {"concept": {"id": "765119bf-2c7a-4658-9713-766607a4c90e", "label": "Découpage", "definition": "Le découpage est une stratégie d'organisation qui consiste à diviser des tâches complexes ou un programme en unités logiques distinctes et plus simples. Cette technique facilite la compréhension, l'exécution et la gestion des éléments du code, tout en améliorant les tests et l'évolution du logiciel. Elle est particulièrement adaptée à la complexité des fonctionnalités, permettant ainsi de rendre chaque étape plus accessible pour les développeurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13611, 13709], "aliases": ["2cf56446-3da1-41e2-bca9-912cbdd81855", "ad71e5f2-bbd5-4aeb-bafd-c09cf075af1e"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le découpage est pertinent pour la gestion de projets, car il aide à organiser les tâches complexes en unités plus simples, facilitant ainsi la planification et l'exécution d'un projet de communication."}, {"concept": {"id": "04d75263-90f3-4c5f-afb0-72168b1d10dc", "label": "Mécanisme d'affichage", "definition": "Outils ou options permettant aux utilisateurs d'ajuster la présentation du contenu, notamment le contraste des couleurs sur les pages web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le mécanisme d'affichage est pertinent car il touche à l'expérience utilisateur dans un projet de communication, en permettant une meilleure accessibilité et présentation du contenu."}, {"concept": {"id": "ccac2828-c554-4d5b-b5aa-f4e12378c430", "label": "Changement Culturel", "definition": "Adaptation nécessaire au sein d'une organisation pour favoriser une collaboration accrue entre développement et exploitation lors du CD.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13659], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le changement culturel est important pour favoriser une collaboration efficace dans tout projet, y compris ceux liés à la communication multicanal."}, {"concept": {"id": "1d364354-26a0-45aa-88a0-c42d12a9ff86", "label": "Système de réservation", "definition": "Plateforme numérique permettant aux utilisateurs de planifier et gérer des rendez-vous ou créneaux horaires.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13615], "aliases": [], "wikientity": {"label": "Système de réservation informatique", "definition": "Les systèmes de réservation informatique (en anglais, computer reservations systems ou CRS) permettent de réserver une ressource ou un service dans le temps pour une personne ou un groupe. Ces systèmes s'intègrent dans les domaines de l'immobilier (chambre, salle de conférence, court de tennis), du transport (voiture, train, bateau, avion), de l'outillage (scie, grue) sous forme de mise à disposition (location, prêt) à partir d'une plage horaire déterminée avec selon le cas, en option, le recours aux services d'une ou plusieurs personnes. Ces systèmes de gestion utilisés en interne sous forme de logiciel peuvent, selon les domaines, être directement accessibles aux personnes non professionnelles grâce au développement de serveurs web accessibles depuis un navigateur.", "page_id": "512375", "wikidata_id": "Q1122556", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Un système de réservation peut faire partie intégrante d'une stratégie de communication multicanal en facilitant l'interaction avec les utilisateurs."}, {"concept": {"id": "f8e3b58f-4b8d-4287-b4f5-b3148cebb106", "label": "Regroupement de champs", "definition": "Le regroupement de champs est une organisation logique d'éléments similaires dans un formulaire, consistant à regrouper plusieurs champs sous une même légende ou étiquette pour améliorer la clarté et l'expérience utilisateur en clarifiant leur relation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["a428dddd-c5e2-41bf-9ecd-54d90f8b6bff"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le regroupement de champs améliore l'expérience utilisateur et la clarté des formulaires, ce qui est pertinent pour une bonne communication dans les projets numériques."}, {"concept": {"id": "1d12b37a-39b8-4cdb-a08f-40ddbca22d1c", "label": "Plan d'action annuel", "definition": "Document détaillant les mesures spécifiques à mettre en œuvre chaque année pour améliorer l'accessibilité numérique au sein d'une entité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un plan d'action annuel pour améliorer l'accessibilité numérique est très pertinent car il structure les efforts nécessaires pour garantir que le projet reste inclusif au fil du temps."}, {"concept": {"id": "a6b2b424-96d2-44e9-a1be-41569d34d757", "label": "Métriques", "definition": "Les métriques sont des mesures quantitatives des performances d'un système, essentielles pour l'analyse et l'optimisation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13655], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les métriques sont essentielles pour évaluer les performances d'une campagne de communication multicanal et peuvent aider à optimiser les résultats."}, {"concept": {"id": "82c87826-c4d7-47f9-8ede-22da4f9ec563", "label": "Audit", "definition": "Process d'évaluation systématique de la conformité et de la qualité des services ou contenus, souvent utilisé pour garantir l'accessibilité et le respect des normes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": {"label": "Audit", "definition": "L’audit est une démarche méthodique effectuée par un agent compétent et indépendant, intègre et  professionnel dans le but de porter un jugement par rapport à une norme sur les états financiers, le contrôle interne, l'organisation, la procédure, ou une opération quelconque d'une entité en se basant sur un référentiel de qualité.\nIl s'agit donc d'opérations d'évaluations, d'investigations, de vérifications ou de contrôles, regroupées sous le terme d’audit en raison d'exigences réglementaires ou normatives. En effet, ces exigences imposent que ces opérations correspondent à des procédures écrites avec des responsables identifiés, ce qui explique l'apparition de ce terme en français.", "page_id": "135045", "wikidata_id": "Q181487", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'audit est pertinent car il permet d'évaluer la qualité et l'accessibilité des contenus produits dans le cadre du projet de communication."}, {"concept": {"id": "3f7470d7-442d-4922-9f23-70be2de8c8c8", "label": "Accessibilité des contenus visuels", "definition": "L'accessibilité des contenus visuels se réfère à la fourniture de descriptions textuelles pour les images et éléments graphiques, permettant aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, de comprendre le contenu visuel lorsque celui-ci ne peut pas être affiché. Cela inclut l'utilisation d'attributs alternatifs en HTML qui décrivent ces images, ainsi que la mise à disposition de contenu ou fonctionnalités équivalentes lorsque certaines conditions ne sont pas remplies, garantissant ainsi une accessibilité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7f9d95fb-80ae-4ce9-b4ad-ed8ff0eab829", "104cae17-0a9a-49b6-9395-a7a4af1f4c39", "963fcb43-959a-46ac-8a0e-df703abd85f0", "88400249-4250-499f-b98d-a5cb498ee7cc", "5b26344a-b71c-4c0f-b03c-af99333bff27"], "wikientity": {"label": "Alternative textuelle", "definition": "L'alternative textuelle est un texte que l'on associe à un contenu graphique comme une image, une zone cliquable dans une image ou un élément de formulaire de type image, dans un site web ou dans un document produit par un logiciel d'une suite bureautique, pour que l'utilisateur qui ne peut visualiser l'image puisse être informé de ce qu'elle représente et signifie. L'alternative textuelle est restituée à la place de l'image quand celle-ci n'est pas consultable.\nL'alternative textuelle, dont l'emploi est obligatoire dans le cadre de l'accessibilité du web, concerne tant les personnes qui utilisent un navigateur textuel ou un lecteur d'écran, que celles qui, par choix ou à cause d'un problème technique, ne peuvent visualiser l'image.", "page_id": "7715605", "wikidata_id": "Q1067764", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'accessibilité des contenus visuels est essentielle dans un projet de communication multicanal pour s'assurer que tous les utilisateurs peuvent accéder aux informations, ce qui en fait un concept pertinent."}, {"concept": {"id": "0fe00098-4ded-46ba-bbb8-e730f61efb03", "label": "Workflow", "definition": "Un ensemble d'étapes automatisées définies dans un fichier YAML pour exécuter des tâches spécifiques, souvent utilisé dans l'intégration et le déploiement continus.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13648], "aliases": [], "wikientity": {"label": "Workflow", "definition": "Un workflow, flux de travaux ou encore flux opérationnel, est la représentation d'une suite de tâches ou d'opérations effectuées par une personne, un groupe de personnes, un organisme, etc. Le terme flow (« flux ») renvoie au passage du produit, du document, de l'information, etc., d'une étape à l'autre.", "page_id": "60928", "wikidata_id": "Q627335", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le workflow est important pour gérer efficacement les étapes d'un projet de communication multicanal, facilitant l'organisation et l'exécution des tâches nécessaires."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La description détaillée est importante pour l'accessibilité et enrichit le contenu visuel, ce qui est essentiel dans un projet de communication multicanal visant à atteindre divers publics, y compris ceux ayant des déficiences visuelles."}, {"concept": {"id": "075b744e-efc6-49a8-a497-f94161eb2b72", "label": "TalkBack", "definition": "Lecteur d'écran intégré sur Android permettant aux utilisateurs malvoyants de naviguer sur leurs appareils via des retours sonores.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Google TalkBack", "definition": "Google Talkback était un service d'accessibilité pour Android qui aidait les utilisateurs aveugles et malvoyants à interagir avec leurs appareils. Il utilisait des mots parlés, des vibrations et d’autres commentaires audibles pour permettre à l’utilisateur de savoir ce qui se passait sur l’écran lui permettant ainsi de mieux interagir avec son appareil. Le service était pré-installé sur de nombreux appareils Android.", "page_id": "12676216", "wikidata_id": "Q17990531", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "TalkBack est pertinent car il améliore l'accessibilité des contenus numériques sur Android, ce qui doit être pris en compte lors de la conception d'une stratégie de communication multicanal inclusive."}, {"concept": {"id": "db3e710e-bc6a-4c2d-8422-90a85b26c700", "label": "NVDA", "definition": "NonVisual Desktop Access; un lecteur d'écran gratuit permettant aux utilisateurs aveugles ou malvoyants d'accéder au contenu numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "NonVisual Desktop Access", "definition": "NonVisual Desktop Access (NVDA) est un lecteur d'écran libre et gratuit pour les utilisateurs de Windows. Il permet d'obtenir une synthèse vocale ou une version en braille du contenu disponible à l'écran, et ce pour les personnes ayant un handicap visuel.", "page_id": "12136771", "wikidata_id": "Q1116614", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "NVDA contribue également à l'accessibilité numérique essentielle pour un projet de communication multicanal, garantissant que le contenu soit accessible aux utilisateurs aveugles ou malvoyants."}, {"concept": {"id": "f32d10f7-7645-4d69-92a6-747fd8ccbfca", "label": "Sous-titres synchronisés", "definition": "Texte affiché à l'écran qui correspond au dialogue audio d'un média, affiché en temps réel pour fournir des informations audio essentielles, crucial pour les utilisateurs sourds ou malentendants et pour la compréhension générale du contenu.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["3dd25946-df3f-40a1-af49-e44ea377a8b9"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les sous-titres synchronisés améliorent l'accessibilité et l'engagement des utilisateurs dans des projets multimédias, ce qui est pertinent pour une approche multicanale."}, {"concept": {"id": "c895bd8e-c59b-4e62-bad6-9a5c25bae289", "label": "Internationalisation (i18n)", "definition": "Processus d'adaptation d'une application à différentes langues et cultures, facilité par Twig via la fonction 'trans'.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13618], "aliases": [], "wikientity": {"label": "Internationalisation (informatique)", "definition": "En développement de logiciel, l’internationalisation (abrégé en i18n, où 18 représente le nombre de caractères entre le i et le n dans le mot) est la mise en place d’un système permettant la régionalisation du logiciel, c’est-à-dire son adaptation à des langues et des cultures différentes. L’objectif de l’internationalisation est donc de produire un programme unique qui puisse inclure plusieurs langues pour l’interface.", "page_id": "638661", "wikidata_id": "Q12071165", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'internationalisation est pertinente pour un projet multicanal, car elle permet d'adapter le contenu aux différentes cultures et langues des utilisateurs cibles."}, {"concept": {"id": "515f5769-83d5-4766-ad3b-0c03f02f8d75", "label": "Critère 4.6", "definition": "Évaluation de la pertinence de l'audiodescription pour chaque média temporel pré-enregistré afin d'assurer une compréhension adéquate.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'évaluation de la pertinence de l'audiodescription est importante dans un projet de communication multicanal, car elle assure que le contenu est accessible à tous les utilisateurs, ce qui est essentiel pour une bonne compréhension des médias pré-enregistrés."}], "exercises": [{"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension de l'importance de l'ergonomie dans la conception d'un projet de communication multicanal, un concept clé mentionné dans la référence. L'affirmation souligne que les éléments ergonomiques doivent être choisis en fonction des usagers, ce qui est en adéquation avec le besoin d'une navigation intuitive et d'une lisibilité adaptée aux utilisateurs. La réponse correcte (Vrai) et l'explication fournie renforcent cette idée en insistant sur l'importance de baser les choix ergonomiques sur une étude des besoins des utilisateurs. Cependant, pour obtenir un score parfait, l'exercice pourrait inclure davantage d'aspects liés à la qualité du contenu ou à l'accessibilité numérique."}, {"exercise": {"id": "6b89fba93305401388bcb2cffc582eff", "question": "Quelle condition doit être remplie pour garantir l'accessibilité des technologies Web ?", "answers": ["Elles doivent être compatibles avec les technologies d'assistance des utilisateurs"], "distractors": ["Elles doivent être mises à jour régulièrement tous les mois.", "Elles doivent fonctionner uniquement sur des navigateurs propriétaires.", "Elles doivent être testées sur plusieurs dispositifs mobiles uniquement.", "Elles doivent répondre à des normes internes de chaque entreprise.", "Elles doivent utiliser exclusivement HTML5 et JavaScript.", "Elles doivent être validées par un organisme gouvernemental spécifique.", "Elles doivent s'adapter en temps réel à la demande des utilisateurs.", "Elles doivent être développées par des entreprises technologiques reconnues.", "Elles doivent inclure obligatoirement des modules d'apprentissage automatisé."], "feedback": "Pour garantir l'accessibilité des technologies Web, il est essentiel de s'assurer qu'elles sont compatibles avec les technologies d'assistance utilisées par les utilisateurs en situation de handicap. Cela signifie que ces technologies ont été testées pour fonctionner avec des aides telles que les lecteurs d'écran ou les claviers adaptés.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "27f13d2e457944da8c7af4446bba83d7", "order": 11.0, "image_url": null, "origin_type": "document_content", "text": "· La façon dont la technologie Web est utilisée doit être compatible avec les technologies d'assistance des utilisateurs. Cela signifie que la façon dont la technologie est utilisée a été testée dans une perspective d'interopérabilité avec des utilisateurs des technologies d'assistance dans la ou les langues du contenu ; · La technologie fonctionne de façon native dans des agents utilisateurs largement distribués qui sont, eux-mêmes, compatibles avec l'accessibilité (comme HTML et CSS) ou avec un module d'extension largement distribué qui est, lui-même, compatible avec l'accessibilité. La vérification de la compatibilité avec les technologies d'assistance nécessite de réaliser un certain nombre de tests spécifiques à la technologie utilisée, par exemple :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "28c56f67c7a746bfa40581950f185ff7", "next_id": "aabbd50d483f45488235717b17768911", "prev_id": "6ae4e0b6f4a24c0190da16dc5eee71e4", "associated_block_ids": [], "first_page": 93, "last_page": 93, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue directement la compréhension d'un aspect clé de la conception d'un projet de communication multicanal, à savoir l'accessibilité numérique. La question posée cible spécifiquement une condition essentielle pour garantir cette accessibilité, qui est la compatibilité avec les technologies d'assistance. Cela reflète bien le contenu de la synthèse, qui souligne l'importance des tests utilisateurs et du respect des normes d'accessibilité. L'explication fournie renforce cette pertinence en précisant ce que signifie être compatible avec ces technologies. Cependant, il aurait été bénéfique d'inclure une dimension sur l'ergonomie ou la qualité des contenus pour obtenir un score parfait."}, {"exercise": {"id": "9b0002c598914db88ae11e0b8a9c17bc", "question": "Dans quel cas le critère d'accessibilité pour les médias temporels est-il non applicable ?", "answers": ["Lorsqu'il est utilisé à des fins purement décoratives sans apport informatif"], "distractors": ["Lorsqu'il est diffusé exclusivement sur des plateformes payantes", "S'il est utilisé dans un cadre pédagogique formel", "Lorsque son contenu est limité à des images fixes", "S'il contient moins de deux éléments auditifs distincts", "Uniquement s'il ne comporte pas de sous-titres", "Si le média n'est disponible qu'en langue étrangère", "Lorsqu'il s'adresse à une audience minoritaire", "Uniquement s'il est destiné à des professionnels de la communication", "Lorsqu'il est téléchargeable via un site sécurisé"], "feedback": "Dans le cas où un média temporel est utilisé uniquement à des fins décoratives, c'est-à-dire sans apporter d'information, le critère d'accessibilité n'est pas applicable. Cela s'applique même si le média a été publié après le 23 septembre 2020 ou s'il est produit par une institution gouvernementale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9d418fe6e181493a95118b00fa67570d", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": ". Pour les personnes de droit privé mentionnées aux 2° à 4° du I de l'article 47 de la loi du 11 février 2005 : si le média temporel a été publié avant le 23 septembre 2020, il est exempté de l'obligation d'accessibilité. Il existe une gestion de cas particulier lorsque le média temporel est utilisé à des fins décoratives (c'est-à-dire qu'il n'apporte aucune information). Dans cette situation, le critère est non applicable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "20c625cf818d4f95b9da1107913afa57", "next_id": "17694e721574476999ab219a3b845d8c", "prev_id": null, "associated_block_ids": [], "first_page": 37, "last_page": 39, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des critères d'accessibilité, un aspect fondamental de la conception d'un projet de communication multicanal. La question posée cible spécifiquement les médias temporels et leur utilisation, ce qui est en lien direct avec l'importance de l'accessibilité numérique mentionnée dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments sur l'ergonomie ou la qualité des contenus pour couvrir plus largement les concepts clés abordés dans la référence."}, {"exercise": {"id": "6fbefc8b21124f90954a16ed31e00118", "statement": "[Nom du site web de l'application mobile] est en conformité avec le référentiel général d'amélioration de l'accessibilité.", "veracity": false, "feedback": "Le site ou service mentionné n'est pas en conformité avec le référentiel général d'amélioration de l'accessibilité ou un autre protocole de test. Les non-conformités et/ou dérogations sont clairement spécifiées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f67baaba41e14acf9acafe5f0632cb4d", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "(c) [Nom du site web de l'application mobile, ou d'un autre service concerné] n'est pas en conformité avec [pour les sites : le référentiel général d'amélioration de l'accessibilité / autre protocole de test utilisé ; pour les autres services de communication : protocole de test utilisé]. [La/les non-conformité(s)] [et/ou] [les dérogations] sont énumérées ci-dessous.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "92cc7fbe594a4535974c06a011c622e3", "next_id": "f878dcc4491046a3a6d3ff4b9b444585", "prev_id": "9fa4d408c993495aa6242cb347297f88", "associated_block_ids": [], "first_page": 13, "last_page": 13, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, qui est un aspect fondamental de la conception d'un projet de communication multicanal. En demandant à l'apprenant d'évaluer la conformité d'un site web avec les normes d'accessibilité, il teste sa capacité à identifier des éléments critiques liés à l'expérience utilisateur et à l'ergonomie. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, tels que la qualité des contenus ou la gestion agile du projet. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "53d526528ec44978b089dcd356a1fef3", "statement": "[Nom de l'organisme concerné] doit rendre son site web et application mobile accessibles selon les normes de la loi du 11 février 2005.", "veracity": true, "feedback": "L'organisme est effectivement tenu de rendre ses plateformes numériques accessibles en vertu de l'article 47 de la loi nº 2005-102, qui vise à garantir l'accessibilité numérique aux personnes en situation de handicap.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "42874f20f7da4c4688a20acbd27467d1", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "[Nom de l'organisme concerné] s'engage à rendre [son (ses) site(s) internet, intranet, extranet et son (ses) application(s) mobile(s), etc.] accessibles conformément à l'article 47 de la loi nº 2005-102 du 11 février 2005. Cette déclaration d'accessibilité s'applique à [Nom du site web de l'application mobile, ou d'un autre service auquel la déclaration s'applique].", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "05b1d8bea9ad4541b57958f355b40036", "next_id": "7c0e8e518b6f4786bc8eaf7729d3929d", "prev_id": "05b1d8bea9ad4541b57958f355b40036", "associated_block_ids": [], "first_page": 13, "last_page": 13, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité numérique, un aspect fondamental mentionné dans la synthèse. Il teste la connaissance des obligations légales en matière d'accessibilité, ce qui est pertinent pour concevoir un projet de communication multicanal. Cependant, il pourrait être amélioré en intégrant des éléments supplémentaires sur les autres thèmes abordés dans la référence, tels que la qualité des contenus ou l'ergonomie. Néanmoins, il reste très pertinent par rapport à l'objectif pédagogique."}, {"exercise": {"id": "458dffabe57e43d784bad2274d28e806", "statement": "L'utilisateur doit pouvoir accéder à toutes les fonctionnalités par la touche tabulation ou par un dispositif de pointage.", "veracity": true, "feedback": "Toutes les fonctionnalités doivent être accessibles soit via le clavier (notamment avec la touche de tabulation), soit via un dispositif de pointage, garantissant ainsi l'accessibilité pour différents types d'utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue un aspect clé de la référence, à savoir l'accessibilité numérique dans le cadre d'un projet de communication multicanal. L'affirmation porte sur l'importance d'assurer que toutes les fonctionnalités soient accessibles via différents moyens, ce qui est en ligne avec les thèmes abordés dans la synthèse concernant l'évaluation de l'accessibilité et les tests utilisateurs. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, comme la qualité des contenus ou l'ergonomie. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "3506bc0fa73340f583a57133ef4e98ff", "question": "Quelle solution WCAG juge acceptable pour faciliter l'accès des vidéos aux personnes aveugles ?", "answers": ["Offrir une version sonore en alternative à la vidéo"], "distractors": ["Ajouter des sous-titres à la vidéo", "Simplifier uniquement le contenu visuel de la vidéo", "Proposer des effets sonores supplémentaires", "Transcrire toutes les conversations en temps réel", "Utiliser la description vocale dans un deuxième fichier vidéo", "Convertir la vidéo en images séquentielles", "Créer des animations avec bruitages ajoutés", "Créer un doublage audio avec un narrateur", "Remplacer totalement la vidéo par un texte explicatif"], "feedback": "La version sonore en alternative permet aux personnes aveugles d'accéder aux informations audio de la vidéo. Les autres propositions ne sont pas aussi efficaces que la transcription textuelle qui assure un accès universel à toutes les informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d7a5b4bd76ef4e1ea6681ca21cac0834", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Une version « audio seulement » est une version sonore, sous la forme d'un simple fichier au format MP3 par exemple, utilisée comme alternative à une vidéo seulement (vidéo sans information sonore). Les seuls utilisateurs impactés par l'accessibilité étant les personnes aveugles, qui ne peuvent pas voir la vidéo, WCAG considère comme acceptable de proposer en alternative une version sonore. Généralement il est plus simple de produire une version sonore qu'une version textuelle lorsque la vidéo est très descriptive (la transcription textuelle nécessitant souvent un travail rédactionnel important). Il est rappelé, néanmoins, que seule la transcription textuelle assure un accès universel aux informations diffusées par la vidéo, dans le cas où un utilisateur ne serait pas en capacité de lancer la vidéo par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "911c7f9e9410478494ef0d3b3fa9ad62", "next_id": "4cec0185030d446d9395eb59623a4ece", "prev_id": "09180f02f56a4efd9e2bc339b428d1fc", "associated_block_ids": [], "first_page": 124, "last_page": 124, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes d'accessibilité numérique, en particulier en ce qui concerne l'accès aux contenus multimédias pour les personnes aveugles. Cela est directement lié à l'un des aspects fondamentaux de la conception d'un projet de communication multicanal, qui est l'évaluation de l'accessibilité numérique. La question cible spécifiquement une solution conforme aux WCAG (Web Content Accessibility Guidelines), ce qui montre une attention particulière à la qualité et à l'ergonomie du contenu proposé. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la synthèse, comme la gestion agile ou les objectifs stratégiques clairs. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'une interface utilisateur, ce qui est pertinent pour le projet de communication multicanal. La question cible un aspect crucial de l'ergonomie et de la navigation, en demandant ce qu'il faut éviter pour ne pas perdre l'utilisateur. La réponse correcte souligne l'importance de respecter les normes de référence, ce qui est en ligne avec les thèmes abordés dans la synthèse concernant la lisibilité et l'intuitivité. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant des éléments plus spécifiques sur les médias temporels et non temporels ou sur l'accessibilité numérique, afin d'évaluer une compréhension plus complète des différents aspects du projet."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes d'ergonomie et de lisibilité du contenu, qui sont des éléments clés dans la conception d'un projet de communication multicanal. En demandant à l'apprenant de juger la véracité d'une affirmation sur la visibilité des fonctions importantes d'une interface, il teste leur capacité à appliquer les concepts d'ergonomie pour améliorer l'expérience utilisateur. Cependant, bien que pertinent, l'exercice ne couvre pas tous les aspects mentionnés dans la synthèse, comme l'accessibilité numérique ou la gestion agile du projet, ce qui empêche une note parfaite."}, {"exercise": {"id": "3f3125ea525746ab9d1ba8abe78e34ad", "question": "Que nécessite la vérification de la compatibilité avec les technologies d'assistance ?", "answers": ["La réalisation de tests spécifiques à la technologie utilisée"], "distractors": ["La mise à jour régulière des navigateurs concernés.", "Une validation par l'organisme international d'accessibilité.", "L'utilisation d'un protocole de sécurité avancé.", "Une traduction dans toutes les langues disponibles.", "Le déploiement d'un matériel spécialisé pour les utilisateurs finaux.", "Une certification ISO de chaque composant technologique.", "L'intégration dans un système d'exploitation propriétaire.", "Le développement d'une version dédiée à chaque système d’exploitation.", "La réduction du code source à un format minimal."], "feedback": "La vérification de la compatibilité avec les technologies d'assistance nécessite de réaliser des tests spécifiques à la technologie utilisée. Il est donc important de tester la technologie sur différents dispositifs et navigateurs pour s'assurer qu'elle fonctionne correctement avec les aides techniques utilisées par les utilisateurs en situation de handicap.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "27f13d2e457944da8c7af4446bba83d7", "order": 11.0, "image_url": null, "origin_type": "document_content", "text": "· La façon dont la technologie Web est utilisée doit être compatible avec les technologies d'assistance des utilisateurs. Cela signifie que la façon dont la technologie est utilisée a été testée dans une perspective d'interopérabilité avec des utilisateurs des technologies d'assistance dans la ou les langues du contenu ; · La technologie fonctionne de façon native dans des agents utilisateurs largement distribués qui sont, eux-mêmes, compatibles avec l'accessibilité (comme HTML et CSS) ou avec un module d'extension largement distribué qui est, lui-même, compatible avec l'accessibilité. La vérification de la compatibilité avec les technologies d'assistance nécessite de réaliser un certain nombre de tests spécifiques à la technologie utilisée, par exemple :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "28c56f67c7a746bfa40581950f185ff7", "next_id": "aabbd50d483f45488235717b17768911", "prev_id": "6ae4e0b6f4a24c0190da16dc5eee71e4", "associated_block_ids": [], "first_page": 93, "last_page": 93, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, un aspect fondamental dans la conception d'un projet de communication multicanal. La question porte sur la vérification de la compatibilité avec les technologies d'assistance, ce qui est directement lié à l'évaluation de l'accessibilité mentionnée dans la synthèse. La réponse correcte souligne l'importance des tests spécifiques pour garantir que le contenu est accessible à tous les utilisateurs, y compris ceux ayant des handicaps. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects clés du projet de communication multicanal (comme l'ergonomie ou la qualité des contenus), ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "00f0d2991b8447319a5f168a44194282", "question": "Quelle conséquence un changement de contenu peut-il entraîner s'il n'est pas communiqué ?", "answers": ["Il peut désorienter l'utilisateur"], "distractors": ["Il peut augmenter la vitesse de navigation.", "Il peut causer une surcharge d'informations.", "Il peut améliorer l'accessibilité du site.", "Il peut réduire la lisibilité des informations.", "Il peut créer des conflits d'affichage avec le navigateur.", "Il peut ralentir la connexion internet de l'utilisateur.", "Il peut diminuer la taille des éléments de texte.", "Il peut altérer l'apparence visuelle du site.", "Il peut changer la langue du contenu affiché."], "feedback": "Lorsqu'un utilisateur navigue sur une page web, il s'attend à ce que les changements de contenu soient clairement indiqués afin qu'il puisse suivre et comprendre le contenu. Si un changement de contenu se produit sans communication préalable, cela peut désorienter l'utilisateur et rendre la navigation difficile.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1b6e162d5e2f4380a29d4fb90eee4c05", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Alternance de luminance relative qui peut causer des crises chez certaines personnes si leur taille est suffisamment importante dans une gamme de fréquences spécifiques. Changements majeurs dans le contenu d'une page web qui, s'ils sont faits sans que l'utilisateur n'en soit conscient, peuvent désorienter l'utilisateur qui ne peut voir l'ensemble de la page en même temps. Les changements de contexte comprennent les changements : Note : Un changement de contenu n'est pas toujours un changement de contexte. Un changement dans le contenu comme le déploiement d'une arborescence, un menu dynamique ou un déplacement de tabulation ne change pas nécessairement le contexte à moins qu'il ne change aussi l'un des éléments énumérés ci-dessus (le focus, par exemple).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f395ab95c8534fb4b0e16328bcd5efea", "next_id": "96b802b9bb684c1694c8ac8aed7a0e22", "prev_id": "f395ab95c8534fb4b0e16328bcd5efea", "associated_block_ids": [], "first_page": 92, "last_page": 92, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la communication des changements de contenu dans un projet de communication multicanal, ce qui est pertinent par rapport à la référence. La désorientation de l'utilisateur en cas de changement non communiqué touche directement à l'ergonomie et à l'expérience utilisateur, deux concepts clés mentionnés dans la synthèse. Cependant, bien que cela soit un aspect important, l'exercice pourrait être amélioré en intégrant d'autres dimensions comme l'accessibilité ou les objectifs stratégiques pour une évaluation plus complète des compétences liées à la conception d'un projet multicanal."}, {"exercise": {"id": "814ab53c52184611bf53e0f7efba06cb", "statement": "La compatibilité avec les technologies d'assistance nécessite la réalisation de plusieurs tests spécifiques en fonction de la technologie utilisée.", "veracity": true, "feedback": "Il est essentiel de réaliser des tests spécifiques à la technologie utilisée pour vérifier que celle-ci est compatible avec les technologies d'assistance. Cela permet de garantir une interopérabilité adéquate pour les utilisateurs bénéficiant d'outils d'assistance.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "27f13d2e457944da8c7af4446bba83d7", "order": 11.0, "image_url": null, "origin_type": "document_content", "text": "· La façon dont la technologie Web est utilisée doit être compatible avec les technologies d'assistance des utilisateurs. Cela signifie que la façon dont la technologie est utilisée a été testée dans une perspective d'interopérabilité avec des utilisateurs des technologies d'assistance dans la ou les langues du contenu ; · La technologie fonctionne de façon native dans des agents utilisateurs largement distribués qui sont, eux-mêmes, compatibles avec l'accessibilité (comme HTML et CSS) ou avec un module d'extension largement distribué qui est, lui-même, compatible avec l'accessibilité. La vérification de la compatibilité avec les technologies d'assistance nécessite de réaliser un certain nombre de tests spécifiques à la technologie utilisée, par exemple :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "28c56f67c7a746bfa40581950f185ff7", "next_id": "aabbd50d483f45488235717b17768911", "prev_id": "6ae4e0b6f4a24c0190da16dc5eee71e4", "associated_block_ids": [], "first_page": 93, "last_page": 93, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, qui est un aspect fondamental dans la conception d'un projet de communication multicanal. La question sur la compatibilité avec les technologies d'assistance et l'importance des tests spécifiques reflète bien les thèmes abordés dans la synthèse, notamment l'évaluation de l'accessibilité et le respect des normes pour garantir une expérience utilisateur optimale. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à la qualité des contenus ou à l'ergonomie, ce qui lui empêche d'obtenir un score parfait."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la clarté et de la cohérence dans l'interface utilisateur, qui sont des éléments clés mentionnés dans la référence concernant l'ergonomie du site web ou de l'application. L'affirmation est pertinente car elle touche directement à l'expérience utilisateur, un aspect fondamental du projet de communication multicanal. Cependant, bien que cela soit un point important, l'exercice ne couvre pas d'autres aspects cruciaux tels que la qualité des contenus ou l'accessibilité numérique. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "2b71f18669974c0aaeff9e376d51e756", "query": "Un lien d'évitement permet <blank> dans la page afin d'améliorer l'accessibilité pour les utilisateurs.", "answers": ["de sauter une zone"], "distractors": [["d'ouvrir un nouveau site", "de charger une nouvelle section", "de fermer une fenêtre", "de lancer une aide technique", "d'activer un formulaire", "de générer un contenu"]], "feedback": "Un lien d'évitement permet aux utilisateurs, notamment ceux naviguant avec un clavier ou utilisant des aides techniques, de sauter une zone spécifique de la page afin de ne pas avoir à parcourir tout le contenu séquentiellement. Cela contribue à améliorer l'accessibilité en permettant une navigation plus fluide.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à l'accessibilité numérique, qui est un aspect fondamental de la conception d'un projet de communication multicanal. En demandant aux apprenants de compléter une phrase sur le rôle des liens d'évitement, il teste leur connaissance sur comment améliorer l'expérience utilisateur pour les personnes ayant des handicaps. Bien que cet exercice soit pertinent, il pourrait être renforcé en intégrant davantage d'éléments liés à la qualité du contenu ou à l'ergonomie, qui sont également cruciaux dans le contexte global de la référence."}, {"exercise": {"id": "1e8837a2fa214391911afea8e4445731", "statement": "Les liens d'accès rapide et d'évitement ne modifient pas l'endroit où commence la navigation clavier après leur activation.", "veracity": false, "feedback": "Les liens fonctionnels d'accès rapide et d'évitement doivent précisément permettre de reprendre la navigation clavier directement à partir de la cible visée par le lien, facilitant ainsi un accès plus direct aux sections importantes d'une page.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des concepts d'accessibilité numérique, qui est un aspect fondamental de la conception d'un projet de communication multicanal. La question sur les liens d'accès rapide et d'évitement touche directement à l'ergonomie et à la navigation, deux éléments clés mentionnés dans la synthèse. En effet, ces liens sont conçus pour améliorer l'expérience utilisateur en facilitant l'accès aux sections importantes d'une page, ce qui est en ligne avec les objectifs stratégiques de rendre le contenu accessible à tous. Cependant, l'exercice pourrait être amélioré en intégrant davantage de questions sur d'autres aspects comme la qualité des contenus ou la gestion agile du projet pour couvrir plus largement le sujet."}, {"exercise": {"id": "7fd94d1cfb6a4172bd075fce05d98d4b", "statement": "Un lien d'évitement permet de sauter une zone dans la page pour faciliter la navigation.", "veracity": true, "feedback": "Les liens d'évitement sont en effet destinés à permettre aux utilisateurs de sauter certaines zones d'une page, ce qui améliore l'expérience de navigation, notamment pour ceux qui utilisent des lecteurs d'écran ou la navigation au clavier.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à l'ergonomie et à l'accessibilité numérique, qui sont des éléments essentiels dans la conception d'un projet de communication multicanal. La question sur les liens d'évitement est pertinente car elle touche directement à l'amélioration de l'expérience utilisateur, un aspect fondamental mentionné dans la synthèse. Cependant, bien que cela soit important, l'exercice ne couvre pas tous les aspects du projet de communication multicanal, comme la qualité des contenus ou la gestion agile. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "a98a45abc7014c27850699d06e697a15", "question": "Quel critère doit respecter le plan du site pour assurer la navigation utilisateur?", "answers": ["Permettre d'accéder à toutes les pages du site"], "distractors": ["Contenir tous les liens externes du site", "Inclure un lien vers la page d'accueil", "Être visible sur chaque page du site", "Répertorier uniquement les pages principales", "Empêcher l'accès aux sections protégées", "Cacher les pages de contenu secondaire", "Proposer une navigation en mode hors ligne", "Ne référencer que les pages populaires", "Lister toutes les images présentes sur le site"], "feedback": "Le critère à respecter pour assurer la navigation utilisateur est de permettre d'accéder à toutes les pages du site. Le plan du site doit donc fournir un moyen pour l'utilisateur de naviguer vers toutes les pages du site, sans en exclure aucune. Tous les distracteurs proposent des critères qui ne garantissent pas une navigation complète pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9eebbd66191f47bdb5446f8a1a7640c6", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Note 2 : il n'est pas nécessaire que le plan du site contienne les liens vers toutes les pages du site, en revanche il est nécessaire qu'à partir du plan du site, l'utilisateur puisse atteindre l'ensemble des pages du site. Note 2 : la valeur des attributs WAI-ARIA aria- labelledby ou aria-describedby ne doivent pas créer de référence récursive (A référence B qui référence A) ou traversante (A qui référence B qui référence C);", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c966566ada424caf8bb0704e44c038fa", "next_id": "1e1ad141a8b7419fb264514ef3eed4a9", "prev_id": "904c81eab0874eb49a216bbdec53ccb6", "associated_block_ids": [], "first_page": 116, "last_page": 116, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue un aspect clé de la référence, à savoir l'ergonomie et la navigation dans un projet de communication multicanal. La question cible directement la nécessité d'une navigation intuitive, ce qui est essentiel pour garantir une expérience utilisateur optimale. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects mentionnés dans la synthèse, comme l'accessibilité ou la qualité des contenus. Néanmoins, il reste très pertinent par rapport à l'objectif pédagogique global."}, {"exercise": {"id": "59a3b70b62794e40b3f0cbc09128f758", "statement": "Les auteurs et administrateurs doivent s'assurer uniquement de la compatibilité entre les technologies utilisées par les utilisateurs.", "veracity": false, "feedback": "Les auteurs et administrateurs doivent non seulement garantir la compatibilité entre les technologies des utilisateurs, mais aussi veiller à leur usage correct, incluant les technologies d'assistance. Ils ne se limitent pas qu'à la simple compatibilité des technologies elles-mêmes mais également à l'ensemble des usages associés.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "93c460a21e1445d2ab85a886456baf40", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Tout environnement dans lequel l'accès à l'information, les technologies, les conditions d'utilisation et le profil des utilisateurs peuvent être connus et maîtrisés. Les principaux éléments dont la maîtrise est essentielle sont : Les auteurs et les administrateurs doivent garantir la compatibilité des technologies utilisées et de leurs usages par les utilisateurs et leurs technologies (y compris les technologies d'assistance). Les services d'information ou les sites Web, quel que soit leur statut, qui offrent un accès public ne peuvent pas être considérés comme des environnements maîtrisés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e02a59775b924fcb8c58d343e57994b2", "next_id": "dcc11f04d4c448fa8197db1d2366bc40", "prev_id": "e02a59775b924fcb8c58d343e57994b2", "associated_block_ids": [], "first_page": 99, "last_page": 99, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des responsabilités des auteurs et administrateurs dans le cadre d'un projet de communication multicanal, en mettant l'accent sur l'accessibilité numérique. La réponse correcte souligne l'importance d'assurer non seulement la compatibilité technologique, mais aussi un usage correct des technologies, ce qui est en ligne avec les thèmes abordés dans la synthèse concernant l'évaluation de l'accessibilité et le respect des normes. Cependant, bien que pertinent, cet exercice pourrait être amélioré en intégrant davantage d'aspects liés à la qualité du contenu ou à l'ergonomie, pour couvrir plus largement les concepts clés de la référence."}, {"exercise": {"id": "99cbe8c179104a06a7b31f681a4a9bd1", "statement": "L'accessibilité numérique doit être prise en compte dans les clauses contractuelles des appels d'offres et devis.", "veracity": true, "feedback": "Il est correctement mentionné que l'intégration de l'accessibilité numérique doit figurer dans les clauses contractuelles, comme dans les appels d'offres et devis. Cela vise à garantir que les prestataires tiennent compte de l'accessibilité lors de la réalisation de leurs services ou produits numériques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1f0965cdf8b1414f8f07971787ba21f0", "order": 14.0, "image_url": null, "origin_type": "document_content", "text": "· l'intégration de l'accessibilité numérique dans les clauses contractuelles (appels d'offres et devis), des critères de notation et de sélection des prestataires et les procédures de recette et, le cas échéant, dans les conventions établies avec leurs opérateurs, délégataires ou partenaires. · les mesures d'accessibilité non obligatoires, notamment l'accès aux contenus audios et vidéos en langue des signes, la traduction de certains contenus en langage simplifié et tout autre mesure permettant de prendre en compte des critères de niveau triple AAA, des normes internationales, listés en annexe de la norme de référence ;", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "b67c6641e40f410e88f9407d33987a9d", "next_id": "5ae826c896534056bc6cfee0d884bf3f", "prev_id": "0b01951c1cb54503b0c5f9dba045a7c1", "associated_block_ids": [], "first_page": 16, "last_page": 17, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de la conception d'un projet de communication multicanal, à savoir l'accessibilité numérique. La référence souligne l'importance de l'évaluation de l'accessibilité et des tests utilisateurs pour garantir que les services numériques respectent les normes d'accessibilité. L'affirmation proposée dans l'exercice est pertinente car elle relie directement cette notion à un contexte pratique (clauses contractuelles), ce qui montre une bonne compréhension des implications de l'accessibilité dans le cadre d'un projet. Cependant, bien que cela soit pertinent, l'exercice pourrait être amélioré en incluant davantage d'éléments sur les autres aspects mentionnés dans la synthèse, comme la qualité des contenus ou l'ergonomie."}, {"exercise": {"id": "616b5d2ed72e4a31ba53f684e25b1e18", "statement": "Une alternative textuelle doit impérativement contenir moins de 80 caractères pour être accessible.", "veracity": false, "feedback": "Il est recommandé que l'alternative textuelle ne dépasse pas 80 caractères pour limiter les manipulations des utilisateurs de technologies d'assistance, mais ce n'est pas une obligation stricte. Le nombre maximal de 80 caractères est une bonne pratique conseillée, non une règle absolue.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, un aspect essentiel dans la conception d'un projet de communication multicanal. La question sur l'alternative textuelle et sa longueur est pertinente car elle touche à la qualité des contenus et à leur accessibilité pour les utilisateurs ayant des handicaps. Bien que l'affirmation soit formulée de manière à induire en erreur, elle permet d'aborder une bonne pratique recommandée dans le cadre de l'accessibilité. Cependant, l'exercice pourrait être amélioré en incluant davantage d'éléments relatifs aux autres concepts clés mentionnés dans la synthèse, comme l'ergonomie ou la gestion agile du projet."}, {"exercise": {"id": "6959a0ee488345c7b82f166b7c72587f", "statement": "Les technologies comme les plages braille et les loupes d'écran peuvent faciliter la lecture des alternatives textuelles.", "veracity": true, "feedback": "Il est mentionné que les technologies d'assistance telles que les plages braille et les loupes d’écran permettent aux utilisateurs d’accéder aux alternatives textuelles. Ces outils aident notamment dans la restitution de texte destiné à ceux ayant des limitations visuelles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, un aspect fondamental dans la conception d'un projet de communication multicanal. En posant une question sur les technologies d'assistance et leur rôle dans l'accès aux contenus, il touche directement à la nécessité d'assurer que tous les utilisateurs, y compris ceux ayant des handicaps, puissent interagir avec le contenu proposé. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects mentionnés dans la synthèse, comme l'ergonomie ou la qualité des contenus."}, {"exercise": {"id": "fd2fffde74194be18561b8d1d2b75601", "statement": "Il est nécessaire de fournir une alternative accessible pour un composant JavaScript si ce dernier n'est pas rendu accessible.", "veracity": true, "feedback": "Il est en effet essentiel de proposer une alternative spécifique lorsqu'un composant JavaScript ne peut pas être rendu accessible afin de garantir une expérience utilisateur inclusive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "6651b2dd1dc54f1788efcdc58d58b531", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Note importante : dans un environnement HTML5, beaucoup de composants peuvent nécessiter JavaScript pour fonctionner ; en conséquence la fourniture d'une alternative à un composant JavaScript qui ne pourrait pas être rendu accessible devra bénéficier d'une méthode spécifique au composant en cause, permettant de le remplacer par une alternative accessible (et de le réactiver). Cela signifie que la désactivation de JavaScript pour l'ensemble de la page ne sera pas acceptée comme une méthode valable, à moins qu'elle ne remette pas en cause l'utilisation des autres composants.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf92b5f2e30c4b72a9939e35bc21a854", "next_id": "db79017022d14db09eafa0f20c9e8b2c", "prev_id": "14dc674e93034566b12def6e88ecc962", "associated_block_ids": [], "first_page": 48, "last_page": 48, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, qui est un aspect fondamental dans la conception d'un projet de communication multicanal. L'affirmation met en avant l'importance de fournir des alternatives accessibles pour les composants JavaScript, ce qui est directement lié à l'idée que tous les utilisateurs, y compris ceux ayant des handicaps, doivent pouvoir interagir avec le contenu. Bien que cet exercice ne couvre pas tous les aspects mentionnés dans la synthèse (comme la qualité des contenus ou l'ergonomie), il aborde un concept clé et essentiel pour garantir une expérience utilisateur optimale. C'est pourquoi il reçoit une note élevée mais pas maximale."}, {"exercise": {"id": "6015c7d5473a4aa6a073f4730908e579", "question": "Quand est-il nécessaire de fournir une alternative textuelle à une fonctionnalité sonore ?", "answers": ["Si la fonctionnalité sonore nécessite une explication pour certains utilisateurs"], "distractors": ["Toujours, même lorsqu'il n'y a pas de son associé à une fonctionnalité.", "Seulement si l'utilisateur utilise un écran tactile.", "Lorsque le son est activé automatiquement à chaque démarrage.", "Uniquement si la fonctionnalité sonore est très complexe à comprendre.", "Si la fonctionnalité audiophonique emploie des basses fréquences.", "Quand la fonctionnalité sonore fait partie d'une application mobile spécifique.", "Dès que l'utilisateur essaie de désactiver le son.", "Si la fonctionnalité inclut une vidéo sans sous-titres.", "Lorsqu'une condition temporelle est associée à la fonctionnalité son."], "feedback": "L'alternative textuelle est nécessaire lorsque la fonctionnalité sonore n'est pas suffisamment compréhensible pour certains utilisateurs, par exemple les personnes sourdes ou malentendantes. Cela peut être dû à la complexité du son, à l'absence d'informations visuelles associées, ou à tout autre élément rendant difficile la compréhension de la fonctionnalité pour ces utilisateurs. Fournir une alternative textuelle permet de garantir une accessibilité équivalente pour tous les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, un aspect fondamental dans la conception d'un projet de communication multicanal. La question sur la nécessité de fournir une alternative textuelle à une fonctionnalité sonore est directement liée aux normes d'accessibilité mentionnées dans la synthèse. L'explication fournie renforce cette connexion en soulignant l'importance d'assurer que tous les utilisateurs, y compris ceux ayant des handicaps, puissent comprendre et interagir avec le contenu. Cependant, l'exercice pourrait être amélioré en incluant des éléments supplémentaires sur l'ergonomie ou la qualité des contenus pour couvrir plus largement les thèmes abordés dans la référence."}, {"exercise": {"id": "b3e57401533842d0be619dce4af41dfc", "statement": "La condition de test doit garantir que la restitution est pertinente pour l'accessibilité.", "veracity": true, "feedback": "Effectivement, la restitution doit être évaluée quant à sa pertinence pour une accessibilité correcte, assurant ainsi que l'élément ou le dispositif est compatible avec les standards d'accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité numérique dans le cadre d'un projet de communication multicanal, ce qui est un aspect clé mentionné dans la référence. La question sur la pertinence de la restitution pour l'accessibilité permet de tester si l'apprenant a saisi que l'évaluation des contenus doit prendre en compte les normes d'accessibilité. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects du projet de communication multicanal, tels que la qualité des contenus ou l'ergonomie. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "7acf781c86d94db5b9174ea0f77a7080", "question": "Qu'est-ce qui est défini comme prioritaire dans tout référentiel ergonomique ?", "answers": ["L'étude des usagers"], "distractors": ["Le choix de la vitesse de réponse", "La gestion des couleurs d'interface", "La sélection des raccourcis clavier", "L'optimisation du code source", "La conception graphique du logiciel", "La compatibilité multiplateforme", "Le mode sombre obligatoire", "L'intégration de technologies émergentes", "La taille des boutons"], "feedback": "Dans un référentiel ergonomique, l'étude des usagers est considérée comme la priorité car c'est grâce à cette analyse qu'il est possible de comprendre leurs besoins, leurs comportements et leurs attentes. Cela permet alors de choisir et de mettre en place les éléments pertinents pour améliorer l'expérience utilisateur. Les distracteurs proposent des aspects qui peuvent être importants, mais qui ne sont pas autant primordiaux que l'étude des usagers dans une démarche ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'étude des usagers dans un référentiel ergonomique, ce qui est pertinent pour le contexte de la conception d'un projet de communication multicanal. La synthèse souligne que l'ergonomie et la lisibilité du contenu sont essentielles pour garantir une expérience utilisateur optimale. Cependant, bien que l'étude des usagers soit un aspect clé, l'exercice ne couvre pas d'autres éléments cruciaux mentionnés dans la synthèse, tels que la qualité des contenus ou l'accessibilité numérique. Ainsi, bien qu'il soit pertinent, il ne teste pas entièrement tous les concepts clés liés à la référence."}, {"exercise": {"id": "bd6c557ed7e94632ae6c68efc4f641d9", "query": "[Nom du site web, de l'application mobile, ou d'un autre service concerné] est en conformité partielle avec <blank> en raison des non-conformités énumérées ci-dessous.", "answers": ["le référentiel général d'amélioration de l'accessibilité"], "distractors": [["les normes ISO d'accessibilité numérique", "le protocole international d'évaluation de sites web", "la charte d'accessibilité des services numériques", "les standards européens d'inclusive design", "les critères de validation de l'expérience utilisateur", "le règlement sur la protection des données personnelles"]], "feedback": "La bonne réponse est 'le référentiel général d'amélioration de l'accessibilité'. Ce référentiel représente un cadre spécifique définissant les normes à respecter pour garantir l'accessibilité des sites ou applications numériques en France.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "cdeb2a146d4e437ba734f52f8461fff9", "order": 8.0, "image_url": null, "origin_type": "document_content", "text": "(a) [Nom du site web, de l'application mobile, ou d'un autre service concerné] est en totale conformité avec [pour les sites : le référentiel général d'amélioration de l'accessibilité / autre protocole de test utilisé ; pour les autres services de communication : protocole de test utilisé]. (b) [Nom du site web, de l'application mobile, ou d'un autre service concerné] est en conformité partielle avec [pour les sites : le référentiel général d'amélioration de l'accessibilité / autre protocole de test utilisé ; pour les autres services de communication : protocole de test utilisé] en raison [de la/ des non-conformité(s)] [et/ou] [des dérogations] énumérées(s) ci-dessous.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "92cc7fbe594a4535974c06a011c622e3", "next_id": "9fa4d408c993495aa6242cb347297f88", "prev_id": "92cc7fbe594a4535974c06a011c622e3", "associated_block_ids": [], "first_page": 13, "last_page": 13, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la connaissance d'un aspect clé de la conception d'un projet de communication multicanal, à savoir l'accessibilité numérique. Il est pertinent car il aborde les normes d'accessibilité qui sont essentielles pour garantir une expérience utilisateur optimale, comme mentionné dans la synthèse. Cependant, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects du projet, tels que la qualité des contenus ou l'ergonomie, afin de couvrir plus largement le sujet de la communication multicanal."}, {"exercise": {"id": "646d2d5784a045b288227297210d2087", "statement": "L'organisme concerné est tenu de répondre à toute réclamation relative à l'accessibilité dans un délai d'une semaine, quelle que soit la complexité des questions soulevées.", "veracity": false, "feedback": "Si une réclamation soulève des questions complexes, l'organisme peut dépasser le délai d'une semaine pour fournir une réponse définitive. Dans ce cas, il doit indiquer un délai raisonnable et justifier pourquoi les questions posées nécessitent plus de temps d'examen.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7753d9c783904385bd540faaea18904c", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "La déclaration d'accessibilité fait l'objet d'un dépôt par le biais d'un téléservice selon les modalités arrêtées conjointement par le ministre chargé des personnes handicapées et le ministre chargé du numérique. L'organisme concerné fournit en ligne aux utilisateurs la possibilité de faire des réclamations relatives à l'accessibilité de ses services de communication au public en ligne. Il accuse réception de ces réclamations conformément aux dispositions de l'article R112-3 du code des relations entre L'organisme concerné répond à toute réclamation dans un délai d'une semaine à compte de sa date d'envoi. Si la réclamation de l'utilisateur soulève une ou plusieurs questions complexes justifiant un délai d'examen plus long, la réponse indique un délai raisonnable pour la réponse définitive. Le caractère complexe des questions soulevées doit être dûment motivé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d4f759c7fc0f4b67b334122a67715222", "next_id": "c50d302398c44b4489e0e78e73d9fd10", "prev_id": "ec75ea7d027743f99d379ad64564e607", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, un aspect essentiel de la conception d'un projet de communication multicanal. En posant une question sur les délais de réponse aux réclamations relatives à l'accessibilité, il teste la connaissance des normes et des pratiques en matière d'accessibilité. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects clés mentionnés dans la référence, tels que la qualité des contenus ou l'ergonomie. Il aurait pu être amélioré en intégrant des éléments relatifs à ces autres concepts pour obtenir une évaluation plus complète."}, {"exercise": {"id": "661120dbde3f477c9a00929b924e1bb1", "question": "Quels services sont soumis à l'obligation d'accessibilité pour les personnes handicapées ?", "answers": ["Les services de communication au public en ligne"], "distractors": ["Les services publics en présentiel uniquement", "Les services commerciaux des entreprises privées", "Les communications téléphoniques privées", "Les consultations juridiques en ligne", "Les retransmissions télévisées privées", "Les plateformes de divertissement numérique", "Les services municipaux de transport en commun", "Les organismes de recherche scientifique privés", "Les associations caritatives sans site internet"], "feedback": "Les personnes handicapées ont le droit d'avoir accès à tous les services de communication, y compris en ligne. C'est pourquoi la loi prévoit que les organismes publics et certaines personnes morales privées doivent rendre leurs services accessibles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "132dfac3b0b3431a8b5e25d6c03ea4f6", "order": 11.0, "image_url": null, "origin_type": "document_content", "text": "Comme le prévoit l'article 47 de la loi nº 2005-102 du 11 février 2005 pour l'égalité des droits et des chances, la participation et la citoyenneté des personnes handicapées, sont concernés par l'obligation d'accessibilité les services de communication au public en ligne des organismes suivants : 2º Les personnes morales de droit privé délégataires d'une mission de service public, ainsi que celles créées pour satisfaire spécifiquement des besoins d'intérêt général ayant un caractère autre qu'industriel ou commercial et dont :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "eb9685e10cd84af6b9825b4ec139058c", "next_id": "f5ad60b0e0114e7498b5700d0c31f491", "prev_id": "eb9685e10cd84af6b9825b4ec139058c", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'accessibilité numérique, un aspect essentiel de la conception d'un projet de communication multicanal. La question cible spécifiquement les services soumis à l'obligation d'accessibilité pour les personnes handicapées, ce qui est en lien direct avec le contenu synthétisé sur l'évaluation de l'accessibilité numérique. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects clés mentionnés dans la référence, tels que la qualité des contenus ou l'ergonomie. Il aurait pu être amélioré en intégrant des questions sur ces autres thèmes centraux pour une évaluation plus complète."}, {"exercise": {"id": "1ba4425f80644e4d849adddc32277d74", "statement": "Le média temporel doit impérativement être accompagné de sous-titres synchronisés pour qu'un contenu soit accessible.", "veracity": false, "feedback": "Un média temporel n'a pas obligatoirement besoin de sous-titres synchronisés si des alternatives comme une transcription textuelle ou une audiodescription sont fournies. Le but est d'assurer que le contenu soit compréhensible par tous, mais il existe plusieurs moyens pour y parvenir, dont les sous-titres ne sont qu'une option parmi d'autres.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "50e8317399074680989db76837f477f0", "order": 20.0, "image_url": null, "origin_type": "document_content", "text": "· Le média temporel est lui-même une alternative à un contenu de la page (une vidéo en langue des signes ou la vocalisation d'un texte, par exemple) ; · Le média temporel fait partie d'un test qui deviendrait inutile si la transcription textuelle, les sous-titres synchronisés ou l'audiodescription étaient communiqués ; · Pour les services de l'État, les collectivités territoriales et leurs établissements : si le média temporel a été publié entre le 23 septembre 2019 et le 23 septembre 2020 sur un site internet, intranet ou extranet créé depuis le 23 septembre 2018, il est exempté de l'obligation d'accessibilité ;", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "20c625cf818d4f95b9da1107913afa57", "next_id": "995995fbf456448da0187dad9dc03420", "prev_id": "9d8567ef1ece4fa89303fdd3497cfc81", "associated_block_ids": [], "first_page": 36, "last_page": 36, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect de l'accessibilité numérique, qui est un thème central dans la conception d'un projet de communication multicanal. La question des médias temporels et de leur accessibilité est pertinente, car elle touche à la qualité du contenu et à l'expérience utilisateur. Cependant, l'exercice se concentre uniquement sur une affirmation spécifique concernant les sous-titres synchronisés sans explorer davantage les autres éléments clés mentionnés dans la synthèse, tels que l'ergonomie ou la gestion agile du projet. Bien qu'il soit utile pour tester une compréhension partielle des exigences d'accessibilité, il ne couvre pas suffisamment le spectre complet des concepts liés à la conception d'un projet multicanal."}, {"exercise": {"id": "bfadd69830f842acbfe37e3154657004", "statement": "La loi de Hick-Hyman permet d'évaluer l'efficacité des interfaces en analysant le nombre de choix disponibles.", "veracity": true, "feedback": "La loi de Hick-Hyman met en relation le temps de réaction et le nombre de choix possibles. Elle est souvent utilisée pour évaluer l'utilisabilité des interfaces en fonction de la complexité des choix offerts à l'utilisateur, ce qui est un facteur important dans l'évaluation de leur efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a6f7b6ba24a348699c378ebeacc17668", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Hick-Hyman est une loi mathématique qui permet d'évaluer l'utilisabilité des interfaces. Cette loi établit clairement une relation entre le temps de réaction et les possibilités de choix.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3ab21d83414d4633ab5831f7c654f27f", "next_id": "065e4ecd54d94505ba62d7cbace2e6e9", "prev_id": "3ab21d83414d4633ab5831f7c654f27f", "associated_block_ids": [], "first_page": 21, "last_page": 21, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un concept pertinent lié à l'ergonomie et à l'utilisabilité des interfaces, qui est un aspect clé de la conception d'un projet de communication multicanal. La loi de Hick-Hyman est effectivement liée à la navigation intuitive et à la lisibilité du contenu, deux éléments cruciaux pour garantir une expérience utilisateur optimale. Cependant, l'exercice se concentre principalement sur un aspect théorique (la loi de Hick-Hyman) sans explorer d'autres dimensions essentielles mentionnées dans la synthèse, telles que la qualité des contenus ou l'accessibilité numérique. Par conséquent, bien qu'il soit pertinent, il ne couvre pas entièrement les divers aspects nécessaires pour concevoir un projet de communication multicanal."}, {"exercise": {"id": "3bd3b0916e0042d8bb5fbfb2302b323d", "statement": "Un événement déclenché uniquement sur la prise de focus permet de satisfaire le critère de contrôle du contenu en mouvement ou clignotant.", "veracity": false, "feedback": "L'événement déclenché uniquement sur la prise de focus ne permet pas de valider le critère car l'utilisateur doit pouvoir interagir avec le reste de la page sans dépendre de l'état de focus d'un élément pour contrôler le mouvement ou le clignotement du contenu.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9631bb6a88994278893e8f530e0e4fbe", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Note 2 : la méthode de contrôle du contenu en mouvement ou clignotant doit permettre à l'utilisateur d'interagir avec le reste de la page. En conséquence, l'arrêt ou la mise en pause via un événement déclenché uniquement sur la prise de focus ne permet pas de valider le critère. Note 3 : Dans certains cas, le mouvement fait partie intégrante du composant et il n'est pas possible d'en donner le contrôle à l'utilisateur, par exemple une barre de progression dont la fonction est d'indiquer par un mouvement la progression d'un évènement comme un téléchargement. Dans ce cas le critère est Non Applicable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "88850052c4aa4836a5814abede872408", "prev_id": "fc20bab85f644c6b9ea6662aea9e5fdd", "associated_block_ids": [], "first_page": 96, "last_page": 96, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'un projet de communication multicanal, à savoir l'accessibilité et le contrôle des contenus en mouvement ou clignotant. Bien que cela soit pertinent pour l'ergonomie et l'expérience utilisateur, l'exercice ne couvre pas directement d'autres éléments clés mentionnés dans la référence, tels que la qualité des contenus, la navigation intuitive ou les objectifs stratégiques. Il teste une compréhension spécifique mais n'évalue pas de manière exhaustive les divers concepts nécessaires à la conception d'un projet multicanal."}, {"exercise": {"id": "25dd33ffa1174efa9d536d19e44540c1", "question": "Quelle action un organisme doit-il entreprendre si une réclamation sur l'accessibilité est complexe ?", "answers": ["Indiquer un délai raisonnable pour la réponse définitive"], "distractors": ["Transmettre la réclamation au ministère compétent", "Envoyer une réponse automatique temporaire", "Reporter la réclamation sans plus de détails", "Donner un accusé de réception uniquement", "Prévenir les utilisateurs d'une impossibilité de traiter la réclamation", "Supprimer la réclamation et notifier l'utilisateur", "Publier la réclamation sur son site", "Répondre immédiatement quelle que soit la complexité", "Transférer la réclamation à un organisme tiers"], "feedback": "La bonne réponse est Indiquer un délai raisonnable pour la réponse définitive car en cas de complexité de la réclamation sur l'accessibilité, l'organisme doit fournir un délai pour sa réponse finale. Les distracteurs proposent des actions différentes telles que transférer la réclamation à un tiers ou supprimer la réclamation, qui ne sont pas conformes à la procédure légale.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7753d9c783904385bd540faaea18904c", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "La déclaration d'accessibilité fait l'objet d'un dépôt par le biais d'un téléservice selon les modalités arrêtées conjointement par le ministre chargé des personnes handicapées et le ministre chargé du numérique. L'organisme concerné fournit en ligne aux utilisateurs la possibilité de faire des réclamations relatives à l'accessibilité de ses services de communication au public en ligne. Il accuse réception de ces réclamations conformément aux dispositions de l'article R112-3 du code des relations entre L'organisme concerné répond à toute réclamation dans un délai d'une semaine à compte de sa date d'envoi. Si la réclamation de l'utilisateur soulève une ou plusieurs questions complexes justifiant un délai d'examen plus long, la réponse indique un délai raisonnable pour la réponse définitive. Le caractère complexe des questions soulevées doit être dûment motivé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d4f759c7fc0f4b67b334122a67715222", "next_id": "c50d302398c44b4489e0e78e73d9fd10", "prev_id": "ec75ea7d027743f99d379ad64564e607", "associated_block_ids": [], "first_page": 15, "last_page": 16, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des procédures à suivre en cas de réclamation sur l'accessibilité, ce qui est un aspect important de la conception d'un projet de communication multicanal. Cependant, il se concentre uniquement sur un élément spécifique (la gestion des réclamations) sans aborder d'autres concepts clés tels que la qualité des contenus, l'ergonomie ou la navigation. Bien qu'il soit pertinent dans le contexte de l'accessibilité numérique, il ne couvre pas suffisamment les autres dimensions essentielles mentionnées dans la synthèse pour obtenir une note plus élevée."}, {"exercise": {"id": "bdaeca7c362e4118ad49fffb1608c86e", "query": "En ne travaillant pas sur l'accessibilité web d'un site, on se prive de <blank> de visiteurs potentiels.", "answers": ["millions"], "distractors": [["centaines", "dizaines", "milliers", "quelques", "très peu", "centimes"]], "feedback": "Se priver de millions de visiteurs potentiels est le bon choix, car entre 15% et 20% de la population souffrent d'un handicap. Cela représente un grand nombre de personnes, bien plus qu'une simple centaine ou dizaine, d'où l'expression 'millions'.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'un projet de communication multicanal, à savoir l'accessibilité numérique. En effet, il souligne l'importance de prendre en compte les utilisateurs ayant des handicaps pour ne pas se priver d'une part significative de visiteurs potentiels. Cependant, l'exercice est limité car il ne teste pas directement la compréhension des autres concepts clés mentionnés dans la référence, tels que la qualité des contenus, l'ergonomie ou la gestion agile du projet. De plus, le format 'texte à trou' peut sembler trop simpliste pour évaluer une compréhension approfondie des enjeux liés à un projet multicanal. Ainsi, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects essentiels de la référence."}, {"exercise": {"id": "2814a37146f740729ed37839e00c69ea", "question": "Quand un intitulé de lien est-il considéré comme non-explicite ?", "answers": ["Quand le nom accessible diffère de l'intitulé visible du lien"], "distractors": ["Quand le lien ne redirige pas correctement", "Quand il y a plusieurs URL pour un même lien", "Quand l'attribut title contient des balises HTML erronées", "Quand le nom accessible contient des caractères spéciaux non supportés", "Quand l'intitulé visible n'est pas traduit", "Quand le lien ouvre une nouvelle fenêtre sans avertissement", "Quand le lien se trouve dans une zone répétitive de la page", "Quand le texte du lien comprend plus de trois mots", "Quand l'attribut title n'est pas présent"], "feedback": "La réponse correcte indique que l'on considère un intitulé de lien comme non-explicite lorsque le nom accessible présent dans l'attribut title diffère de l'intitulé visible du lien, ce qui peut entraîner des problèmes d'accessibilité pour certains utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "87065915b6c64d61a9077eb6539efe48", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Note 1 : un intitulé de lien sera considéré comme non-explicite dans le cas où le « nom accessible » ne reprend pas l'intitulé visible du lien. Note 2 : en raison de la configuration possible des aides techniques permettant de forcer la restitution de « nom accessible » issu du contenu de attribut tit le au détriment du « nom accessible » issu du contenu du lien. Un intitulé de lien sera considéré comme non-explicite dans le cas où le lien possède un attribut tit le dont la valeur ne reprendrait pas au moins le « nom accessible » issu du contenu du lien.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6eb38da4889d4289a5aa6ca2e733eeff", "next_id": "2b71734dfd0549ff81963e92a07165f7", "prev_id": "10e752518b084e25b454c0c51afb9733", "associated_block_ids": [], "first_page": 105, "last_page": 105, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité numérique, qui est un des thèmes centraux dans la conception d'un projet de communication multicanal. En effet, la question sur les intitulés de lien non-explicites touche à la lisibilité et à l'ergonomie du contenu, éléments essentiels pour garantir une expérience utilisateur optimale. Cependant, l'exercice se concentre spécifiquement sur un détail technique concernant les liens plutôt que sur des concepts plus larges comme la gestion agile du projet ou la définition d'objectifs stratégiques. Bien qu'il soit pertinent, il ne couvre pas entièrement l'ensemble des compétences et concepts clés mentionnés dans la référence."}, {"exercise": {"id": "6c9bab96792f44289e4dbb16826b1b52", "statement": "Les technologies Web doivent obligatoirement fonctionner avec tous les agents utilisateurs pour être considérées comme accessibles.", "veracity": false, "feedback": "Les technologies Web doivent être compatibles avec des agents utilisateurs largement distribués qui, eux-mêmes, sont compatibles avec l'accessibilité. Ce n'est pas nécessairement tous les agents utilisateurs, mais plutôt ceux qui sont les plus couramment utilisés et reconnus pour leur compatibilité avec l'accessibilité (comme HTML et CSS).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "27f13d2e457944da8c7af4446bba83d7", "order": 11.0, "image_url": null, "origin_type": "document_content", "text": "· La façon dont la technologie Web est utilisée doit être compatible avec les technologies d'assistance des utilisateurs. Cela signifie que la façon dont la technologie est utilisée a été testée dans une perspective d'interopérabilité avec des utilisateurs des technologies d'assistance dans la ou les langues du contenu ; · La technologie fonctionne de façon native dans des agents utilisateurs largement distribués qui sont, eux-mêmes, compatibles avec l'accessibilité (comme HTML et CSS) ou avec un module d'extension largement distribué qui est, lui-même, compatible avec l'accessibilité. La vérification de la compatibilité avec les technologies d'assistance nécessite de réaliser un certain nombre de tests spécifiques à la technologie utilisée, par exemple :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "28c56f67c7a746bfa40581950f185ff7", "next_id": "aabbd50d483f45488235717b17768911", "prev_id": "6ae4e0b6f4a24c0190da16dc5eee71e4", "associated_block_ids": [], "first_page": 93, "last_page": 93, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de la conception d'un projet de communication multicanal, à savoir l'accessibilité numérique. Il teste la compréhension des exigences en matière d'accessibilité et souligne l'importance de la compatibilité avec les agents utilisateurs courants. Cependant, il ne couvre pas d'autres éléments clés mentionnés dans la référence, tels que la qualité des contenus, l'ergonomie ou la gestion agile du projet. Bien qu'il soit pertinent, il n'évalue pas de manière exhaustive tous les concepts centraux liés à la conception d'un projet de communication multicanal."}, {"exercise": {"id": "8e0704032c5145a4b8a08d720994221a", "question": "Quel attribut contient l'alternative textuelle pour une image accompagnée d'une description détaillée?", "answers": ["L'attribut WAI-ARIA aria-label"], "distractors": ["L'attribut img-label-description", "L'attribut data-accessibility-text", "Un élément de balise desc", "L'attribut caption-alt", "L'attribut alt-describe", "Une balise HTML aria-img-desc", "Un identifiant aria-text-support", "Une classe CSS dédié à l'accessibilité", "Un élément de légende"], "feedback": "Dans cette situation, l'attribut WAI-ARIA aria-label permet de fournir une alternative textuelle pour l'image accompagnée d'une référence à une description détaillée adjacente. Cela permet aux personnes en situation de handicap d'accéder à l'information présente dans l'image.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la connaissance des attributs d'accessibilité, ce qui est pertinent dans le contexte de l'évaluation de l'accessibilité numérique mentionnée dans la synthèse. Cependant, il ne couvre pas directement les aspects plus larges de la conception d'un projet de communication multicanal, tels que la qualité des contenus ou l'ergonomie. Bien qu'il soit un élément important pour garantir une expérience utilisateur optimale, cet exercice ne teste pas suffisamment les compétences globales nécessaires à la conception et à la gestion d'un projet multicanal. Il aurait été plus pertinent d'inclure des questions sur l'intégration de ces attributs dans un projet global."}, {"exercise": {"id": "f1f4e80cb280417598d14efa8b949f6e", "question": "Quelle est la longueur maximale recommandée pour une alternative textuelle accessible ?", "answers": ["80 caractères au maximum sont fortement recommandés"], "distractors": ["100 caractères au maximum sont fortement recommandés", "120 caractères au maximum sont fortement recommandés", "40 caractères au maximum sont fortement recommandés", "70 caractères au maximum sont fortement recommandés", "90 caractères au maximum sont fortement recommandés", "50 caractères au maximum sont fortement recommandés", "130 caractères au maximum sont fortement recommandés", "110 caractères au maximum sont fortement recommandés", "60 caractères au maximum sont fortement recommandés"], "feedback": "Une longueur maximale de 80 caractères est fortement recommandée pour que les utilisateurs de plages braille ou de loupes d'écran puissent lire l'alternative sans avoir à effectuer plusieurs manipulations. Cela garantit une meilleure accessibilité pour ces utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue un aspect spécifique de l'accessibilité numérique, qui est un thème central dans la conception d'un projet de communication multicanal. La question sur la longueur maximale recommandée pour une alternative textuelle accessible est pertinente car elle touche à l'ergonomie et à l'expérience utilisateur, deux éléments clés mentionnés dans la synthèse. Cependant, l'exercice se concentre uniquement sur un détail technique sans aborder les autres dimensions importantes du projet de communication multicanal, telles que la qualité des contenus ou la gestion agile. Ainsi, bien qu'il soit pertinent, il ne couvre pas suffisamment le large éventail de concepts nécessaires pour concevoir un projet complet."}, {"exercise": {"id": "48bcec0fe85e486b997ca81cb67263c1", "query": "Pour faciliter l'accessibilité, la longueur maximale recommandée pour une alternative textuelle est de <blank>.", "answers": ["80 caractères"], "distractors": [["50 caractères", "100 caractères", "120 caractères", "60 caractères", "70 caractères", "90 caractères"]], "feedback": "La longueur maximale de 80 caractères est recommandée car elle permet de limiter les manipulations pour les utilisateurs de technologies d'assistance telles que des plages braille ou des loupes d'écran. Un texte plus long pourrait compliquer la lecture pour ces outils.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la connaissance d'un aspect spécifique de l'accessibilité numérique, qui est un élément clé dans la conception d'un projet de communication multicanal. Cependant, il se concentre uniquement sur une règle précise concernant la longueur des alternatives textuelles, sans aborder d'autres concepts importants mentionnés dans la référence, tels que la qualité des contenus, l'ergonomie ou la gestion agile du projet. Bien qu'il soit pertinent pour le sujet de l'accessibilité, il ne couvre pas suffisamment les autres dimensions essentielles du projet de communication multicanal."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 21.3, "top_pages": [38, 40], "top_minutes": []}]}