{"introduction": "Dans le cadre de l'analyse du retour sur investissement (ROI) d'une action marketing, il est crucial de comprendre comment mesurer et interpréter les résultats des campagnes. Cette synthèse explore divers concepts clés qui permettent d'évaluer l'efficacité des stratégies marketing, en mettant l'accent sur la compréhension des tendances et des préférences de consommation. En examinant ces éléments, nous pouvons mieux appréhender les facteurs qui influencent le succès d'une campagne et optimiser les investissements futurs.", "synthesis": "Le retour sur investissement (ROI) positif est un indicateur fondamental pour évaluer la rentabilité d'une action marketing. Un ROI positif signifie que les bénéfices générés par une campagne dépassent ses coûts, justifiant ainsi l'investissement initial. Pour mesurer ce ROI, plusieurs indicateurs clés de performance (KPI) sont utilisés, tels que le taux de conversion, qui représente le pourcentage d'utilisateurs réalisant une action souhaitée après avoir été exposés à une campagne. Ce taux est essentiel pour déterminer l'efficacité des interfaces numériques et peut être influencé par divers éléments de design UX.\n\nLa visibilité en ligne joue également un rôle crucial dans la mesure du ROI. Elle se réfère à la capacité d'une entreprise à être facilement trouvée sur Internet, ce qui est indispensable pour attirer de nouveaux clients. Des techniques comme le SEO (Search Engine Optimization) sont mises en œuvre pour améliorer cette visibilité organique dans les moteurs de recherche, augmentant ainsi le trafic vers le site web sans coûts publicitaires directs.\n\nL'expérience utilisateur (UX) et client est un autre aspect clé à considérer lors de l'évaluation du ROI. Une bonne UX optimise la satisfaction des utilisateurs grâce à un design efficace et une navigation fluide, influençant directement leur perception et leur engagement envers la marque. De plus, la confiance du consommateur envers un produit ou service impacte fortement sa décision d'achat; elle repose sur la clarté des informations fournies et la simplicité des choix offerts.\n\nLes métriques telles que le taux de rebond – qui indique combien d'utilisateurs quittent un site après avoir consulté une seule page – fournissent également des insights précieux sur l'engagement utilisateur et peuvent signaler des problèmes potentiels dans l'expérience offerte. Par ailleurs, les contenus présentés sur un site doivent être pertinents et attrayants pour répondre aux attentes des utilisateurs tout en soutenant les objectifs marketing.\n\nEnfin, il est important de considérer les projets critiques au sein d'une stratégie marketing globale; ceux-ci nécessitent une attention particulière car ils ont un impact significatif sur les résultats financiers. En intégrant tous ces concepts dans l'analyse du ROI marketing, il devient possible non seulement de mesurer efficacement le succès d'une campagne mais aussi d'identifier les tendances émergentes et les préférences changeantes des consommateurs.", "concepts": [{"concept": {"id": "290a7561-1e35-48ee-af31-7c444586dc44", "label": "ROI positif", "definition": "Un retour sur investissement (ROI) positif indique que les bénéfices d'un projet surpassent ses coûts, justifiant ainsi l'investissement initial.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13621], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le concept de ROI positif est directement lié à la mesure du retour sur investissement, ce qui est central à l'objectif pédagogique de comprendre le ROI d'une action marketing."}, {"concept": {"id": "e208c124-c2d4-43aa-b374-5e9653b2aad4", "label": "Taux de conversion", "definition": "Le taux de conversion est le pourcentage d'utilisateurs qui réalisent une action souhaitée, comme un achat ou une inscription, après avoir été exposés à une campagne marketing sur un site web ou via des canaux mobiles. Cet indicateur clé de performance commerciale mesure l'efficacité d'une interface et peut être influencé par divers facteurs, tels que l'utilisation stratégique des couleurs et d'autres éléments de design UX. Il représente donc la proportion de prospects qui deviennent clients suite à leur interaction avec une offre.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13670], "aliases": ["9543a16d-b880-4e6f-a52f-68e0d04a24ef", "9d9c2998-9466-419f-85b1-d38c1a010811", "ae828f4a-4b88-4a32-9096-567130b0a78b", "edfb61f0-ebbb-426b-be76-d1ee45c392b5"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le taux de conversion est un indicateur clé pour mesurer l'efficacité des campagnes marketing et donc essentiel pour évaluer le retour sur investissement."}, {"concept": {"id": "d7224c6f-a919-460d-af12-6dfbeacde495", "label": "Visibilité en ligne", "definition": "La visibilité en ligne désigne la capacité d'une entreprise ou d'une marque à être facilement perçue et trouvée sur Internet, ce qui est essentiel pour attirer de nouveaux clients et prospects. Cela inclut le degré de reconnaissance par le public ainsi que l'efficacité des stratégies mises en place pour se démarquer dans un environnement concurrentiel, notamment à travers les moteurs de recherche et d'autres moyens de navigation, contribuant ainsi à l'augmentation des ventes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13710], "aliases": ["a2fbd1f5-3187-4a73-8c57-0026e5b7c834", "6057ab20-03f6-44eb-bc9c-9e371b435eb7", "9f927f63-302b-44d8-8264-8c200a6beb4e", "04c7ab9d-73f8-4af7-98bb-c6286d64ae15"], "wikientity": null, "wordnetentity": {"label": "Visibilité", "definition": "quality or fact or degree of being visible; perceptible by the eye or obvious to the eye", "name": "visibility.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "La visibilité en ligne est essentielle pour attirer des clients et augmenter les ventes, ce qui en fait un concept central pour mesurer le retour sur investissement des actions marketing."}, {"concept": {"id": "bf9dcd29-03f3-4cd8-a076-8331895e019d", "label": "KPI (Indicateurs Clés de Performance)", "definition": "Les KPI, ou Indicateurs Clés de Performance, sont des mesures quantifiables utilisées pour évaluer le succès et l'efficacité d'un produit, service ou stratégie marketing. Ils jouent un rôle essentiel dans le suivi des performances des équipes, notamment dans les objectifs DevOps, en facilitant la prise de décisions éclairées et en permettant d'ajuster les actions si nécessaire.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13676, 13644], "aliases": ["87e70941-61ac-4056-9449-16f5a2eb30de", "73f1aa64-cede-40bc-b84c-46a66b3d5549"], "wikientity": {"label": "Indicateur clé de performance", "definition": "Un indicateur clé de performance (ICP) – en anglais : key performance indicator (KPI) – est un indicateur utilisé pour l'aide à la décision dans les organisations. Les ICP sont utilisés particulièrement en gestion de la performance organisationnelle.", "page_id": "1432151", "wikidata_id": "Q860554", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les KPI sont cruciaux pour évaluer l'efficacité des actions marketing et donc pour mesurer le ROI, ce qui les rend très pertinents dans ce contexte."}, {"concept": {"id": "287ef751-850a-45f8-8aea-12aa5b7582a2", "label": "Webmarketing", "definition": "Le webmarketing désigne l'ensemble des techniques marketing appliquées sur Internet, incluant le mobile marketing, pour promouvoir efficacement des produits ou services et atteindre les utilisateurs mobiles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13710], "aliases": ["b6c20415-9ad7-46af-aa62-7a735d5564d4"], "wikientity": {"label": "Webmarketing", "definition": "Le webmarketing (ou netmarketing ou cybermarketing - termes obsolètes) est une sous-catégorie du marketing digital qui se concentre spécifiquement sur les activités de marketing en ligne. Le marketing digital, quant à lui, englobe toutes les formes de marketing numérique, qu'elles soient en ligne ou hors ligne, et utilise une gamme de canaux et de technologies pour atteindre les consommateurs. Le webmarketing a pour objectif d'améliorer la visibilité et le trafic d'un site Web en utilisant Internet comme principal canal de prospection.", "page_id": "499657", "wikidata_id": "Q3008173", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le webmarketing est très pertinent car il englobe les techniques utilisées pour promouvoir des produits en ligne, ce qui est central pour analyser le ROI d'actions marketing."}, {"concept": {"id": "6d35ed94-c063-4944-b49e-ccf41ccc7ff8", "label": "SEO (Search Engine Optimization)", "definition": "Le SEO (Search Engine Optimization ou Optimisation pour les moteurs de recherche) et le référencement désignent la même pratique, qui consiste en un ensemble de techniques et de stratégies visant à optimiser le contenu, la structure et l'accessibilité des sites web afin d'améliorer leur classement et leur visibilité organique dans les résultats naturels des moteurs de recherche. Cela inclut des pratiques telles que l'optimisation pour les appareils mobiles, l'utilisation de mots-clés pertinents, l'amélioration de l'expérience utilisateur, la création de liens entrants, ainsi que d'autres méthodes permettant d'attirer un trafic organique accru sans recourir à des paiements directs. Le référencement naturel est essentiel pour rendre un site plus pertinent tant pour les utilisateurs que pour les moteurs de recherche, et il joue un rôle crucial dans la stratégie marketing numérique globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13666, 13677, 13705, 13707, 13710], "aliases": ["a26e73e6-05cd-407b-85f2-d57252b5dd90", "9b9214b2-cf98-456d-8434-e0b1f4bedc62", "3e30de4e-0d07-43e3-b4a9-7939e4eb124e", "0ddaedd3-4ef2-4f08-be35-453e171dde16", "3d536f63-e476-49eb-8c0c-74318db9da65", "3a53afc0-dd36-4a0c-b075-050dba40c3ca", "65f579a3-8c4e-40dd-96ab-6c512ccf5f0f", "b992c66b-0b98-4618-a3bb-abf0d268b03a", "932a7b1a-958a-41be-9061-52a61ca3215f", "fbc6c4de-4399-4a67-98d2-b6082b8fa636", "1a1b7d2a-c9e0-42e8-a50b-472a956dc805", "80e7484e-1d7e-43aa-8d8d-fc8c21b067b2", "cec3f243-9824-43a4-b8b9-9c18c9b22222", "90ca5ae8-1cf0-4e26-8054-d186a38040bc", "973ce59f-2513-4b99-b8db-b582b9c16fe4", "62c7e555-81f2-43aa-b329-10a346db9f36"], "wikientity": {"label": "Optimisation pour les moteurs de recherche", "definition": "L'optimisation pour les moteurs de recherche, aussi connue sous le nom de référencement naturel et le sigle SEO (de l'anglais « Search Engine Optimization »), inclut l'ensemble des techniques qui visent à améliorer le positionnement d'une page, d'un site ou d'une application web dans la page de résultats d'un moteur de recherche.\nCes techniques cherchent à améliorer la compréhension et la prise en compte de la thématique et du contenu d'une ou de l'ensemble des pages d'un site web par l'algorithme de classement des moteurs de recherche.", "page_id": "468524", "wikidata_id": "Q180711", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Le SEO est crucial pour améliorer la visibilité et l'attractivité d'un site web, ce qui influence directement le retour sur investissement des actions marketing."}, {"concept": {"id": "64100396-f632-44ca-a036-4c0ae2f1cad6", "label": "E-qualité", "definition": "Capacité d'un service en ligne à répondre aux attentes et exigences des utilisateurs, essentielle pour la satisfaction client.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'e-qualité est essentielle pour répondre aux attentes des utilisateurs, ce qui peut avoir un impact significatif sur le retour sur investissement des actions marketing."}, {"concept": {"id": "97773262-3ef9-493f-8aea-44b4ef91a06d", "label": "Marketing", "definition": "Discipline visant à promouvoir et vendre des produits ou services, incluant des stratégies comme le mass mailing, le suivi de campagnes sponsorisées, ainsi que des techniques pour attirer et fidéliser les clients dans un environnement concurrentiel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13707, 13710], "aliases": ["f5d04d30-82c0-4c13-a061-0e9142cd3990"], "wikientity": {"label": "Marketing", "definition": "Le marketing, ou la mercatique, est le processus d'identification des clients et de « création, communication, livraison et échange » de biens et services pour la satisfaction et la fidélisation de ces clients. C'est l'un des principaux composants de business management et du commerce.\nLe marketing est généralement réalisé par le vendeur, généralement un détaillant ou un fabricant.", "page_id": "26873", "wikidata_id": "Q39809", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Marketing", "definition": "the commercial processes involved in promoting and selling and distributing a product or service", "name": "marketing.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "Le marketing est essentiel pour générer des actions dont on peut mesurer le ROI, bien qu'il soit un terme plus large que le seul retour sur investissement."}, {"concept": {"id": "ec55ef1f-c143-437e-bfde-cd949f81d42b", "label": "Conversion d'action", "definition": "Mesure du succès d'une interaction sur un site web, souvent augmentée par le respect des principes ergonomiques.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La conversion d'action est directement liée à la mesure du succès des actions marketing, ce qui en fait un concept très pertinent pour évaluer le ROI."}, {"concept": {"id": "a6b2b424-96d2-44e9-a1be-41569d34d757", "label": "Métriques", "definition": "Les métriques sont des mesures quantitatives des performances d'un système, essentielles pour l'analyse et l'optimisation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13655], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les métriques sont cruciales pour analyser et optimiser les performances d'une action marketing, rendant leur évaluation très pertinente pour mesurer le ROI."}, {"concept": {"id": "2a8f9382-3100-45d2-a220-a41f6cbc8ac4", "label": "Perception", "definition": "La perception est la manière dont les utilisateurs interprètent et évaluent leur expérience avec un produit ou service, incluant la facilité d'interaction et de navigation sur un site web. Elle reflète l'ensemble des impressions et jugements que les utilisateurs forment en fonction de leur interaction avec l'interface, influençant ainsi leur satisfaction globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": ["e646b586-5968-4986-ba66-5ff32bebcae4"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'La perception' est cruciale pour comprendre comment une action marketing est reçue par les consommateurs et peut influencer leur comportement d'achat, rendant ainsi cette notion très pertinente pour mesurer le ROI."}, {"concept": {"id": "2a63a687-7848-4167-9417-76df9f1a5632", "label": "Principe de Pareto", "definition": "Établi par Vilfredo Pareto, le Principe de Pareto, également connu sous le nom de Règle de Pareto (80/20), stipule que 80 % des effets proviennent de 20 % des causes. Ce concept statistique est largement appliqué dans divers domaines, y compris la priorisation des fonctionnalités et l'optimisation du contenu web, pour identifier et se concentrer sur les éléments essentiels qui génèrent le plus d'impact.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13704], "aliases": ["cf5f3063-a927-40d1-b2ff-6252b0c9e33e"], "wikientity": {"label": "Principe de Pareto", "definition": "Le principe de Pareto, aussi appelé loi de Pareto, principe des 80-20 ou encore loi des 80-20, est une observation selon laquelle environ 80 % des effets sont le produit de seulement 20 % des causes. Les phénomènes qui illustrent ce principe suivent une distribution de Pareto.", "page_id": "261675", "wikidata_id": "Q182667", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "'Principe de Pareto' est très pertinent car il aide à identifier les actions qui génèrent le plus d'impact, essentiel pour évaluer le ROI des efforts marketing."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'expérience utilisateur et client est directement liée à la satisfaction des consommateurs, ce qui peut influencer le retour sur investissement d'une action marketing en améliorant la fidélité et les taux de conversion."}, {"concept": {"id": "c83cccdb-1327-40ed-9d33-daad4b57aaf0", "label": "Confiance dans le produit", "definition": "La confiance dans un produit se réfère à la certitude qu'ont les utilisateurs quant à sa fiabilité et sa performance, souvent renforcée par des tests rigoureux.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13621], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La confiance dans un produit est cruciale pour encourager les achats répétés et influencer positivement le retour sur investissement des efforts marketing."}, {"concept": {"id": "6023dfd6-ea81-45fa-aefa-6d1c4958f59a", "label": "Confiance du consommateur", "definition": "Niveau de sécurité et de certitude ressenti par un consommateur envers une marque, un produit ou un service, influencé par la clarté des informations et la simplicité des choix offerts, crucial pour encourager l'achat et fidéliser.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13709], "aliases": ["5012851a-50e9-4adf-9c86-472cf6bd5c76"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La confiance du consommateur peut impacter les résultats d'une action marketing et donc son ROI, rendant ce concept pertinent mais secondaire par rapport au sujet principal."}, {"concept": {"id": "ef6bfe65-7e12-4b65-9a46-982ac13d333b", "label": "Taux de rebond", "definition": "Pourcentage d'utilisateurs quittant un site après avoir consulté une seule page, indicatif de l'engagement, de la pertinence du contenu et d'un manque potentiel de satisfaction. Ce taux peut également être influencé par des facteurs tels que la rapidité de chargement du site.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["15834272-b0de-41ad-9880-8511d0bc336f", "774ec0b4-ef5b-41ba-9ea7-de52c6bd163f"], "wikientity": {"label": "Taux de rebond", "definition": "Parmi la Web analytics[pas clair], le taux de rebond (bounce rate en anglais) est un indicateur marketing qui mesure le pourcentage d'internautes qui sont entrés sur une page Web et qui ont quitté le site après, sans consulter d'autres pages. Ils n'ont donc vu qu'une seule page du site.\nUn taux de rebond élevé peut révéler l'insatisfaction des visiteurs due à un mauvais ciblage, un contenu de mauvaise qualité, une mise en page étouffante, une page trop longue à se charger, un manque de Call to action (en), etc.", "page_id": "2810566", "wikidata_id": "Q895134", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Le taux de rebond peut indiquer l'engagement des utilisateurs envers une campagne ou un site web, influençant ainsi indirectement la mesure du ROI."}, {"concept": {"id": "c39fe47c-99bf-4319-981d-05167bec6fe9", "label": "Performance", "definition": "La performance d'un site web, ou performance de site, désigne la capacité d'un site à fonctionner efficacement sous diverses conditions. Cela inclut des aspects tels que la vitesse de chargement, l'expérience utilisateur, le taux de conversion, le trafic, le SEO et l'engagement utilisateur. Ces éléments sont essentiels pour optimiser la visibilité en ligne et influencer directement la satisfaction des utilisateurs dans un contexte numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710, 13707], "aliases": ["dede891d-43b7-4854-988f-3e7873d522b0", "21c56a32-7bf3-417e-b946-57afc8ce7108"], "wikientity": null, "wordnetentity": {"label": "Performance", "definition": "process or manner of functioning or operating", "name": "operation.n.08", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La performance d'un site web influence indirectement le ROI en affectant l'expérience utilisateur et les conversions, ce qui en fait un concept pertinent mais secondaire."}, {"concept": {"id": "25d8b085-b1a7-41fe-a903-4ee8101bb8c2", "label": "projets critiques", "definition": "Initiatives essentielles au succès opérationnel d'une entreprise, nécessitant une attention particulière en raison de leur impact potentiel sur les résultats financiers.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13627], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les projets critiques peuvent impacter significativement les résultats financiers et donc le ROI, mais ils ne sont pas spécifiquement liés aux actions marketing elles-mêmes."}, {"concept": {"id": "656422e2-416e-4c93-b9be-40b3b147a2d9", "label": "Services", "definition": "Qualité des interactions post-visite sur le site, influençant la satisfaction globale de l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Services' influencent la satisfaction utilisateur et peuvent impacter le retour sur investissement d'une action marketing, rendant ce concept assez pertinent."}, {"concept": {"id": "9639a3d5-c874-4c14-9acd-54637974eae7", "label": "Contenus", "definition": "Les contenus désignent la qualité et la pertinence des informations et médias présentés sur un site web, qui sont essentiels pour répondre aux besoins des utilisateurs, attirer et retenir leur attention.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": ["4fed0e65-9f10-4101-9ab6-daa5c6feae5f"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La qualité et la pertinence des contenus sont essentielles pour attirer et retenir les utilisateurs, ce qui influence directement le ROI d'une action marketing."}, {"concept": {"id": "fb401322-f14a-43b2-84dd-a1a613750ca3", "label": "Logistique", "definition": "Gestion des flux de biens, services et informations entre le point d'origine et le point de consommation.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13615], "aliases": [], "wikientity": {"label": "Logistique", "definition": "La logistique est l'activité qui a pour objet de gérer les flux physiques, et les données (informatives, douanières et financières) s'y rapportant, dans le but de mettre à disposition les ressources correspondant à des besoins (plus ou moins) déterminés en respectant les conditions économiques et légales prévues, le degré de qualité de service attendu, les conditions de sécurité et de sûreté réputées satisfaisantes.\nPour le Council of Supply Chain Management Professionnals, la logistique se définit comme : « l'intégration de deux ou plusieurs activités dans le but d'établir des plans, de mettre en œuvre et de contrôler un flux efficace de matières premières, produits semi-finis et produits finis, de leur point d'origine au point de consommation. Ces activités peuvent inclure -sans que la liste soit limitative- le type de service offert aux clients, la prévision de la demande, les communications liées à la distribution, le contrôle des stocks, la manutention des matériaux, le traitement des commandes, le service après vente et des pièces détachées, les achats, l'emballage, le traitement des marchandises retournées, la négociation ou la réutilisation d'éléments récupérables ou mis au rebut, l'organisation des transports ainsi que le transport effectif des marchandises, ainsi que l'entreposage et le stockage ».", "page_id": "29599", "wikidata_id": "Q177777", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Logistique", "definition": "of or relating to logistics", "name": "logistic.a.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La logistique joue un rôle important dans le succès des actions marketing en influençant les coûts et l'efficacité opérationnelle, ce qui peut affecter le calcul du ROI."}, {"concept": {"id": "7c15d1a8-6a39-4bb9-b353-1112c86b8900", "label": "Communication digitale", "definition": "Échange d'informations via des plateformes numériques, nécessitant une ergonomie adaptée pour optimiser l'interaction.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Communication numérique", "definition": "La communication numérique, parfois appelée « communication digitale » (anglicisme), est un champ des sciences de l’information relatif à l'utilisation de l’ensemble des médias numériques : le web, les médias sociaux ou les terminaux mobiles par exemple. Ces médias sont utilisés comme des canaux de diffusion, de partage et de création d'informations.", "page_id": "5018281", "wikidata_id": "Q97368847", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "La communication digitale joue un rôle clé dans les stratégies marketing modernes, influençant ainsi les résultats financiers et le ROI."}], "exercises": [{"exercise": {"id": "9e3ba89c63394a6c8c392b12fed19cec", "question": "Quel est le retour sur investissement estimé pour chaque dollar investi dans l'UX ?", "answers": ["Entre 2 et 100 dollars"], "distractors": ["Entre 5 et 80 dollars", "Entre 10 et 50 dollars", "Entre 3 et 60 dollars", "Entre 20 et 90 dollars", "Entre 1 et 200 dollars", "Entre 30 et 70 dollars", "Entre 15 et 150 dollars", "Entre 5 et 30 dollars", "Entre 4 et 120 dollars"], "feedback": "Selon les recherches de Forrester, chaque dollar investi dans l'UX peut avoir un retour sur investissement allant de 2 dollars à 100 dollars. Cela montre que les entreprises qui investissent dans l'amélioration de l'expérience utilisateur ont tendance à obtenir un rendement élevé et positif sur leur investissement initial.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2f7b62b517f84a09a0713a6a5651d6bd", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "· Taux de rebond : 47% des utilisateurs s'attendent à ce qu'une page web se charge en 2 secondes ou moins, et le taux de rebond augmente de 32% lorsque le temps de chargement passe de 1 à 3 secondes. (Source : Google) · Investissement UX : Chaque dollar investi dans l'UX rapporte entre 2 et 100 dollars en retour. (Source : Forrester Research)", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "34a45c661c9149478d4e95b5abc3df74", "next_id": "2dad34ee8248409e8fd85508f086727b", "prev_id": "3ff1983bdc3443c4be08c48ce343b16e", "associated_block_ids": [], "first_page": 4, "last_page": 4, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du retour sur investissement (ROI) spécifiquement lié à l'expérience utilisateur (UX), qui est un aspect clé de la référence. La question demande aux apprenants d'identifier une estimation précise du ROI pour chaque dollar investi dans l'UX, ce qui est pertinent car cela reflète directement les concepts abordés dans la synthèse concernant l'impact de l'UX sur le ROI marketing. Cependant, bien que cela soit en lien avec le sujet, l'exercice pourrait être amélioré en incluant des questions qui explorent davantage d'autres indicateurs de performance ou tendances mentionnés dans la synthèse, comme le taux de conversion ou la visibilité en ligne."}, {"exercise": {"id": "e90463e2623e45b7aa7f996dfc2579bc", "query": "Les campagnes peuvent être optimisées en surveillant les performances via des outils <blank> qui analysent la navigation des utilisateurs mobiles et les taux de conversion.", "answers": ["d'analyse mobile"], "distractors": [["d'optimisation web", "de géolocalisation", "d'intelligence artificielle", "de publicité classique", "de réseaux sociaux", "de gestion de contenu"]], "feedback": "La réponse correcte est 'analyse mobile' car elle fait référence spécifiquement à l'utilisation d'outils conçus pour suivre et optimiser les performances des campagnes sur des appareils mobiles en analysant des éléments tels que la navigation des utilisateurs ou les taux de conversion. Les autres options, bien que pertinentes dans d'autres contextes, ne sont pas directement liées à ce processus analytique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7c648bb52603467382d53d99a4770e6b", "order": 8.0, "image_url": null, "origin_type": "document_content", "text": "Analytique mobile : Utiliser des outils d'analyse mobile pour suivre les performances des campagnes, la navigation des utilisateurs et les taux de conversion. Plateformes publicitaires mobiles : Maîtriser les plateformes publicitaires telles que Google Ads, Facebook Ads et les réseaux publicitaires mobiles pour cibler efficacement les utilisateurs mobiles. Test A/B mobile : Mettre en place des tests A/B pour expérimenter différentes approches marketing et déterminer ce qui fonctionne le mieux auprès de l'audience mobile.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "b656277f37c94735bde9524588700b2f", "prev_id": "968776dc6f564d0aa0b00a16ec0ab85c", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension des outils d'analyse utilisés pour optimiser les campagnes marketing, ce qui est en lien direct avec la mesure du ROI et l'évaluation des performances mentionnées dans la référence. En particulier, il aborde le suivi des taux de conversion, un KPI essentiel pour évaluer l'efficacité d'une campagne. Cependant, l'exercice pourrait être amélioré en intégrant davantage de concepts liés à la visibilité en ligne ou à l'expérience utilisateur, qui sont également cruciaux dans le contexte du ROI marketing. Néanmoins, il reste pertinent et ciblé sur un aspect clé de la référence."}, {"exercise": {"id": "486167e179c1429eacc12bb2005ff2e4", "statement": "Les tests A/B permettent de tester différentes approches marketing dans le but de comprendre ce qui fonctionne le mieux auprès des utilisateurs mobiles.", "veracity": true, "feedback": "Les tests A/B sont bien utilisés pour comparer différentes stratégies ou éléments marketing afin d'identifier la meilleure approche auprès du public mobile, notamment en termes de conversion et d'engagement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7c648bb52603467382d53d99a4770e6b", "order": 8.0, "image_url": null, "origin_type": "document_content", "text": "Analytique mobile : Utiliser des outils d'analyse mobile pour suivre les performances des campagnes, la navigation des utilisateurs et les taux de conversion. Plateformes publicitaires mobiles : Maîtriser les plateformes publicitaires telles que Google Ads, Facebook Ads et les réseaux publicitaires mobiles pour cibler efficacement les utilisateurs mobiles. Test A/B mobile : Mettre en place des tests A/B pour expérimenter différentes approches marketing et déterminer ce qui fonctionne le mieux auprès de l'audience mobile.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "b656277f37c94735bde9524588700b2f", "prev_id": "968776dc6f564d0aa0b00a16ec0ab85c", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des tests A/B, qui sont un outil pertinent pour mesurer l'efficacité des actions marketing et, par conséquent, le retour sur investissement (ROI). En effet, les tests A/B permettent d'analyser les préférences de consommation et d'identifier les approches qui maximisent le taux de conversion, un KPI clé mentionné dans la synthèse. Cependant, bien que l'exercice soit en lien avec le sujet du ROI et de l'analyse des tendances, il pourrait être amélioré en intégrant davantage d'éléments relatifs à la visibilité en ligne ou à l'expérience utilisateur pour une évaluation plus complète."}, {"exercise": {"id": "20f0c140b108422da73a48463484a150", "statement": "Chaque dollar investi dans l'expérience utilisateur (UX) peut rapporter entre 2 et 100 dollars.", "veracity": true, "feedback": "Il est exact que chaque dollar investi dans l'UX peut générer un retour sur investissement compris entre 2 et 100 dollars comme indiqué.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2f7b62b517f84a09a0713a6a5651d6bd", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "· Taux de rebond : 47% des utilisateurs s'attendent à ce qu'une page web se charge en 2 secondes ou moins, et le taux de rebond augmente de 32% lorsque le temps de chargement passe de 1 à 3 secondes. (Source : Google) · Investissement UX : Chaque dollar investi dans l'UX rapporte entre 2 et 100 dollars en retour. (Source : Forrester Research)", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "34a45c661c9149478d4e95b5abc3df74", "next_id": "2dad34ee8248409e8fd85508f086727b", "prev_id": "3ff1983bdc3443c4be08c48ce343b16e", "associated_block_ids": [], "first_page": 4, "last_page": 4, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le cadre du retour sur investissement (ROI) d'une action marketing, ce qui est un concept clé mentionné dans la référence. En affirmant que chaque dollar investi dans l'UX peut rapporter entre 2 et 100 dollars, il souligne le lien direct entre une bonne UX et la rentabilité des investissements marketing. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects du ROI, comme les autres indicateurs clés de performance ou la visibilité en ligne. Il aurait pu être amélioré en intégrant des éléments supplémentaires liés à la mesure globale du ROI."}, {"exercise": {"id": "47e18ea434d1468fbf90431150106f5a", "question": "Quel est l'objectif principal du référencement naturel (SEO) pour une entreprise ?", "answers": ["Renforcer le trafic organique de son site"], "distractors": ["Générer des revenus directs grâce aux annonces sponsorisées.", "Créer des contenus viraux pour les réseaux sociaux.", "Maximiser les ventes en ligne par des techniques de vente directe.", "Obtenir des résultats spécifiques aux campagnes publicitaires.", "Cibler du trafic provenant des partenaires commerciaux.", "Améliorer l'expérience utilisateur à travers des programmes payants.", "Optimiser les relations presse de l'entreprise.", "Attirer uniquement du trafic international.", "Augmenter le trafic sans tenir compte de sa qualité."], "feedback": "L'objectif principal du référencement naturel (SEO) pour une entreprise est de renforcer le trafic organique de son site. En augmentant ce trafic, l'entreprise améliore sa visibilité en ligne et a plus de chances d'attirer des clients potentiels. Le SEO permet également d'améliorer la crédibilité et la confiance envers l'entreprise, car les résultats organiques sont considérés comme plus fiables que les publicités sponsorisées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f46634da3c1f456fafdddfe25359cf40", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La connaissance du consommateur et de son parcours d'achat est sans aucun doute le levier principal de la conquête client. Plus une entreprise cible avec précision ses besoins, plus elle est en mesure d'y répondre favorablement par différents biais. Tout d'abord, on peut se pencher sur l'importance du référencement naturel (SEO). Pour ceux qui l'ignorent encore, le SEO désigne l'ensemble des procédés utilisés pour renforcer le trafic organique d'un site. Par trafic organique, il faut comprendre celui provenant de résultats naturels, c'est-à-dire non sponsorisés et donc avec des coûts quasiment inexistants ! Pour maximiser ses chances d'apparaître dans la première ligne des résultats de la SERP (page affichée par un moteur de recherche suite à la validation d'une requête ), une entreprise doit maîtriser les trois principes fondamentaux du SEO qui sont :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "efe389cd6a7e4cb3b29a4145b3f880e2", "next_id": "01b85a52efeb4aa9b831e977d4e9b172", "prev_id": "efe389cd6a7e4cb3b29a4145b3f880e2", "associated_block_ids": [], "first_page": 29, "last_page": 30, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à la mesure du ROI dans le contexte du marketing, en se concentrant sur l'importance du référencement naturel (SEO) pour augmenter le trafic organique. Cela est directement pertinent pour analyser et identifier des tendances et préférences de consommation, car une meilleure visibilité en ligne peut influencer les décisions d'achat des consommateurs. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant davantage d'éléments liés à la mesure directe du ROI ou à d'autres KPI mentionnés dans la synthèse."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte de la mesure du retour sur investissement (ROI) d'une action marketing. La question posée est pertinente car elle se concentre sur un aspect clé mentionné dans la synthèse, à savoir que le design doit optimiser l'expérience utilisateur pour influencer positivement le ROI. Cependant, bien que l'exercice soit pertinent, il pourrait être amélioré en intégrant des éléments supplémentaires liés aux autres concepts abordés dans la synthèse, tels que les KPI ou la visibilité en ligne. Cela aurait permis une évaluation plus complète des connaissances de l'apprenant sur le sujet."}, {"exercise": {"id": "66ce7b152de44607970d26f764001f4b", "statement": "Améliorer l'accessibilité d'un site web permet d'augmenter son trafic et ses conversions.", "veracity": true, "feedback": "Cette affirmation est correcte. Il est explicitement mentionné que l'amélioration de l'accessibilité web permet de toucher un public plus large, ce qui a pour conséquence potentielle d'augmenter le trafic ainsi que les conversions sur le site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'impact de l'accessibilité d'un site web sur le trafic et les conversions, ce qui est pertinent pour mesurer le retour sur investissement (ROI) d'une action marketing. L'affirmation fait référence à des concepts clés tels que l'expérience utilisateur (UX) et le taux de conversion, qui sont directement liés à la rentabilité des campagnes marketing. Cependant, bien que cela soit en lien avec le ROI, l'exercice pourrait être amélioré en intégrant des éléments plus spécifiques sur la mesure du ROI lui-même ou en demandant une analyse plus approfondie des KPI associés. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "aad4c1e48aa8491aa7583ee04f54f1c1", "statement": "Le client cherche uniquement une expérience d'achat rapide et sécurisée lorsqu'il achète un produit en ligne.", "veracity": false, "feedback": "Le client souhaite non seulement une expérience d'achat rapide et sécurisée, mais aussi un processus intuitif et de l'attention. Il ne s'agit pas simplement de rapidité et de sécurité, mais également de la qualité générale de l'expérience offerte par la marque ou le service.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4b31a1f15671469492e8fed3422642c0", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Votre stratégie digitale doit être optimisée. Aujourd'hui, qu'il achète un tee-shirt ou une maison, ce que veut le client est simple ; une expérience facile et rapide, un processus d'achat intuitif et sécurisé, mais aussi de l'attention. La journée de cette cible et découpé en plusieurs étapes. Les instant de connexions sont les plus important, car c'est quand l'utilisateur est sur son smartphone qu'il est le plus susceptible d'être intéressé par une offre, un service ou un produit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bd09de86292249b4b366c29892b4d01e", "next_id": "2a91cc8dc04845f9a588cc1cb57eb302", "prev_id": "38a2748c2b83431597eee992a4f91244", "associated_block_ids": [], "first_page": 208, "last_page": 215, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du retour sur investissement (ROI) d'une action marketing. En demandant à l'apprenant de juger la véracité d'une affirmation sur les attentes des clients, il teste leur capacité à reconnaître que les consommateurs recherchent une expérience d'achat qui va au-delà de la simple rapidité et sécurité, intégrant également des éléments tels que l'intuitivité et la qualité générale. Cela est en ligne avec les concepts clés abordés dans la synthèse, notamment l'impact de l'UX sur le ROI. Cependant, pour obtenir un score parfait, l'exercice pourrait inclure des éléments plus directement liés aux métriques spécifiques du ROI ou aux KPI mentionnés dans la synthèse."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension du concept de 'design' dans le contexte de l'expérience utilisateur (UX), qui est un aspect clé lors de l'analyse du retour sur investissement (ROI) d'une action marketing. En demandant à l'apprenant de distinguer entre 'création visuelle' et 'conception', il teste sa capacité à saisir les nuances importantes liées à l'impact du design sur la satisfaction et l'engagement des utilisateurs, éléments cruciaux pour mesurer le ROI. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects liés au ROI marketing, ce qui justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "8217ad5333024525bdfdd890cf843cfb", "question": "Quel est un risque de ne pas adapter une campagne marketing aux mobiles ?", "answers": ["Offrir une expérience utilisateur médiocre"], "distractors": ["Manquer des opportunités d'email marketing", "Ignorer l'importance des visuels", "Perdre des prospects via les réseaux sociaux", "Créer des recommandations génériques", "Négliger la pertinence des mots-clés SEO", "Ne pas tenir compte des horaires de diffusion", "Maximiser l'efficacité des bannières publicitaires", "Former un lien émotionnel trop fort", "Concentrer trop d'efforts sur le budget publicitaire"], "feedback": "En ne s'adaptant pas aux mobiles, il est possible que le contenu et les offres ne soient pas correctement affichés, entraînant une expérience utilisateur médiocre. Cela peut décourager les utilisateurs et réduire leur engagement.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des conséquences d'une mauvaise adaptation d'une campagne marketing, ce qui est pertinent pour mesurer le ROI d'une action marketing. En effet, une expérience utilisateur médiocre peut affecter directement le taux de conversion et, par conséquent, le retour sur investissement. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à la mesure du ROI ou aux indicateurs clés de performance mentionnés dans la synthèse. Il ne couvre pas explicitement les aspects financiers ou les métriques spécifiques du ROI, ce qui limite légèrement sa pertinence."}, {"exercise": {"id": "0593de3540794afa98abc64dd8df016a", "query": "Le SEO permet d'augmenter le trafic <blank> d'un site web en optimisant sa visibilité dans les résultats de recherche non sponsorisés.", "answers": ["organique"], "distractors": [["payant", "direct", "social", "publicitaire", "lié", "sponsorisé"]], "feedback": "Le terme 'organique' se réfère à tout trafic qui provient directement des résultats naturels sur un moteur de recherche, contrairement aux visites issues des liens sponsorisés ou des publicités payantes. Le SEO vise précisément à augmenter ce type de trafic grâce à l'optimisation du contenu et des mots-clés.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f46634da3c1f456fafdddfe25359cf40", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La connaissance du consommateur et de son parcours d'achat est sans aucun doute le levier principal de la conquête client. Plus une entreprise cible avec précision ses besoins, plus elle est en mesure d'y répondre favorablement par différents biais. Tout d'abord, on peut se pencher sur l'importance du référencement naturel (SEO). Pour ceux qui l'ignorent encore, le SEO désigne l'ensemble des procédés utilisés pour renforcer le trafic organique d'un site. Par trafic organique, il faut comprendre celui provenant de résultats naturels, c'est-à-dire non sponsorisés et donc avec des coûts quasiment inexistants ! Pour maximiser ses chances d'apparaître dans la première ligne des résultats de la SERP (page affichée par un moteur de recherche suite à la validation d'une requête ), une entreprise doit maîtriser les trois principes fondamentaux du SEO qui sont :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "efe389cd6a7e4cb3b29a4145b3f880e2", "next_id": "01b85a52efeb4aa9b831e977d4e9b172", "prev_id": "efe389cd6a7e4cb3b29a4145b3f880e2", "associated_block_ids": [], "first_page": 29, "last_page": 30, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à la mesure du ROI dans le contexte du marketing, en se concentrant sur l'importance du SEO pour augmenter le trafic organique. Bien que cela soit pertinent pour évaluer une partie de la visibilité en ligne et son impact sur le ROI, l'exercice ne couvre pas directement d'autres aspects importants mentionnés dans la référence, tels que les KPI ou l'expérience utilisateur. Cependant, il reste un bon indicateur de compréhension des éléments qui influencent le ROI marketing."}, {"exercise": {"id": "3f048550008d42839cb0450f76db11d5", "statement": "La production de contenu digital régulier est importante pour améliorer le référencement et attirer de nouveaux clients.", "veracity": true, "feedback": "Il est nécessaire de publier du contenu digital fréquemment pour espérer optimiser son référencement et augmenter sa visibilité auprès des clients potentiels.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "abf54d1f48e64a01aa023027e27e9acb", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Ainsi, un internaute curieux d'en apprendre davantage sur les spécificités de la laine d'Alpaga pourra par exemple tomber sur le site de l'entreprise après avoir tapé la requête suivante : « avantages laine alpaga ». Cependant, il convient de préciser que le SEO demande énormément de temps et d'investissement ! Il ne s'agit pas d'un sprint, mais bel et bien d'une course de fond. À vous de proposer régulièrement du contenu digital de qualité pour espérer booster votre référencement, et attirer de nouveaux clients 6.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1c60da9c43b043fca0a031a43ccb557f", "next_id": "8570e5d003c449e0997ef8eaf4b791cd", "prev_id": "a65ca1a51e9b4a39995bb96d11e9066e", "associated_block_ids": [], "first_page": 31, "last_page": 31, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect pertinent de la mesure du ROI en marketing, notamment l'importance de la visibilité en ligne et du référencement (SEO) pour attirer de nouveaux clients. La réponse correcte souligne que la production régulière de contenu digital contribue à améliorer le référencement, ce qui est directement lié à l'analyse des tendances et des préférences de consommation. Cependant, l'exercice ne couvre pas explicitement d'autres éléments clés mentionnés dans la référence, comme les KPI spécifiques ou l'expérience utilisateur. Ainsi, bien qu'il soit pertinent, il n'évalue pas complètement tous les aspects du ROI marketing."}, {"exercise": {"id": "15aaf95744024038ac5c23a58c47e7ff", "query": "Ne pas adapter correctement le contenu aux appareils mobiles peut entraîner <blank> pour les utilisateurs.", "answers": ["une expérience utilisateur médiocre"], "distractors": [["une augmentation des ventes", "un intérêt accru pour les produits", "une plus grande interaction sociale", "un meilleur engagement", "une réduction des coûts marketing", "une efficacité accrue des campagnes"]], "feedback": "Lorsque le contenu n'est pas bien adapté aux appareils mobiles, cela complique l'interaction avec le site ou l'application, ce qui provoque une expérience utilisateur médiocre. Une mauvaise expérience peut décourager les utilisateurs de continuer à interagir avec la marque sur ces supports.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "968776dc6f564d0aa0b00a16ec0ab85c", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ignorer la convivialité mobile : Ne pas adapter correctement le contenu et les campagnes marketing aux appareils mobiles, ce qui peut entraîner une expérience utilisateur médiocre. Ne pas tenir compte de la localisation : Ne pas utiliser la géolocalisation pour personnaliser les offres en fonction de la localisation des utilisateurs, ce qui limite l'efficacité des campagnes. Surcharger de notifications : Envoyer trop de notifications push ou de messages SMS peut agacer les utilisateurs et entraîner des désabonnements ou des désinstallations d'applications.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "7c648bb52603467382d53d99a4770e6b", "prev_id": "d2016695e3f04c449ea7684a6b807376", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du retour sur investissement (ROI) d'une action marketing. En demandant aux apprenants de compléter une phrase sur les conséquences d'une mauvaise adaptation du contenu aux appareils mobiles, il met en lumière un aspect clé de la synthèse : comment une expérience utilisateur médiocre peut influencer l'engagement des utilisateurs et, par conséquent, le succès d'une campagne marketing. Cependant, bien que pertinent, cet exercice ne couvre pas directement tous les aspects liés à la mesure du ROI ou à l'analyse des tendances et préférences des consommateurs mentionnées dans la référence. Il aurait pu être amélioré en intégrant des éléments plus directement liés à la mesure quantitative du ROI."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du retour sur investissement (ROI) d'une action marketing. En effet, une interface claire et cohérente est essentielle pour optimiser la satisfaction des utilisateurs, ce qui peut influencer positivement le taux de conversion et donc le ROI. Cependant, bien que pertinent, cet exercice ne couvre pas directement tous les aspects clés mentionnés dans la référence, tels que les indicateurs de performance spécifiques ou l'analyse des tendances et préférences de consommation. Il se concentre principalement sur un aspect de l'UX sans aborder les autres éléments cruciaux liés à la mesure du ROI."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect clé de la référence, à savoir l'importance de l'expérience utilisateur (UX) dans le cadre du retour sur investissement (ROI) d'une action marketing. En effet, une bonne UX est mentionnée comme influençant directement la perception et l'engagement des utilisateurs envers une marque, ce qui est pertinent pour mesurer le succès d'une campagne marketing. Cependant, l'exercice se concentre uniquement sur l'UX sans explorer comment cela se relie spécifiquement à la mesure du ROI ou aux autres indicateurs clés de performance mentionnés dans la synthèse. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement tous les aspects nécessaires pour évaluer complètement le ROI d'une action marketing."}, {"exercise": {"id": "dade9be9dad946cdbaa35072f5a2179c", "question": "Quel est l'objectif principal des tests A/B mobile ?", "answers": ["Expérimenter différentes approches pour optimiser les résultats auprès des utilisateurs"], "distractors": ["Mesurer les performances techniques des applications mobiles", "Comparer plusieurs publicités entre elles sur les réseaux sociaux", "Analyser le comportement d'achat en dehors des plateformes mobiles", "Identifier les bugs dans des applications spécifiques", "Tester la rapidité du système d'exploitation mobile", "Évaluer les performances des équipes marketing", "Déterminer la meilleure plateforme publicitaire pour chaque pays", "Suivre l'évolution des prix des campagnes publicitaires", "Analyser les performances des opérateurs téléphoniques"], "feedback": "Les tests A/B mobiles permettent de comparer différentes approches marketing pour identifier celle qui fonctionne le mieux auprès des utilisateurs. En expérimentant, il est possible d'optimiser les résultats pour une audience spécifique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "7c648bb52603467382d53d99a4770e6b", "order": 8.0, "image_url": null, "origin_type": "document_content", "text": "Analytique mobile : Utiliser des outils d'analyse mobile pour suivre les performances des campagnes, la navigation des utilisateurs et les taux de conversion. Plateformes publicitaires mobiles : Maîtriser les plateformes publicitaires telles que Google Ads, Facebook Ads et les réseaux publicitaires mobiles pour cibler efficacement les utilisateurs mobiles. Test A/B mobile : Mettre en place des tests A/B pour expérimenter différentes approches marketing et déterminer ce qui fonctionne le mieux auprès de l'audience mobile.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "f18bde663d784c21927f34e8a5517ad7", "next_id": "b656277f37c94735bde9524588700b2f", "prev_id": "968776dc6f564d0aa0b00a16ec0ab85c", "associated_block_ids": [], "first_page": 1, "last_page": 1, "start_time": null, "end_time": null, "doc_id": 13608, "doc_label": "mobile marketing", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur les tests A/B mobiles, qui sont effectivement liés à l'optimisation des résultats marketing et peuvent influencer le retour sur investissement (ROI) d'une action marketing. Cependant, il ne traite pas directement de la mesure du ROI ou des indicateurs clés de performance mentionnés dans la référence. Bien qu'il soit pertinent pour comprendre comment améliorer les performances d'une campagne, il ne couvre pas tous les aspects essentiels du ROI comme la visibilité en ligne ou l'expérience utilisateur. Ainsi, bien que l'exercice soit pertinent, il n'évalue pas complètement les concepts clés de la référence."}, {"exercise": {"id": "6b8e1b603d2c4fa99ca7110cd586606d", "statement": "Certains contenus de content marketing peuvent avoir une longue durée de vie et continuer à générer du trafic vers le site web de l'entreprise.", "veracity": true, "feedback": "En effet, certains contenus produits dans le cadre du content marketing sont conçus pour perdurer dans le temps et jouer un rôle de passerelle permanente vers le site internet de l'entreprise, contribuant ainsi à ses objectifs commerciaux au long terme.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "cd05e4a7010f4f19bbc6fb4d93991540", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Plus connu sous son l'anglicisme de content marketing, ce levier est particulièrement efficace pour attirer de nouveaux prospects et gagner leur confiance. Pour ceux qui l'ignorent, il désigne tout simplement l'ensemble des contenus diffusés et partagés à propos de votre marque. En bref, le consommateur doit pouvoir percevoir l'identité et les valeurs de votre entreprise derrière votre politique de content marketing. Certains de ces contenus sont amenés à perdurer. Beaucoup occupent d'ailleurs le rôle de passerelle vers votre site internet et vos propositions commerciales.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2fa86b6d7f1041678bab9a96cbcb8341", "next_id": "a2de1b9aab214cb9b6be3095e840ead3", "prev_id": "2fa86b6d7f1041678bab9a96cbcb8341", "associated_block_ids": [], "first_page": 39, "last_page": 40, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent du marketing, à savoir le content marketing et son impact sur le trafic vers le site web, ce qui peut indirectement influencer le ROI. Cependant, il ne teste pas directement la compréhension des concepts clés liés à la mesure du ROI ou des indicateurs spécifiques mentionnés dans la référence, comme le taux de conversion ou l'expérience utilisateur. Bien qu'il soit en lien avec les tendances et préférences de consommation, il manque une connexion plus directe avec les méthodes d'évaluation du ROI marketing."}, {"exercise": {"id": "5c606750887c4757b7d7e67a0202c610", "question": "Que doit faire une entreprise pour améliorer son référencement SEO ?", "answers": ["Publier régulièrement du contenu digital de qualité"], "distractors": ["Réduire le nombre de mots-clés utilisés", "Changer de nom de domaine chaque année", "Optimiser uniquement les images sur le site", "Choisir un hébergeur web coûteux", "Limiter le contenu publié en ligne", "Acheter des publicités payantes exclusivement", "Ignorer les réseaux sociaux", "Créer un site avec peu de pages", "Réinitialiser le référencement chaque mois"], "feedback": "Publier régulièrement du contenu digital de qualité est essentiel pour améliorer son référencement SEO car cela permet d'avoir un site actif et attractif pour les utilisateurs, ainsi que pour les moteurs de recherche. Cela augmente également les chances d'être vu et partagé sur les réseaux sociaux, ce qui peut aider à augmenter la visibilité et la notoriété de l'entreprise en ligne.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "abf54d1f48e64a01aa023027e27e9acb", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Ainsi, un internaute curieux d'en apprendre davantage sur les spécificités de la laine d'Alpaga pourra par exemple tomber sur le site de l'entreprise après avoir tapé la requête suivante : « avantages laine alpaga ». Cependant, il convient de préciser que le SEO demande énormément de temps et d'investissement ! Il ne s'agit pas d'un sprint, mais bel et bien d'une course de fond. À vous de proposer régulièrement du contenu digital de qualité pour espérer booster votre référencement, et attirer de nouveaux clients 6.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1c60da9c43b043fca0a031a43ccb557f", "next_id": "8570e5d003c449e0997ef8eaf4b791cd", "prev_id": "a65ca1a51e9b4a39995bb96d11e9066e", "associated_block_ids": [], "first_page": 31, "last_page": 31, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect important du marketing digital, à savoir le référencement SEO, qui est mentionné dans la synthèse comme un élément clé pour améliorer la visibilité en ligne et, par conséquent, le retour sur investissement (ROI). Cependant, bien que pertinent, l'exercice se concentre uniquement sur une technique spécifique (publier du contenu de qualité) sans aborder directement les autres éléments liés à la mesure du ROI ou à l'analyse des tendances et préférences de consommation. Il aurait été plus pertinent d'inclure des questions qui relient directement ces concepts au ROI ou aux KPI mentionnés dans la synthèse."}, {"exercise": {"id": "0c79cb0dbec84141bd9db5cb2edd85ee", "question": "Quel facteur, en plus de la sémantique, améliore naturellement la visibilité d'un site web ?", "answers": ["La popularité et la fiabilité du site"], "distractors": ["La fréquence des mises à jour du contenu", "La quantité de backlinks divers", "L'ancienneté du nom de domaine", "Le nombre d'images utilisées dans les articles", "Le volume de trafic provenant des réseaux sociaux", "Le design responsive du site web", "La rapidité de chargement des pages", "Le nombre de mots dans chaque article", "Le ratio texte/vidéo dans les publications"], "feedback": "La popularité et la fiabilité d'un site web jouent un rôle crucial dans son référencement. En effet, plus un site est considéré comme populaire et fiable, plus il sera mis en avant sur les moteurs de recherche, ce qui améliore sa visibilité auprès des utilisateurs. Ces facteurs sont donc complémentaires à la sémantique pour truster les premières places de la SERP.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "fd6477be5146496c9d38e9a6815881cc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "· La sémantique : le nerf de la guerre du référencement, à savoir utiliser les expressions et les mots-clés les plus pertinents pour truster les premières places de la SERP. · La popularité : plus un site est considéré comme populaire et fiable, plus il est mis naturellement en avant sur les moteurs de recherche. Exemple : Imaginons le cas d'une entreprise spécialisée dans la confection de pulls en laine d'Alpaga (et pourquoi pas ? ). Pour se faire connaître et attirer de nouveaux clients, celle-ci doit se placer sur des requêtes ciblées afin d'apparaître sur les moteurs de recherche. Cela passe notamment par la production et la diffusion de contenus digitaux (articles de blog, infographies, etc.).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1c60da9c43b043fca0a031a43ccb557f", "next_id": "3bb590c144b7433e986ceb52d7c95ca5", "prev_id": "d63f736dd62a4cfc850dfc3180b55bc1", "associated_block_ids": [], "first_page": 30, "last_page": 31, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension d'un aspect important de la visibilité en ligne, qui est un élément clé dans la mesure du ROI d'une action marketing. La question porte sur les facteurs qui améliorent la visibilité d'un site web, ce qui est pertinent pour analyser l'efficacité des campagnes marketing. Cependant, bien que cela soit lié au sujet du ROI, l'exercice ne teste pas directement la capacité à mesurer ou à interpréter le ROI lui-même ni n'aborde les autres concepts clés mentionnés dans la synthèse, comme le taux de conversion ou l'expérience utilisateur. Par conséquent, il obtient une note de 6 pour sa pertinence."}, {"exercise": {"id": "ef66e7f5ac7d4e3d9969152d5f9ab6ca", "query": "Pour qu'un site soit mieux positionné en fonction des recherches des utilisateurs, il est crucial de travailler sur <blank> pour utiliser les mots-clés adéquats.", "answers": ["la sémantique"], "distractors": [["la structure", "le design", "l'ergonomie", "la vitesse", "les images", "l'accessibilité"]], "feedback": "La sémantique est le facteur crucial qui influence le référencement d'un site. Elle permet d'utiliser les expressions et mots-clés pertinents pour correspondre aux requêtes des utilisateurs, améliorant ainsi la visibilité dans les résultats des moteurs de recherche.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "fd6477be5146496c9d38e9a6815881cc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "· La sémantique : le nerf de la guerre du référencement, à savoir utiliser les expressions et les mots-clés les plus pertinents pour truster les premières places de la SERP. · La popularité : plus un site est considéré comme populaire et fiable, plus il est mis naturellement en avant sur les moteurs de recherche. Exemple : Imaginons le cas d'une entreprise spécialisée dans la confection de pulls en laine d'Alpaga (et pourquoi pas ? ). Pour se faire connaître et attirer de nouveaux clients, celle-ci doit se placer sur des requêtes ciblées afin d'apparaître sur les moteurs de recherche. Cela passe notamment par la production et la diffusion de contenus digitaux (articles de blog, infographies, etc.).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1c60da9c43b043fca0a031a43ccb557f", "next_id": "3bb590c144b7433e986ceb52d7c95ca5", "prev_id": "d63f736dd62a4cfc850dfc3180b55bc1", "associated_block_ids": [], "first_page": 30, "last_page": 31, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'importance de la sémantique dans le référencement d'un site, ce qui est pertinent pour mesurer le ROI d'une action marketing en lien avec la visibilité en ligne. Cependant, il ne couvre pas directement les autres aspects clés du ROI mentionnés dans la référence, tels que les KPI ou l'expérience utilisateur. Bien qu'il soit lié à un élément important du contexte (SEO), il ne permet pas d'évaluer pleinement la maîtrise des concepts globaux liés au retour sur investissement marketing."}, {"exercise": {"id": "cf17a86823ff45ca9015c1bd481c5c52", "statement": "Le SEO est un processus rapide qui permet d'obtenir des résultats immédiats.", "veracity": false, "feedback": "Le SEO demande beaucoup de temps et d'investissement, il s'agit plutôt d'une course de fond qui nécessite une production régulière de contenu de qualité pour améliorer le référencement, et non d'un processus rapide avec des résultats immédiats.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "abf54d1f48e64a01aa023027e27e9acb", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Ainsi, un internaute curieux d'en apprendre davantage sur les spécificités de la laine d'Alpaga pourra par exemple tomber sur le site de l'entreprise après avoir tapé la requête suivante : « avantages laine alpaga ». Cependant, il convient de préciser que le SEO demande énormément de temps et d'investissement ! Il ne s'agit pas d'un sprint, mais bel et bien d'une course de fond. À vous de proposer régulièrement du contenu digital de qualité pour espérer booster votre référencement, et attirer de nouveaux clients 6.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1c60da9c43b043fca0a031a43ccb557f", "next_id": "8570e5d003c449e0997ef8eaf4b791cd", "prev_id": "a65ca1a51e9b4a39995bb96d11e9066e", "associated_block_ids": [], "first_page": 31, "last_page": 31, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect du SEO, qui est mentionné dans la synthèse comme un élément clé pour améliorer la visibilité en ligne et, par conséquent, le ROI d'une action marketing. Bien que l'affirmation ne traite pas directement de la mesure du ROI ou des KPI associés, elle aborde un concept pertinent lié à l'efficacité des actions marketing. Cependant, l'exercice pourrait être amélioré en se concentrant davantage sur les liens directs entre le SEO et le calcul du ROI ou d'autres indicateurs de performance spécifiques."}, {"exercise": {"id": "1ede30a3a3304374b0a8050a6236b341", "statement": "Le nom de marque aide à améliorer le référencement naturel sur les moteurs de recherche.", "veracity": true, "feedback": "Le nom de marque a effectivement un impact sur le référencement naturel (SEO), car il contribue non seulement à votre identité de marque mais aussi à optimiser la visibilité sur les moteurs de recherche.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e40aa21d58334fcaab81ed5abb6c0843", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il garantit l'origine et la qualité du produit ou du service proposé et permet aussi d'optimiser votre référencement naturel sur les différents moteurs de recherche. Il est un élément majeur de votre identité de marque. Il existe quatre conditions pour que votre nom de marque soit valable : Susceptible d'être représenté / Inventé / Unique Licite / Disponible", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "842437dc31f846578f064fbadd9afcbe", "next_id": "fa6d90c457274d149b49775791789621", "prev_id": "3367b79fed6c4fa4842627701404790b", "associated_block_ids": [], "first_page": 10, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13677, "doc_label": "Mat1_L_identité de marque", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect pertinent du retour sur investissement (ROI) en lien avec la visibilité en ligne et le référencement naturel (SEO), qui sont des éléments clés dans l'évaluation de l'efficacité d'une action marketing. Cependant, il ne couvre pas directement la mesure du ROI ou les indicateurs de performance associés, tels que le taux de conversion ou le taux de rebond. Bien qu'il soit lié au sujet, l'exercice pourrait être amélioré en intégrant des questions plus directement liées à la mesure et à l'analyse du ROI pour obtenir une évaluation plus complète."}, {"exercise": {"id": "91612666f9a54904a19eb3493dc3499b", "question": "Quel pourcentage d'utilisateurs est moins susceptible de retourner sur un site après une mauvaise expérience ?", "answers": ["88%"], "distractors": ["75%", "60%", "50%", "92%", "85%", "70%", "95%", "80%", "65%"], "feedback": "Les 88% des utilisateurs évoqués représentent une grande majorité, ce qui montre l'impact important d'une mauvaise expérience sur leur fidélité envers un site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3eeb01e631334863a4262ca1f1c62f75", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "· Fidélité des clients : 88% des utilisateurs sont moins susceptibles de retourner sur un site après une mauvaise expérience. (Source : The Gomez report, Why Web Performance Matters) · Recommandations : Les utilisateurs satisfaits sont plus susceptibles de recommander un produit, ce qui peut augmenter le bouche-à-oreille positif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3d0a5b972ae14aa8becba05987baea25", "next_id": "7947651498ce458cb77a99d5f60f1cce", "prev_id": "a2bd4331283b4f7fad7b7863cddd176d", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'impact de l'expérience utilisateur (UX) sur le comportement des utilisateurs, ce qui est pertinent pour mesurer le ROI d'une action marketing. Cependant, il ne couvre pas directement les concepts clés tels que la mesure du ROI lui-même ou les indicateurs spécifiques comme le taux de conversion ou la visibilité en ligne. Bien qu'il soit lié à l'analyse des tendances et préférences de consommation, il manque une connexion plus directe avec les éléments fondamentaux du ROI marketing. Par conséquent, bien que pertinent, cet exercice n'évalue pas entièrement les objectifs d'apprentissage liés au ROI."}, {"exercise": {"id": "a7ed5fd278444bf88b94b4a8dc1d34f9", "query": "88% des utilisateurs sont moins susceptibles de retourner sur un site après <blank>.", "answers": ["une mauvaise expérience"], "distractors": [["une bonne expérience", "une navigation rapide", "un service client efficace", "avoir reçu une promotion", "une transaction réussie", "une interface conviviale"]], "feedback": "La réponse correcte est 'une mauvaise expérience' car elle affecte négativement la fidélité des clients, les rendant moins susceptibles de revenir. Les autres options évoquent au contraire des éléments positifs qui renforcent généralement la satisfaction des utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3eeb01e631334863a4262ca1f1c62f75", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "· Fidélité des clients : 88% des utilisateurs sont moins susceptibles de retourner sur un site après une mauvaise expérience. (Source : The Gomez report, Why Web Performance Matters) · Recommandations : Les utilisateurs satisfaits sont plus susceptibles de recommander un produit, ce qui peut augmenter le bouche-à-oreille positif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3d0a5b972ae14aa8becba05987baea25", "next_id": "7947651498ce458cb77a99d5f60f1cce", "prev_id": "a2bd4331283b4f7fad7b7863cddd176d", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'impact de l'expérience utilisateur (UX) sur le comportement des utilisateurs, ce qui est pertinent pour mesurer le ROI d'une action marketing. Cependant, il se concentre uniquement sur un aspect spécifique de l'UX sans aborder directement les autres éléments clés mentionnés dans la référence, tels que les KPI ou la visibilité en ligne. Bien qu'il soit utile pour évaluer une partie de la compréhension du sujet, il ne couvre pas suffisamment l'ensemble des concepts liés à la mesure du ROI marketing."}, {"exercise": {"id": "797d0dc52584422a9f1c6db583fb7134", "query": "Le taux de rebond augmente de 32% lorsque le temps de chargement passe de <blank> secondes.", "answers": ["1 à 3"], "distractors": [["3 à 5", "2 à 4", "1 à 5", "2 à 6", "0 à 2", "3 à 6"]], "feedback": "La bonne réponse est '1 à 3' parce que le taux de rebond monte de 32% précisément lorsque le temps de chargement d'une page passe de 1 seconde à 3 secondes. Ce laps de temps est critique pour l'expérience utilisateur, car au-delà de 2 secondes d'attente, les utilisateurs sont plus susceptibles de quitter la page.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2f7b62b517f84a09a0713a6a5651d6bd", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "· Taux de rebond : 47% des utilisateurs s'attendent à ce qu'une page web se charge en 2 secondes ou moins, et le taux de rebond augmente de 32% lorsque le temps de chargement passe de 1 à 3 secondes. (Source : Google) · Investissement UX : Chaque dollar investi dans l'UX rapporte entre 2 et 100 dollars en retour. (Source : Forrester Research)", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "34a45c661c9149478d4e95b5abc3df74", "next_id": "2dad34ee8248409e8fd85508f086727b", "prev_id": "3ff1983bdc3443c4be08c48ce343b16e", "associated_block_ids": [], "first_page": 4, "last_page": 4, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept clé lié à l'expérience utilisateur (UX) et son impact sur le taux de rebond, ce qui est pertinent pour mesurer le retour sur investissement (ROI) d'une action marketing. Cependant, il ne couvre pas directement la mesure du ROI lui-même ni les autres indicateurs mentionnés dans la référence, comme le taux de conversion ou la visibilité en ligne. Bien qu'il soit utile pour comprendre un aspect de l'engagement utilisateur, il manque une connexion plus directe avec l'évaluation globale du ROI marketing."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'expérience utilisateur (UX), qui est mentionné dans la référence comme un facteur influençant le retour sur investissement (ROI) d'une action marketing. En effet, comprendre les besoins et attentes des utilisateurs est crucial pour optimiser la satisfaction et l'engagement, ce qui peut impacter positivement le ROI. Cependant, l'exercice ne teste pas directement la compréhension des concepts clés liés à la mesure du ROI ou aux indicateurs de performance spécifiques évoqués dans la synthèse. Il se concentre davantage sur l'ergonomie que sur les métriques financières ou marketing, ce qui limite sa pertinence par rapport à l'objectif global de mesurer le ROI d'une action marketing."}, {"exercise": {"id": "e776ea599b374df29f25e4fa4a835445", "statement": "88% des utilisateurs recommandent un site après une mauvaise expérience.", "veracity": false, "feedback": "88% des utilisateurs sont moins susceptibles de retourner sur un site après une mauvaise expérience, ce qui est contraire à l'idée qu'ils le recommanderaient. Une mauvaise expérience réduit la fidélité des clients au service en question.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3eeb01e631334863a4262ca1f1c62f75", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "· Fidélité des clients : 88% des utilisateurs sont moins susceptibles de retourner sur un site après une mauvaise expérience. (Source : The Gomez report, Why Web Performance Matters) · Recommandations : Les utilisateurs satisfaits sont plus susceptibles de recommander un produit, ce qui peut augmenter le bouche-à-oreille positif.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3d0a5b972ae14aa8becba05987baea25", "next_id": "7947651498ce458cb77a99d5f60f1cce", "prev_id": "a2bd4331283b4f7fad7b7863cddd176d", "associated_block_ids": [], "first_page": 5, "last_page": 5, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de l'impact de l'expérience utilisateur (UX) sur la fidélité des clients, ce qui est un aspect pertinent du retour sur investissement (ROI) d'une action marketing. Cependant, il ne mesure pas directement la capacité à calculer ou à analyser le ROI lui-même ni n'aborde les indicateurs clés de performance mentionnés dans la référence. Bien qu'il soit lié au sujet, il pourrait être amélioré en intégrant des questions plus directement liées à la mesure du ROI et aux KPI spécifiques."}, {"exercise": {"id": "6f88f17803bd475f9ae4ac2cdda992ab", "statement": "Le taux de rebond augmente de 32% lorsque le temps de chargement passe de 1 à 2 secondes.", "veracity": false, "feedback": "Le taux de rebond augmente de 32% lorsque le temps de chargement passe de 1 à 3 secondes, et non de 1 à 2 secondes.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2f7b62b517f84a09a0713a6a5651d6bd", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "· Taux de rebond : 47% des utilisateurs s'attendent à ce qu'une page web se charge en 2 secondes ou moins, et le taux de rebond augmente de 32% lorsque le temps de chargement passe de 1 à 3 secondes. (Source : Google) · Investissement UX : Chaque dollar investi dans l'UX rapporte entre 2 et 100 dollars en retour. (Source : Forrester Research)", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "34a45c661c9149478d4e95b5abc3df74", "next_id": "2dad34ee8248409e8fd85508f086727b", "prev_id": "3ff1983bdc3443c4be08c48ce343b16e", "associated_block_ids": [], "first_page": 4, "last_page": 4, "start_time": null, "end_time": null, "doc_id": 13670, "doc_label": "Bonus_21B", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un concept lié à l'expérience utilisateur (UX) et son impact sur le taux de rebond, qui est un indicateur pertinent pour mesurer l'engagement des utilisateurs et, par conséquent, peut influencer le retour sur investissement (ROI) d'une action marketing. Cependant, bien que cela soit en lien avec la référence, l'exercice ne couvre pas directement la mesure du ROI ou les KPI associés. Il se concentre plutôt sur une affirmation spécifique concernant le taux de rebond sans explorer comment cela s'intègre dans une analyse plus large du ROI. Cela limite sa pertinence par rapport à l'objectif pédagogique global."}, {"exercise": {"id": "315cfc8b0c0a4c239408287509fd82a3", "statement": "L'ajout d'animations est utilisé uniquement pour rendre un site plus esthétique, sans impact sur l'expérience utilisateur.", "veracity": false, "feedback": "Bien que l'ajout d'animations puisse contribuer à l'esthétique d’un site Web, il ne se limite pas à cela. Les animations jouent également un rôle dans l'expérience utilisateur, en influençant potentiellement les émotions et les perceptions des utilisateurs dans les zones de conflit mentionnées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'expérience utilisateur (UX), qui est un aspect clé dans la mesure du retour sur investissement (ROI) d'une action marketing. En effet, une bonne UX peut influencer le taux de conversion et, par conséquent, le ROI. Cependant, l'exercice se concentre principalement sur les animations et leur impact esthétique plutôt que sur des concepts plus larges tels que les KPI ou la visibilité en ligne, qui sont également cruciaux pour mesurer le ROI. Bien qu'il soit pertinent, il ne couvre pas entièrement les éléments essentiels mentionnés dans la référence."}, {"exercise": {"id": "d76809cc290945e78447dc42776005c7", "statement": "Les animations présentes sur le site de Studio Brot jouent un rôle important dans l'expérience utilisateur en maintenant son attention.", "veracity": true, "feedback": "Les diverses animations présentes sur le site Web de Studio Brot sont conçues pour garder l'utilisateur engagé, en le surprenant et en suscitant la curiosité sur ce qui va suivre.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "5406f7d079a64abf9cf0b94a61af4904", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Studio Brot est une agence de design qui se concentre sur la publicité et l'image de marque. Leurs services sont décomposés et simplifiés, présentés à l'utilisateur sous la forme d'une métaphore de la cuisson du pain (Brot - pain en allemand). Nous sommes tombés amoureux de leurs techniques de navigation et des diverses animations sur le site Web qui vous gardent toujours à l'affût, vous faisant vous demander à quoi vous attendre ensuite.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "f6090b0ed92f42daa23ee91e9a69ea73", "prev_id": "e1fb6be712cb4084b479d027f2ab6e53", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte du retour sur investissement (ROI) d'une action marketing. Il aborde un aspect clé, à savoir comment les animations peuvent influencer l'engagement des utilisateurs, ce qui est pertinent pour mesurer le succès d'une campagne marketing. Cependant, il ne couvre pas directement la mesure du ROI ou des indicateurs spécifiques comme le taux de conversion ou la visibilité en ligne. Ainsi, bien qu'il soit pertinent, il ne teste pas entièrement tous les concepts clés mentionnés dans la référence."}], "sources": [{"document": {"id": 13710, "label": "QUALITE-WEB-_C1", "authors": [], "title": "Qualité Web : Enjeux et Bonnes Pratiques", "content": [], "mime_type": "application/pdf", "short_summary": "La qualité web est essentielle pour répondre aux exigences des utilisateurs et améliorer l'expérience en ligne. Elle englobe des aspects tels que l'accessibilité, le référencement naturel, et la protection des données personnelles.", "long_summary": "- La qualité web définit l'aptitude d'un service en ligne à satisfaire les exigences des utilisateurs.\n- Les enjeux incluent un web concurrentiel, des attentes croissantes des usagers, et la nécessité de visibilité (SEO).\n- Le modèle VPTCS énonce cinq exigences fondamentales : visibilité, perception, technique, contenus, et services.\n- Environ 12 millions de Français sont touchés par un handicap ; améliorer l'accessibilité peut augmenter le trafic et les conversions.\n- La loi RGAA impose aux services publics numériques d'être accessibles à tous.\n- Les bonnes pratiques de qualité web permettent d'éviter des coûts liés à la non-qualité et améliorent l'image de marque.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/a184047_qualite-web-_c1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- J\n===\n\n- Pour commencer : L'exemple du parcours utilisateur #SEO\n===\n\n- Pour commencer : L'exemple du parcours utilisateur #SEO\n===\n\n  - ## Traffic entrant\n\n  - ## Les tendances : le search et le crawl\n\n- Network : Une croissance exponentielle et anarchique\n===\n\n- Les raisons d'appliquer ces règles\n===\n\n- Les bénéfices\n===\n\n  - ## Appliquer les bonnes pratiques de qualité web dès la conception d'un projet web :\n\n- Tu peux me faire un site (vite fait) ?\n===\n\n- Quelles sont les exigences des utilisateurs ?\n===\n\n- Un modèle ?\n===\n\n  - ## Une représentation D\n\n- Chronologie de l'expérience utilisateur (2000)\n===\n\n- Comprendre et structurer les exigences utilisateurs\n===\n\n  - ## Cinq exigences utilisateurs\n\n  - ## Les utilisateurs veulent ... ... des contenus de bonne qualité\n\n- Pas de silos pour l'utilisateur\n===\n\n- Comment les personnes handicapées utilisent-elles un ordinateur?\n===\n\n  - ## Les dispositifs de sorties\n\n- Comment les personnes handicapées utilisent-elles un ordinateur?\n===\n\n  - ## Les dispositifs en entrée\n\n- Les espèces qui survivent ne sont pas les espèces les plus fortes, ni les plus intelligentes, mais celles qui s'adaptent le mieux aux changements. »\n===\n\n- La qualité web\n===\n\n- Faire un audit d'accessibilité avec Ara\n===\n\n  - ## Je démarre un audit\n\n- WCAG 2.0\n===\n\n  - ## RESSOURCES\n\n- Activité\n===\n", "number_of_pages": 56, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 8.2, "top_pages": [33, 34], "top_minutes": []}, {"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.7, "top_pages": [388, 389], "top_minutes": []}]}