{"introduction": "L'identité visuelle d'un site web est cruciale pour sa reconnaissance et son efficacité en tant qu'outil de communication. Elle englobe divers éléments graphiques, la structure de la page, ainsi que des principes de design qui influencent l'expérience utilisateur. Dans cette synthèse, nous explorerons les concepts clés qui définissent l'identité visuelle d'un site web, en mettant l'accent sur leur rôle dans la conception et la réalisation d'interfaces graphiques attrayantes et fonctionnelles.", "synthesis": "Les éléments graphiques constituent le fondement de toute identité visuelle. Ils incluent des images, boutons, icônes et typographie qui facilitent la communication visuelle et améliorent l'interaction utilisateur. La zone d'en-tête joue un rôle essentiel en intégrant le logo et le titre du site, établissant ainsi une première impression forte tout en guidant la navigation.\n\nLe contraste visuel est un principe fondamental qui assure la lisibilité des contenus numériques. En garantissant une opposition adéquate entre les couleurs ou luminosités des éléments, il permet à tous les utilisateurs, y compris ceux ayant des déficiences visuelles, de naviguer efficacement sur le site. La simplicité dans le design favorise également une expérience utilisateur optimale en réduisant les distractions et en rendant les interfaces intuitives.\n\nL'esthétique est indissociable de l'identité visuelle ; elle influence non seulement l'apparence mais aussi l'engagement émotionnel des utilisateurs envers le site. Les balises comme <svg> permettent d'intégrer des graphiques vectoriels scalables tout en prenant en compte l'accessibilité grâce à des descriptions textuelles.\n\nL'organisation de page est essentielle pour optimiser la navigation ; elle définit comment les éléments sont agencés pour guider efficacement l'utilisateur à travers le contenu. L'ergonomie web se concentre sur cette adaptabilité afin d'assurer une utilisation intuitive et confortable.\n\nLes contenus visibles doivent être pertinents et bien structurés pour attirer et retenir l'attention des utilisateurs. La cohérence dans le design renforce cette expérience fluide, tandis que la navigation facilite le déplacement au sein du site.\n\nLa conception d'expérience utilisateur (UX) intègre tous ces aspects pour créer des interactions significatives entre les utilisateurs et les produits numériques. Les outils de design web tels qu'Adobe XD ou Figma aident à réaliser ces concepts avec précision.\n\nEnfin, il est crucial de garantir que toutes les informations soient accessibles ; cela inclut non seulement la lisibilité du texte mais aussi l'utilisation appropriée de couleurs pour transmettre des informations sans exclure certains utilisateurs. En somme, chaque concept interagit avec les autres pour construire une identité visuelle solide qui répond aux besoins variés des utilisateurs.", "concepts": [{"concept": {"id": "a298f2fb-381c-404f-91a5-0c40e082808b", "label": "Éléments graphiques", "definition": "Les éléments graphiques, ou élément graphique au singulier, sont des composants visuels utilisés dans le design numérique, comprenant des images, boutons, icônes, illustrations, motifs et typographie. Ils sont essentiels pour la communication visuelle et aident à la compréhension d'informations complexes tout en influençant l'interaction utilisateur au sein d'une interface.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13691, 13708], "aliases": ["be149870-fa3a-4601-bea3-588122cd532a", "9c2014a4-a6ee-4019-8823-ac1d815fee10", "281696df-e725-4c8c-9fe3-d7528e4a72c6"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Les éléments graphiques sont fondamentaux pour définir l'identité visuelle d'un site web, car ils englobent tous les composants visuels nécessaires à une interface attrayante et fonctionnelle."}, {"concept": {"id": "d4605453-350f-4fb5-a9bb-d19ea166d057", "label": "Zone d'en-tête", "definition": "Section supérieure d'un document contenant des éléments comme le titre et le logo, essentielle pour l'identité visuelle et la navigation du site.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Zone d'en-tête' est directement liée à l'identité visuelle d'un site web, car elle contient des éléments clés comme le titre et le logo qui définissent la marque."}, {"concept": {"id": "9afb0643-e273-456d-8fd2-4ab13b0d8236", "label": "Contraste visuel", "definition": "Le contraste visuel, ou ratio de contraste, désigne la mesure de l'opposition entre la luminosité ou la couleur d'un élément de premier plan et celle d'un arrière-plan. Ce contraste est essentiel pour garantir la lisibilité et l'accessibilité des contenus numériques sur les pages web et les interfaces visuelles, en particulier pour les utilisateurs ayant des déficiences visuelles. Il joue un rôle crucial dans l'expérience utilisateur en assurant que le contenu soit facilement discernable par tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707, 13710, 13708], "aliases": ["5c481e4e-e436-4bb7-a7e9-53bc0830e306", "b12c3286-f79e-4321-a6d3-db4c95e9c849", "650d5354-ed61-4940-8878-706a15f07f6f", "1c2f3e20-96e3-4275-8631-9e9564ed2ed1", "c4dddffe-8da9-4405-8b54-28eb0959e6dd", "7141a9bd-f2a9-4685-95e3-5e81f87d7c9a", "cd3ee3d7-bb6f-4084-9226-a941f6eb43b9"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Le contraste visuel est crucial pour garantir que l'identité visuelle d'un site soit non seulement esthétique mais aussi accessible et lisible par tous les utilisateurs."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 10, "justification": "'Simplicité' est un principe fondamental du design qui aide à créer une identité visuelle claire et efficace en éliminant le superflu et en favorisant une expérience utilisateur optimale."}, {"concept": {"id": "9b33923b-cc6a-400b-aaab-4294aa02137a", "label": "Esthétique", "definition": "L'esthétique en design désigne la qualité visuelle d'un produit ou d'une interface, influençant l'apparence qui attire l'utilisateur et améliore son engagement. Elle joue un rôle crucial dans la perception et les émotions suscitées chez le spectateur, tout en devant être équilibrée avec la fonctionnalité pour garantir une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13673, 13670], "aliases": ["f5f913e4-360a-4d78-8fe1-49c768c0cd70", "e4830178-1c42-4d51-bf53-151ae9f62500", "153e65b3-262b-4a2a-a5ef-e0f33f3ee124"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "L'esthétique est centrale à la définition de l'identité visuelle d'un site web, influençant directement son attrait et son engagement auprès des utilisateurs."}, {"concept": {"id": "8fc6d3ef-ef25-4986-9a69-a6b2300569d6", "label": "Balise <svg>", "definition": "La balise <svg> (Scalable Vector Graphics) est un élément HTML et un format graphique vectoriel basé sur XML utilisé pour intégrer des graphiques vectoriels scalables dans le développement web. Elle permet de créer des images en deux dimensions à l'aide de balises XML, offrant une mise à l'échelle sans perte de qualité. En plus de sa capacité graphique, la balise <svg> prend en charge des considérations d'accessibilité, nécessitant souvent une description textuelle pour garantir que les contenus graphiques soient accessibles à tous les utilisateurs. La balise peut également contenir du texte alternatif via une balise <text>, inclure des éléments d'interactivité, et supporter des liens via la balise <a>, enrichissant ainsi l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["f2e6e545-bd39-4bb4-90e1-900134f8c872", "bbfb385d-f17a-4ccf-8a01-2f2f9fe56650", "5ed7bc64-6357-488a-b3c3-ffd0f17df113", "cda007cb-84c6-4ce1-96c3-478ed8aa9086", "44261c15-d36a-42d3-9634-60c05ffb8347", "c30c454e-e5ec-4e5c-b117-572d5f6d8e24", "7dca7828-9338-4bfe-b0f4-c413fe8407cd"], "wikientity": {"label": "Scalable Vector Graphics", "definition": "Le Scalable Vector Graphics (en français « graphique vectoriel adaptable »), ou SVG, est un format de données ASCII conçu pour décrire des ensembles de graphiques vectoriels 2D et basé sur XML. Ce format inspiré directement du VML et du PGML est spécifié par le World Wide Web Consortium.", "page_id": "26932", "wikidata_id": "Q2078", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "<svg> est fondamental pour intégrer des graphiques vectoriels scalables dans le design d'un site web, ce qui est au cœur de son identité visuelle."}, {"concept": {"id": "826ac735-9873-4b63-a658-7a9022f13f23", "label": "Organisation de page", "definition": "Structure et agencement des éléments d'une page web pour optimiser la navigation et l'expérience utilisateur, en tenant compte de la hiérarchie visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "L'organisation de page est essentielle pour définir comment les éléments graphiques sont disposés sur un site web, influençant ainsi fortement son identité visuelle."}, {"concept": {"id": "af063a7b-697c-4698-a3f9-571b25d446e7", "label": "Ergonomie web", "definition": "Discipline visant à adapter, concevoir et optimiser les interfaces web et utilisateur afin de garantir une utilisation facile, intuitive et confortable, favorisant ainsi la satisfaction des utilisateurs tout en tenant compte des lois psychologiques comme celles de Miller et Fitts, et améliorant l'expérience utilisateur sur les sites internet.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704, 13707], "aliases": ["a22c9961-6357-4e30-8ce8-913123f918ec", "124581b4-e0cd-46eb-affc-0e2e0d426e33"], "wikientity": {"label": "Ergonomie des interfaces informatiques", "definition": "L'ergonomie informatique (ou ergonomie des interfaces) est une branche de l'ergonomie, qui a pour objectif d'améliorer les interactions homme-machine, la facilité d’utilisation et d’apprentissage des produits interactifs. Cette pratique cherche à concevoir ou modifier des interfaces afin qu'elles soient en adéquation avec les caractéristiques physiologiques, perceptives et cognitives de leurs utilisateurs potentiels. Elle s'appuie sur différentes  méthodes de conception et d’évaluation permettant d’obtenir le logiciel ou le site web le mieux adapté aux utilisateurs visés.", "page_id": "4962192", "wikidata_id": "Q1642623", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 10, "justification": "L'ergonomie web est centrale pour définir une identité visuelle efficace, car elle englobe la conception et l'optimisation des interfaces pour une utilisation intuitive et agréable."}, {"concept": {"id": "9639a3d5-c874-4c14-9acd-54637974eae7", "label": "Contenus", "definition": "Les contenus désignent la qualité et la pertinence des informations et médias présentés sur un site web, qui sont essentiels pour répondre aux besoins des utilisateurs, attirer et retenir leur attention.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": ["4fed0e65-9f10-4101-9ab6-daa5c6feae5f"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "'Contenus' sont au cœur même de l'identité visuelle d'un site web car ils déterminent comment les utilisateurs perçoivent et interagissent avec celui-ci."}, {"concept": {"id": "4e982062-6382-41e8-9745-575fa9d4fa1d", "label": "Shadcn UI", "definition": "Shadcn UI est une bibliothèque de composants React optimisés pour un design moderne et une expérience utilisateur fluide. Elle fournit des composants standards personnalisables, faciles à intégrer, similaires à ceux de Magic UI, permettant aux développeurs de créer des interfaces utilisateur attrayantes et fonctionnelles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": ["fa5cbdf3-ae35-45a6-b36f-ecb0145385b5"], "wikientity": null, "wordnetentity": null}, "score": 10, "justification": "Shadcn UI fournit des composants graphiques modernes qui sont essentiels pour créer une identité visuelle attrayante et fonctionnelle sur un site web."}, {"concept": {"id": "b73644a0-a450-4aa4-9e3b-96cc1c0da4c7", "label": "Image", "definition": "Représentations visuelles d'un sujet, essentielles pour la communication et l'interprétation dans le design graphique et le contenu numérique, influençant la perception et l'émotion du spectateur tout en nécessitant des alternatives textuelles pour l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13673, 13708], "aliases": ["80c5a2bd-e629-418c-9b04-724cab9f716f"], "wikientity": {"label": "Image", "definition": "Une image est une représentation visuelle, voire mentale, de quelque chose (objet, être vivant ou concept).  \nElle peut être naturelle (ombre, reflet) ou artificielle (sculpture, peinture, photographie), visuelle ou non, tangible ou conceptuelle (métaphore), elle peut entretenir un rapport de ressemblance directe avec son modèle ou au contraire y être liée par un rapport plus symbolique. \nPour la sémiologie ou sémiotique, qui a développé tout un secteur de sémiotique visuelle, l'image est conçue comme produite par un langage spécifique.", "page_id": "19697", "wikidata_id": "Q478798", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Image", "definition": "a visual representation (of an object or scene or person or abstraction) produced on a surface", "name": "picture.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "Les images sont essentielles pour la communication visuelle et l'identité d'un site web, car elles influencent directement la perception et l'émotion des utilisateurs."}, {"concept": {"id": "bbec4b6c-ecb2-4980-a828-4ea2e6a15f47", "label": "Cohérence", "definition": "Uniformité dans le design et les interactions au sein d'une interface ou d'une application, favorisant une meilleure compréhension et garantissant une expérience fluide pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["df6e29c5-d22e-4955-90b8-9e1627d2e164"], "wikientity": null, "wordnetentity": {"label": "Cohérence", "definition": "a harmonious uniformity or agreement among things or parts", "name": "consistency.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "'Cohérence' est essentielle dans le design graphique pour maintenir une identité visuelle uniforme à travers toutes les pages et éléments d'un site web."}, {"concept": {"id": "65a2d925-96a7-48d0-94eb-7917f284ca13", "label": "Navigation", "definition": "La navigation, ou système de navigation, désigne le processus et les systèmes utilisés pour se déplacer efficacement et intuitivement à travers les différentes sections ou pages d'une interface web ou d'une application. Cela inclut l'utilisation de menus, de tables des matières, de plans du site et d'autres méthodes qui contribuent à une expérience fluide, à l'ergonomie, à la compréhension du site et à l'accessibilité. Les systèmes de navigation facilitent également la recherche d'informations via des moteurs de recherche intégrés.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13666, 13708], "aliases": ["5f336d11-a83e-4c09-b404-30caf3494f2e", "c7ba75e2-9acf-40e4-b21f-c85f713d24b5", "79990658-2b4b-49e2-890e-ea7343e190ce", "886ea679-2ba8-4a0b-885b-281920a96a5e", "810c55c8-6be9-4b80-9b41-622b41ddf2e9"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Navigation' est cruciale pour une bonne expérience utilisateur et contribue indirectement à renforcer l'identité visuelle en facilitant la découverte du contenu."}, {"concept": {"id": "baebe016-d0cc-4e32-9346-f7e1124193a3", "label": "Conception d'Expérience Utilisateur (UX)", "definition": "La conception d'expérience utilisateur (UX) est une discipline centrée sur l'optimisation des interactions entre les utilisateurs et les produits ou services numériques. Elle vise à améliorer la satisfaction et l'efficacité de l'utilisation en créant des interfaces utilisateur intuitives et attrayantes, tout en tenant compte des comportements, besoins cognitifs et préférences des utilisateurs finaux. Ce processus englobe à la fois l'esthétique et la fonctionnalité, influençant ainsi l'expérience globale par des choix visuels et structurels. Les professionnels tels que les designers UX et UI travaillent à établir des interactions significatives, simplifiant l'interaction utilisateur tout en gérant la complexité sous-jacente du système.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13609, 13709], "aliases": ["dbb0eb49-384a-4835-8a27-f3df10e75759", "91010b14-36ae-419d-bf38-a846de1275f6", "574e83b8-4354-48fa-850e-93c5120ebc83", "ecf19b49-88ec-4c4c-a1b6-95ffa690e97f", "25934ed3-33c1-4498-8e65-074291667094", "796f5e0a-7a74-4541-adfb-b2193ad73b61", "a23c6da5-a4ab-4891-991e-7b937aa0abdc", "37ee1509-2635-464b-9584-a9b0c9d9c8ad", "c00973e6-b1c9-4905-942b-5be484cb15c3", "d4bcea8d-2203-4129-9886-2b5a3d013def", "10afcc11-a32f-4ff7-b2c9-b91fd8f41279", "bfa65925-0083-4475-bf52-1b49b880a8ef", "172c8581-4218-4949-9879-3623e9c81b76", "84c2a388-034d-4adb-8881-3d024eed3a5c", "54158781-d4d4-4026-a63f-e0e8693a8902", "9f681d3a-0c7c-4485-9bcf-e52381ff9719", "da83989a-f0e2-4e84-b8e1-dbb6cfe0e312"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Conception d'Expérience Utilisateur (UX)' est hautement pertinente, car elle englobe à la fois les aspects esthétiques et fonctionnels qui définissent l'identité visuelle d'un site web."}, {"concept": {"id": "7cff2f67-e7cc-4264-ade4-2d0d96f0cadb", "label": "Outils de design web", "definition": "Logiciels utilisés par les designers pour créer des interfaces utilisateur attrayantes et fonctionnelles, tels que Adobe XD ou Figma.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les outils de design web sont essentiels pour définir l'identité visuelle d'un site, car ils permettent aux designers de créer des interfaces attrayantes et fonctionnelles qui reflètent cette identité."}, {"concept": {"id": "5a5218df-a742-48f6-a66e-29c886266cdc", "label": "Contenu visible", "definition": "Éléments présents même sans CSS, garantissant que l'information est accessible indépendamment des styles appliqués.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le contenu visible est crucial pour l'identité visuelle car il garantit que les informations sont accessibles même sans styles appliqués, renforçant ainsi la cohérence visuelle."}, {"concept": {"id": "93243cf1-1c62-40e6-b2ac-c4f1322cfadb", "label": "Utilisabilité", "definition": "Mesure de l'efficacité et de la satisfaction d'une interface utilisateur, essentielle pour garantir une interaction fluide et intuitive.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": {"label": "Utilisabilité", "definition": "L’utilisabilité, ou encore aptitude à l'utilisation est définie par la norme ISO 9241-11 comme « le degré selon lequel un produit peut être utilisé, par des utilisateurs identifiés, pour atteindre des buts définis avec efficacité, efficience et satisfaction, dans un contexte d’utilisation spécifié ».\nC'est une notion proche de celle d'affordance, ou même d’ergonomie qui est cependant plus large.\nLes critères de l’utilisabilité sont :\n\nl’efficacité : le produit permet à ses utilisateurs d’atteindre le résultat prévu.", "page_id": "142385", "wikidata_id": "Q216378", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'utilisabilité est essentielle pour garantir que l'identité visuelle soit non seulement esthétique mais aussi fonctionnelle et intuitive pour les utilisateurs."}, {"concept": {"id": "7fcc9498-9b97-4289-a01d-189889aa59c3", "label": "Couleur comme information", "definition": "Principe selon lequel l'information ne doit pas être transmise uniquement par la couleur ou l'utilisation de couleurs, afin d'assurer l'accessibilité pour tous les utilisateurs et éviter toute confusion pour ceux qui peuvent avoir des difficultés à percevoir les couleurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["1cccf89a-d717-4d5a-8956-63d3432cb9ee"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le principe de couleur comme information est crucial dans la définition de l'identité visuelle, car il touche directement à la manière dont les couleurs sont utilisées pour transmettre des messages sans compromettre l'accessibilité."}, {"concept": {"id": "180973ca-7ea4-4179-9de6-4306d5f4a2c2", "label": "Composants d'interface", "definition": "Les composants d'interface sont des éléments interactifs sur une page web, tels que des boutons, des liens et des menus, qui permettent aux utilisateurs d'interagir avec le système et sont essentiels pour l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["b5b72bc5-0aa8-4ebc-9e2a-5b66e752e50d"], "wikientity": {"label": "Composant d'interface graphique", "definition": "En informatique, un composant d'interface graphique (aussi appelé widget en anglais ou encore control) est un élément de base d'une interface graphique avec lequel un utilisateur peut interagir (par exemple une fenêtre ou une zone de texte). Ces composants sont généralement regroupés dans des boîtes à outils graphiques (appelées toolkit en anglais). Une fois assemblés par un programmeur, ces composants forment une interface graphique complète.", "page_id": "1587875", "wikidata_id": "Q605117", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "'Les composants d'interface sont essentiels dans la création d'une identité visuelle cohérente et fonctionnelle sur un site web, car ils représentent les éléments interactifs qui composent cette identité."}, {"concept": {"id": "53e06a2d-caf6-4629-a658-09ac86bdbd5a", "label": "Lisibilité", "definition": "La lisibilité, ou lisibilité du contenu, est la facilité avec laquelle un texte peut être lu et compris. Elle est essentielle pour une communication efficace sur différents dispositifs, notamment en design graphique. La lisibilité est influencée par divers facteurs tels que la taille de la police, le contraste des couleurs, l'espacement entre les éléments graphiques, l'alignement et l'utilisation d'espaces blancs. Elle joue un rôle clé dans la création de documents clairs et attrayants, facilitant ainsi l'engagement du lecteur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13689, 13704], "aliases": ["b8c5760c-dfc7-4024-b3bf-71486715f31a", "d8b6fb54-5650-47e8-90b5-255c29ac47d9", "ac42c27a-e7e7-4411-8928-d3374e5460d2", "2b736be1-f4cf-4b68-8c5f-38e9ac3ca271"], "wikientity": {"label": "Lisibilité (programmation)", "definition": "La lisibilité est une caractéristique d'un programme informatique le rendant plus lisible et compréhensible au niveau de sa logique.\nPar exemple, un programme sans effets de bord et sans commentaire superflu est beaucoup plus lisible[réf. nécessaire] qu'un programme trop commenté, comportant de nombreux sauts de branchements, ou manipulant des structures de données mutables.", "page_id": "436436", "wikidata_id": "Q3242575", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "Lisibilité", "definition": "a quality of writing (print or handwriting) that can be easily read", "name": "legibility.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 9, "justification": "La lisibilité est cruciale pour l'identité visuelle d'un site web, car elle influence directement la manière dont les utilisateurs perçoivent et interagissent avec le contenu graphique et textuel."}, {"concept": {"id": "c0917cf4-4aad-4df0-9239-32d7525e0a0a", "label": "Format vectoriel", "definition": "Type d'image numérique créée à partir de formules mathématiques, permettant un redimensionnement et une mise à l'échelle sans perte de qualité. Les images vectorielles sont souvent utilisées dans le graphisme et la conception pour leur flexibilité, leur précision et leur capacité à conserver des détails nets à différentes tailles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13684, 13708], "aliases": ["63b741a5-71fd-45a9-92ab-4e7439b67384", "4a0cdbcc-be50-44c0-a4ad-f426106737db"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Le format vectoriel est essentiel pour maintenir une qualité graphique élevée lors du redimensionnement, ce qui contribue significativement à une identité visuelle professionnelle."}, {"concept": {"id": "3b4e3edc-01a2-4e45-a97b-d86cbd0b4064", "label": "Fonctionnalités prioritaires", "definition": "Éléments d'une interface jugés essentiels qui doivent être mis en avant pour améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les fonctionnalités prioritaires sont essentielles pour mettre en avant les éléments clés d'une interface, influençant directement la manière dont une identité visuelle est perçue par les utilisateurs."}, {"concept": {"id": "3f7470d7-442d-4922-9f23-70be2de8c8c8", "label": "Accessibilité des contenus visuels", "definition": "L'accessibilité des contenus visuels se réfère à la fourniture de descriptions textuelles pour les images et éléments graphiques, permettant aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, de comprendre le contenu visuel lorsque celui-ci ne peut pas être affiché. Cela inclut l'utilisation d'attributs alternatifs en HTML qui décrivent ces images, ainsi que la mise à disposition de contenu ou fonctionnalités équivalentes lorsque certaines conditions ne sont pas remplies, garantissant ainsi une accessibilité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7f9d95fb-80ae-4ce9-b4ad-ed8ff0eab829", "104cae17-0a9a-49b6-9395-a7a4af1f4c39", "963fcb43-959a-46ac-8a0e-df703abd85f0", "88400249-4250-499f-b98d-a5cb498ee7cc", "5b26344a-b71c-4c0f-b03c-af99333bff27"], "wikientity": {"label": "Alternative textuelle", "definition": "L'alternative textuelle est un texte que l'on associe à un contenu graphique comme une image, une zone cliquable dans une image ou un élément de formulaire de type image, dans un site web ou dans un document produit par un logiciel d'une suite bureautique, pour que l'utilisateur qui ne peut visualiser l'image puisse être informé de ce qu'elle représente et signifie. L'alternative textuelle est restituée à la place de l'image quand celle-ci n'est pas consultable.\nL'alternative textuelle, dont l'emploi est obligatoire dans le cadre de l'accessibilité du web, concerne tant les personnes qui utilisent un navigateur textuel ou un lecteur d'écran, que celles qui, par choix ou à cause d'un problème technique, ne peuvent visualiser l'image.", "page_id": "7715605", "wikidata_id": "Q1067764", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "'L'accessibilité des contenus visuels est cruciale pour garantir que tous les utilisateurs perçoivent correctement l'identité visuelle du site, rendant ce concept très pertinent.'"}, {"concept": {"id": "ff356c21-a6a9-4643-9b85-5ea63c1962d7", "label": "Composants d'Interface Utilisateur", "definition": "Les composants d'interface utilisateur sont des unités graphiques indépendantes et réutilisables, telles que des boutons, des liens ou des cartes, qui encapsulent la logique et le rendu d'une partie de l'interface. Ils permettent aux utilisateurs d'interagir avec le contenu et les fonctionnalités sur une page web. Dans des outils comme Figma, ces éléments aident les designers à maintenir une cohérence visuelle tout en facilitant les mises à jour, s'assemblant pour former des structures plus complexes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13668, 13708], "aliases": ["aa4065a5-c93e-4843-8784-987b3fb4a95b", "a52293d6-e08a-4666-9aa0-34c8daaf1426", "c177b8d1-7c43-4e1e-8b3d-ae5c9e7b3057"], "wikientity": {"label": "Composant logiciel", "definition": "En architecture logicielle, un composant logiciel est un élément constitutif d'un logiciel destiné à être incorporé en tant que pièce détachée dans des applications. Les paquets, les bibliothèques logicielles, les exécutables, les fichiers, les bases de données ou encore des éléments de configuration (paramètres, scripts, fichiers de commandes) sont des composants logiciels. \nLes composants logiciels sont développés par des professionnels de l'informatique en vue d'être réutilisés dans leurs propres logiciels, ou en vue d'être mis sur le marché et incorporés dans des logiciels tiers.", "page_id": "1824031", "wikidata_id": "Q17176533", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "Les composants d'interface utilisateur sont fondamentaux pour définir l'identité visuelle d'un site web, car ils englobent les éléments graphiques qui composent l'expérience utilisateur globale."}, {"concept": {"id": "1dec3064-776f-47c4-a74b-f9e1221148b6", "label": "Espacement du texte", "definition": "Réglages des distances entre lignes, paragraphes et caractères, influençant la lisibilité et l'expérience utilisateur sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'espacement du texte est crucial pour la lisibilité et fait partie intégrante des choix typographiques qui influencent directement l'identité visuelle d'un site web."}, {"concept": {"id": "49cfc2c6-bf96-4192-8004-86d1ace1d976", "label": "Image bitmap", "definition": "Représentation graphique numérique composée de pixels, utilisée dans divers formats tels que JPEG ou PNG, ainsi que dans les balises <canvas> pour afficher des informations visuelles sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["3b69cc8b-032e-4ab9-a522-6a5cf578c980"], "wikientity": {"label": "Image matricielle", "definition": "Une image matricielle, ou « carte de points » (de l'anglais bitmap), est une image constituée d'un pavage carré dont chaque élément, appelé point ou pixel, est coloré selon un code enregistré dans un tableau à deux dimensions.\nDans les domaines de l'imagerie numérique et de l'infographie, on parle d'image matricielle par opposition avec l'image vectorielle.", "page_id": "70340", "wikidata_id": "Q182270", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 9, "justification": "L'image bitmap est fondamentale pour créer des éléments graphiques sur un site web, jouant un rôle central dans sa présentation visuelle."}, {"concept": {"id": "78538d75-6f04-4f07-a015-e6fc99f5b5a1", "label": "Exigences utilisateurs", "definition": "Critères fondamentaux que les utilisateurs attendent d'un site web, incluant visibilité, perception, technique, contenus et services.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les exigences utilisateurs sont fondamentales pour définir l'identité visuelle d'un site web, car elles englobent les attentes concernant la visibilité et la perception des éléments graphiques."}, {"concept": {"id": "f8fef91f-49c3-42b5-8011-0d757728f3fe", "label": "Accessibilité de l'information", "definition": "L'accessibilité de l'information stipule que les contenus d'une page web doivent être présentés de manière à ce qu'ils ne dépendent pas uniquement de la forme, de la taille ou de la position pour être compris. Cela implique que l'implémentation des informations doit garantir leur pertinence et leur clarté, indépendamment des caractéristiques visuelles, afin d'assurer une expérience utilisateur inclusive pour tous.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["00c13664-f2f4-4aa1-9b3d-a10e3b0ad4ce"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "L'accessibilité de l'information est cruciale pour définir une identité visuelle inclusive et efficace. Elle garantit que tous les utilisateurs peuvent comprendre et interagir avec le contenu, ce qui est fondamental dans la conception graphique."}, {"concept": {"id": "3763ff44-edb7-487e-8bb8-3a9241bb67ff", "label": "Couleur d'arrière-plan contiguë", "definition": "Couleur directement adjacente au bord extérieur d'un élément graphique, influençant la perception visuelle et l'esthétique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La couleur d'arrière-plan contiguë joue un rôle important dans l'esthétique et la perception visuelle, ce qui est crucial pour établir une identité visuelle cohérente."}, {"concept": {"id": "7843365f-32d0-4ace-98d4-f900474fa71e", "label": "UI Designer", "definition": "Designer d'interface utilisateur responsable de l'apparence visuelle et de l'interactivité d'un produit numérique, complémentaire au travail de l'UX designer.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'UI Designer' est pertinent car ce professionnel se concentre sur l'apparence visuelle du produit numérique, ce qui inclut la définition de son identité visuelle."}, {"concept": {"id": "adeae403-e261-4e4e-9de1-f885ca1eacfa", "label": "Gabarits de pages", "definition": "Modèles préétablis utilisés pour créer des pages web uniformes tout en respectant les principes d'ergonomie.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": {"label": "Gabarit (mise en page)", "definition": "Un gabarit, souvent nommé template ou layout, est un patron de mise en page où l'on place images et textes. \nAussi, il est souvent utilisé de manière répétitive pour créer des documents présentant une même structure. \nOn parle aussi de patron comme en couture ou bien, parfois, de grille.", "page_id": "117934", "wikidata_id": "Q25397911", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "'Gabarits de pages' a une pertinence élevée car ils aident à créer une présentation uniforme qui contribue à l'identité visuelle globale du site."}, {"concept": {"id": "d5b519d8-4769-473a-b5be-3f99566d96c4", "label": "Propriétés CSS de couleur", "definition": "Propriétés telles que color et background-color utilisées pour définir les couleurs des éléments dans une page web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Propriétés CSS de couleur' sont très pertinentes car elles définissent les couleurs qui constituent une part essentielle de l'identité visuelle d'un site web."}, {"concept": {"id": "70a3cabd-4c5e-4877-897a-b00631814b8c", "label": "Magic UI", "definition": "Bibliothèque UI conçue pour créer des interfaces élégantes et fonctionnelles, offrant des composants prêts à l'emploi et spécifiquement développée pour React, idéale pour un développement rapide grâce à ses composants prédéfinis faciles à utiliser.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": ["89987706-dc96-44d1-8631-a92753660f62"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Magic UI fournit des composants prêts à l'emploi pour créer des interfaces élégantes, ce qui est pertinent pour établir une identité visuelle cohérente sur un site web."}, {"concept": {"id": "e0272eef-239a-434a-a2e1-131b467cd06c", "label": "Architecture de menu", "definition": "Disposition des éléments de navigation sur un site web, favorisant une structure intuitive pour les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'architecture de menu joue un rôle important dans la navigation et peut influencer la perception globale de l'identité visuelle d'un site en rendant son contenu accessible et intuitif."}, {"concept": {"id": "0bce8743-1869-49b7-adb6-b369073f5580", "label": "critère 1.8", "definition": "Le critère 1.8 stipule que chaque image texte porteuse d'information doit être remplacée par du texte stylé si aucun mécanisme de remplacement n'est disponible.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le critère 1.8 est pertinent car il concerne l'accessibilité des éléments graphiques, ce qui est essentiel dans la définition de l'identité visuelle d'un site web."}, {"concept": {"id": "04d75263-90f3-4c5f-afb0-72168b1d10dc", "label": "Mécanisme d'affichage", "definition": "Outils ou options permettant aux utilisateurs d'ajuster la présentation du contenu, notamment le contraste des couleurs sur les pages web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un mécanisme d'affichage permettant aux utilisateurs d'ajuster la présentation du contenu contribue significativement à une bonne expérience utilisateur et donc à une identité visuelle efficace."}, {"concept": {"id": "bf2e32cb-e846-41c1-a9c3-26d5c2c4bd57", "label": "Contenu compréhensible", "definition": "Un contenu lisible et cohérent, où l'ordre des éléments et l'enchaînement de la lecture facilitent la compréhension.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un contenu compréhensible est essentiel pour l'identité visuelle d'un site web, car il assure que les éléments graphiques sont accompagnés d'une communication claire et efficace."}, {"concept": {"id": "1156bcce-ad4d-4817-a3b3-a498f7a65dff", "label": "Pixel CSS", "definition": "Unité de mesure définie par le W3C pour garantir une représentation cohérente des éléments visuels sur les écrans.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le pixel CSS est essentiel pour garantir une représentation cohérente des éléments visuels, ce qui est fondamental dans la définition de l'identité visuelle d'un site web."}, {"concept": {"id": "a2ed3777-a1b4-47a1-8983-706adaa17b4e", "label": "critère 11.9", "definition": "Exigence d'accessibilité demandant que les intitulés des boutons soient pertinents et informatifs pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "'Critère d'accessibilité' souligne l'importance d'une communication claire dans le design, ce qui renforce également l'identité visuelle en rendant le contenu plus accessible et informatif."}, {"concept": {"id": "0d0b20be-ccf6-49b9-a7e0-9dc32735d235", "label": "Élément graphique non porteur d'information", "definition": "Image ou partie d'image qui n'apporte pas d'informations supplémentaires, utilisée uniquement pour l'esthétique ou la mise en page dans un contenu numérique, et qui peut avoir une alternative textuelle, réduisant ainsi le besoin d'interprétation visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["add57e72-0da0-492a-a31c-335dad56348b"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Un élément graphique non porteur d'information peut jouer un rôle important dans l'esthétique et la mise en page, contribuant ainsi à l'identité visuelle d'un site web."}, {"concept": {"id": "15a62b20-f459-4e2c-878e-41b378dc3104", "label": "accessibilité", "definition": "La capacité d'un produit ou service, y compris un contenu numérique ou un site web, à être utilisé par toutes les personnes, y compris celles ayant des handicaps. Cela garantit une expérience utilisateur équitable et un accès sans obstacles. Cette accessibilité est souvent régie par des normes telles que les WCAG (Web Content Accessibility Guidelines) et vise à permettre à tous les utilisateurs d'accéder et d'utiliser efficacement le produit ou service.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["241cedb6-cb9a-4f39-95a9-e1b69a5e7b17", "d7f76f3d-fd59-43ba-b939-dd62f6e24ead", "596cb4be-07d8-4022-9374-7314cd48d3a3", "26cd60d9-65ae-45b6-b8cf-453f1f3e44c9", "bdbd4abf-cce9-4489-aa53-43baeaf0e186", "b1ff1e7f-1081-47d9-8179-3eba55f6d47a"], "wikientity": {"label": "Accessibilité aux personnes handicapées", "definition": "L'accessibilité aux personnes handicapées est la possibilité pour les personnes handicapées d'accéder à un lieu physique ou à des informations.\nOn entend généralement par accessibilité l'ensemble des possibilités économiques, matérielles, instrumentales, culturelles ou sociales mises à la disposition d'une personne handicapée.\nEn France, depuis 2006, les pouvoirs publics ont donné une définition à l'accessibilité :\n\n« L’accessibilité permet l’autonomie et la participation des personnes ayant un handicap, en réduisant, voire supprimant, les discordances entre les capacités, les besoins et les souhaits d’une part, et les différentes composantes physiques, organisationnelles et culturelles de leur environnement d’autre part.", "page_id": "436310", "wikidata_id": "Q2822688", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": {"label": "accessibilité", "definition": "the quality of being at hand when needed", "name": "handiness.n.02", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 8, "justification": "L'accessibilité est cruciale dans la définition de l'identité visuelle d'un site web, car elle garantit que tous les utilisateurs peuvent interagir avec le design proposé sans obstacles."}, {"concept": {"id": "44e27262-6d69-4a2a-9fdb-f2e2f0c5887b", "label": "WAI-ARIA", "definition": "WAI-ARIA (Web Accessibility Initiative - Accessible Rich Internet Applications) est un ensemble de spécifications et d'attributs HTML qui vise à améliorer l'accessibilité des applications et contenus web interactifs, en particulier pour les utilisateurs ayant des handicaps. Cette spécification définit comment rendre les applications web accessibles en fournissant des rôles, propriétés et états ARIA qui permettent aux technologies d'assistance, comme les lecteurs d'écran, d'interpréter le contenu de manière plus efficace. WAI-ARIA inclut également des rôles de Landmarks pour identifier les zones principales d'un document, facilitant ainsi la navigation et l'interaction dans des environnements web dynamiques. En intégrant ces éléments, WAI-ARIA contribue à une expérience utilisateur plus inclusive.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["73c091b6-4519-4857-ac14-1c74bbaba67a", "a9d71d85-804f-4899-ab06-6602a12d1d05", "ebf952d1-bcc5-4487-bb10-b767d053ebec", "35f4c20f-038a-44f6-914e-16c0b391baca", "9abdbbed-3f8b-49a3-b165-86e08633e26e", "5c41dca6-816f-41de-92ca-a11fa53dfee1", "5c7e3033-551b-49ed-91e3-8b01f8088774", "deb39e9d-1713-4fae-a15b-06f70f8b7788", "9319759e-a481-45c6-8ca5-5984163530b3", "9c560c29-bab2-442f-aa52-faaf278b20d7", "e41784f5-b41d-46b3-a931-dc9cdba3085f", "c86d0254-a8ef-41f2-a4f5-c70f46acedb0", "eb61d4e5-ebb9-4ef2-9149-be0706cfb804", "cffbeee5-7576-4415-90c7-10ebc65207b1", "27e5a475-5dcd-4f45-a274-48aa9dc54be9", "7e44f4c9-9ebd-4ff8-ad9d-bd114ef14c8c", "7980fa14-07dc-4ee6-a35e-3ce67dc89f74", "aa69c0a5-5df5-488f-8d59-757c45c62e25", "304f8393-c6ef-442e-975f-2e2e6e3b4fbc", "c3fbedf9-65b5-4c23-9e62-75ade0f29848", "8e2e7ad7-bb1a-4b0b-9161-5a1c2ca75d25", "bb6c10c0-46a4-4e14-b1d0-016b492e9643", "3b9773a8-a142-4075-b558-2eebc6bf65cf", "6f72a596-af9e-4212-9c0f-605e4d3d6c8c", "7b9d8839-0c0e-4983-8ef2-ee0473e32563", "0686d9cd-5c6b-416b-a86d-29b60f679705", "48845639-22e4-44d9-8b3e-7fbd54e2d500", "140b1aef-af2c-4c10-b35e-0edac1b2c472", "4b0136cb-9c43-4c4f-b4b0-fc4d19e879e3", "b0d486af-99eb-40cb-8914-82fdcfdfbaee", "73a07340-614f-4c73-bf8f-8c00abd4b02d", "4b167ea9-a781-4acc-af7c-d9c9cc7f10b5", "ff07e88b-8416-47c8-b630-d199ae64885e"], "wikientity": {"label": "Accessible Rich Internet Applications", "definition": "WAI-ARIA (Web Accessibility Initiative - Accessible Rich Internet Applications) est une spécification technique du W3C.\nL'objectif est d'accroître l'accessibilité des contenus dynamiques et des composantes des interfaces dynamiques développées à l'aide d'Ajax, HTML, Javascript et technologies associées. Le HTML ne propose pas de fonctionnalité permettant de créer du contenu dynamique ni des interfaces de contrôle mais permet l'insertion d'applets (Flash, Java) et de scripts traités côté client (généralement Javascript). Les développeurs web utilisent de plus en plus le Javascript pour créer les interfaces de contrôle qu'ils ne peuvent créer à l'aide de HTML seul.", "page_id": "3039431", "wikidata_id": "Q338992", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "WAI-ARIA améliore l'accessibilité des contenus interactifs, ce qui peut faire partie intégrante d'une identité visuelle inclusive et réfléchie dans le design d'un site web."}, {"concept": {"id": "35731d03-1f0f-45f7-9e26-a44b29a90f40", "label": "Légende d'image", "definition": "Texte associé à une image, fournissant des informations complémentaires ou contextuelles, essentiel pour l'accessibilité et la compréhension visuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La légende d'image enrichit le contexte visuel et améliore la compréhension, ce qui est essentiel pour établir une identité visuelle cohérente."}, {"concept": {"id": "8bea4ed6-e0be-42d8-9550-08e27e899656", "label": "Étiquette visible", "definition": "L'étiquette visible, également connue sous le nom d'étiquette de champ de formulaire, est un texte descriptif affiché à l'utilisateur qui identifie et décrit la fonction ou le contenu d'un champ de saisie dans un formulaire. Elle informe l'utilisateur sur le type ou le format des données attendues, ce qui est essentiel pour guider les utilisateurs dans la saisie correcte des données et garantir une navigation accessible. Cette étiquette est souvent placée à côté du champ de formulaire et doit être interprétée selon le contexte d'utilisation, contribuant ainsi à l'accessibilité et à la compréhension des données à saisir.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["31a667fd-4d2d-4bf7-9c32-aba87d6f5552", "44e72e3c-caaf-4def-a438-1bb206e2f2b2", "19586bd9-e5ce-4fcc-a937-584141d233ce", "d45a8f20-b129-433c-ab6c-c29fdb0a7a6b", "61ec6f49-ba27-4d21-8335-3aeeb7721617"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "L'étiquette visible est essentielle pour l'accessibilité et la compréhension des formulaires sur un site web, contribuant ainsi à son identité visuelle en améliorant l'expérience utilisateur."}, {"concept": {"id": "b5030c9d-54f4-4aab-bd56-a2a4cc97d1f5", "label": "Test de contraste", "definition": "Évaluations spécifiques pour mesurer si le rapport de contraste entre le texte et l'arrière-plan respecte les normes d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Le test de contraste est crucial pour définir une identité visuelle accessible, car il assure que le texte est lisible sur différents arrière-plans, ce qui est essentiel dans la conception graphique."}, {"concept": {"id": "9f3e6779-e99a-4220-aae2-e935850a4f20", "label": "Commentaire utilisateur", "definition": "Retour d'expérience et commentaires fournis par les utilisateurs concernant un produit ou service, incluant des retours sur les nouvelles fonctionnalités, essentiels pour l'amélioration continue du développement et de l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13645], "aliases": ["1a10de17-160d-43ce-8969-3d84d3c54884"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "Les commentaires utilisateurs sont essentiels pour affiner et ajuster l'identité visuelle en fonction des retours sur l'expérience utilisateur. Ils jouent un rôle clé dans le développement continu du design."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "Bien que l'expérience utilisateur soit importante pour un site web, elle est plus axée sur la satisfaction globale que sur les aspects spécifiques de l'identité visuelle."}, {"concept": {"id": "adc8dc13-f786-4914-8a14-7ba79f9406d6", "label": "Responsive Design", "definition": "La conception réactive, ou responsive design, est une approche de conception web qui permet aux sites et emails de s'adapter automatiquement à différentes tailles d'écran et formats. Elle ajuste dynamiquement le contenu selon la largeur de l'écran, optimisant ainsi l'expérience utilisateur sur tous les appareils, y compris mobiles et tablettes. Cette méthode garantit une accessibilité améliorée et une expérience utilisateur cohérente sans nécessiter la création de maquettes séparées. Avec l'augmentation du trafic mobile, cette approche est devenue essentielle pour répondre aux besoins variés des utilisateurs sur toutes les plateformes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13608, 13609, 13670, 13705], "aliases": ["efecb8a8-c6df-48af-bf39-bb4da8fd8376", "1f741a6d-bbf7-4bfe-b77b-a1ef82c29bc6", "e1917e2a-f148-467e-8262-4f1dd26e2f71", "cc031509-4f61-49ef-aa86-aa8c871fcb3e", "7bfb57a5-469b-4c0b-9487-f9afdcf3b3cd", "dfaa8d51-d283-479b-9fe7-b089a0e35db8", "54138ec5-0216-46c4-89a9-1c8119032f02", "a8bde322-f83e-42d7-9eb7-e659681882c6", "4fd67f4c-c4cf-4125-bea0-62c60a94d589", "4ea15d31-4c8b-47ac-8abd-3a55541f163e"], "wikientity": {"label": "Site web réactif", "definition": "Un site web réactif (RWD, de l’anglais responsive web design : conception de sites web réactifs) est un site web dont la conception vise, grâce à différents principes et techniques, à offrir une consultation confortable sur des écrans de tailles très différentes. L'utilisateur peut ainsi consulter le même site web à travers une large gamme d'appareils (moniteurs d'ordinateur, smartphone, tablettes, télévision…) avec le même confort visuel et sans avoir recours au défilement horizontal ou au zoom avant/arrière sur les appareils tactiles notamment, manipulations qui peuvent parfois dégrader l'expérience utilisateur, tant en lecture qu'en navigation. Un site web réactif est un exemple de plasticité des interfaces.", "page_id": "6049523", "wikidata_id": "Q420295", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Responsive Design' améliore l'expérience utilisateur en adaptant le contenu aux différents appareils, mais il n'est pas spécifiquement centré sur l'identité visuelle elle-même."}, {"concept": {"id": "fe3431e6-f552-40bf-9acf-a8dc64fff9bb", "label": "Couleur contiguë", "definition": "Couleur touchant directement une autre couleur dans un design graphique, importante pour le contraste et la lisibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Couleur contiguë' est assez pertinent car le choix des couleurs impacte directement l'identité visuelle et le contraste dans le design graphique."}, {"concept": {"id": "7f68a084-10a3-4266-90e0-653c0f007cfd", "label": "Design-first", "definition": "Approche de conception priorisant l'esthétique et l'expérience utilisateur dès le début du processus de développement.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13670], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'approche design-first met l'accent sur l'esthétique dès le début du développement, ce qui est pertinent pour définir une identité visuelle forte."}, {"concept": {"id": "b0965da5-82d8-4e74-a263-4c988e1720bb", "label": "Information par couleur", "definition": "Transmission d'informations visuelles uniquement par couleur, nécessitant des alternatives pour les utilisateurs malvoyants.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'information par couleur touche à l'accessibilité et à la conception visuelle, ce qui est important pour une identité visuelle inclusive."}, {"concept": {"id": "8d20d835-630d-4c6b-8a00-86480b18dc06", "label": "Conception pour les pouces", "definition": "Approche de design axée sur l'accessibilité des éléments d'interface pour une utilisation à une main, particulièrement pertinente pour les appareils mobiles.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La conception pour les pouces est importante dans le contexte de l'identité visuelle d'un site web, surtout pour les appareils mobiles, car elle influence la disposition des éléments graphiques pour une meilleure accessibilité."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les usagers sont au centre du processus de conception et leur compréhension des éléments graphiques est essentielle pour établir une identité visuelle efficace."}, {"concept": {"id": "916d45fb-8de8-4d6d-b59f-490f45450c93", "label": "Balise <canvas>", "definition": "La balise <canvas> est un élément HTML5 qui permet de dessiner des graphiques dynamiques via JavaScript sur une page web. Elle est souvent utilisée pour créer des images bitmap, des animations, des jeux et des applications visuelles interactives. Il est essentiel de fournir une description textuelle du contenu de la balise <canvas> pour les utilisateurs ayant des déficiences visuelles, car cela améliore l'accessibilité du contenu graphique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["eae02101-e80c-411d-8adc-caed6eb3022e", "98686082-c428-4b5d-aa6c-21436ac97aa7", "34dfcfa2-04a9-43d4-8f33-29c9fe8f0f87", "a186b0f2-f065-4ed4-a10b-3924bc3aef84", "5d801026-5898-497b-8954-039fc91e3ab9"], "wikientity": {"label": "Canvas (HTML)", "definition": "L'élément canvas est un composant du langage Web HTML qui permet d'effectuer des rendus dynamiques d'images bitmap en utilisant des scripts dans des langages tels que le javascript. Déjà implémenté dans certains navigateurs, il fait partie de la spécification HTML5. Canvas peut également être utilisé pour mettre en place un moyen de traçage de l'utilisateur sur le site sans avoir à collecter ses données personnelles grâce au canvas fingerprinting.", "page_id": "622027", "wikidata_id": "Q657954", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "<canvas> permet de créer des éléments graphiques dynamiques qui peuvent enrichir l'identité visuelle d'un site, bien qu'il soit plus orienté vers les animations et les interactions."}, {"concept": {"id": "5450ae39-3e32-4f99-b548-b829995da1f5", "label": "Attribut for", "definition": "Un attribut dans la balise <label> qui relie l'étiquette au champ de formulaire correspondant via son id, renforçant ainsi l'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "L'attribut for contribue à l'accessibilité des formulaires, ce qui peut indirectement influencer la perception de l'identité visuelle en améliorant l'expérience utilisateur."}, {"concept": {"id": "4cdd5fe1-8f78-47e8-8a47-efb6850c9496", "label": "Fil d'Ariane", "definition": "Système de navigation indiquant la position actuelle dans la hiérarchie du site, facilitant le retour à des pages précédentes.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Fil d'Ariane (ergonomie)", "definition": "Un fil d’Ariane (en anglais, trail of breadcrumbs ou breadcrumb trail, « chemin de miettes de pain », voir section « étymologie » ci-dessous) est, en ergonomie et plus particulièrement de nos jours dans le domaine de la conception d’interfaces informatiques, une aide à la navigation sous forme de signalisation de la localisation du lecteur dans un document (très souvent, une page de site web). Leur but est de donner aux utilisateurs un moyen de garder une trace de leur emplacement à l'intérieur de programmes, documents ou pages Web.", "page_id": "3841088", "wikidata_id": "Q846205", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Le fil d'Ariane aide à naviguer dans un site et peut contribuer à son identité visuelle en renforçant sa structure et sa hiérarchie.'"}, {"concept": {"id": "c9310ded-8766-479a-88f5-fdf78ee60628", "label": "ensemble de pages", "definition": "Ensemble de pages web interconnectées et cohérentes, appartenant au même nom de domaine, facilitant la navigation et l'organisation du contenu pour l'utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["78ce7188-0f9c-4c16-93f0-ac85c214f1e4"], "wikientity": {"label": "Site web", "definition": "Un site web, site Web, ou simplement site, est un ensemble de pages web et de ressources reliées par des hyperliens, défini et accessible par une adresse web. Un site est développé à l'aide de langages de programmation web, puis hébergé sur un serveur web accessible via le réseau mondial Internet, un intranet local, ou n'importe quel autre réseau, tel que le réseau Tor.\nL'ensemble des sites web publics constituent le World Wide Web.", "page_id": "67346", "wikidata_id": "Q35127", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "L'ensemble de pages est essentiel pour créer une identité visuelle cohérente sur un site web, car il permet de structurer le contenu et de maintenir une navigation harmonieuse."}, {"concept": {"id": "98fbde75-debc-42c3-9335-fdef362eedf8", "label": "description détaillée", "definition": "Texte explicatif qui fournit des informations supplémentaires sur le contenu visuel, associé à une image ou un graphique, essentiel pour l'accessibilité et crucial pour fournir du contexte aux utilisateurs ayant des déficiences visuelles. Cela inclut également des informations complémentaires fournies avec une image pour enrichir sa compréhension au-delà de l'alternative textuelle.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["23af8beb-f355-4a08-8c9b-afd75e44f2da", "5becb9c8-6820-48f8-a82d-c7f419717dce"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Une description détaillée enrichit le contenu visuel et contribue à une meilleure compréhension, ce qui est essentiel pour définir une identité visuelle accessible et informative."}, {"concept": {"id": "f009e74d-6c5b-4761-b732-969300d62140", "label": "Alternative accessible", "definition": "Version d'un contenu qui permet aux utilisateurs ayant des besoins spécifiques d'accéder à la même information ou fonctionnalité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Une alternative accessible permet aux utilisateurs ayant des besoins spécifiques d'accéder au même contenu, contribuant ainsi à une approche inclusive dans la définition de l'identité visuelle."}, {"concept": {"id": "1092d789-d0be-4326-b469-d82156055fd1", "label": "Modèles prédéfinis", "definition": "Structures HTML fournies par Twig pour insérer facilement des données tout en maintenant une séparation claire entre le code et le visuel.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13618], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les modèles prédéfinis en HTML aident à structurer le contenu tout en maintenant une séparation entre le code et le visuel, ce qui est pertinent pour définir l'identité visuelle d'un site."}, {"concept": {"id": "935f36e5-c751-4b36-a60c-e2e65c6fa825", "label": "Tableau de mise en forme", "definition": "Un tableau de mise en forme est un tableau utilisé pour organiser visuellement des données ou du contenu, où le contenu doit rester compréhensible même lorsqu'il est linéarisé. Son utilisation doit également respecter certaines règles d'accessibilité afin de garantir que l'information soit accessible à tous les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["57962488-811b-4da6-8fde-5194589a599d"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Un tableau de mise en forme peut être utilisé pour organiser des éléments graphiques sur un site web, contribuant ainsi à son identité visuelle tout en respectant les règles d'accessibilité."}, {"concept": {"id": "59ea3c79-d694-4b73-ad89-f26c21a0812f", "label": "Balise <nav>", "definition": "Balise HTML utilisée pour définir les zones de navigation dans un document, facilitant l'accès aux sections principales et secondaires.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La balise <nav> est cruciale pour structurer la navigation d'un site web, ce qui fait partie intégrante de son identité visuelle et de son ergonomie."}, {"concept": {"id": "21922d9a-d238-42c7-ba72-ba49bca4f04b", "label": "Lien dont la nature n'est pas évidente", "definition": "Lien pouvant être confondu avec du texte normal si signalé uniquement par couleur, posant problème aux utilisateurs malvoyants.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Ce concept aborde un aspect important de l'accessibilité visuelle qui peut influencer la conception graphique en s'assurant que les liens sont clairement identifiables pour tous les utilisateurs."}, {"concept": {"id": "f9b7ff84-41ad-4b87-9037-60ce30d08594", "label": "DesignGouv", "definition": "Pôle Design des services numériques du gouvernement français, chargé de promouvoir une meilleure expérience utilisateur dans les services publics.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "DesignGouv se concentre sur l'expérience utilisateur et le design des services numériques, ce qui inclut la création d'une identité visuelle cohérente pour les sites web. Cela en fait un concept pertinent dans le cadre de la définition donnée."}], "exercises": [{"exercise": {"id": "ed54c2f40bd14820b101299c86b3975f", "statement": "Un lien signalé uniquement par la couleur peut être ignoré par certains utilisateurs, surtout s'ils ne distinguent pas bien les couleurs.", "veracity": true, "feedback": "Il est exact que si un lien n'est signalé que par la couleur, les utilisateurs ayant une difficulté à percevoir les couleurs peuvent ne pas l'identifier, surtout en l'absence d'autres marqueurs visuels comme un soulignement ou une icône.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 9, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'identité visuelle d'un site web, à savoir l'accessibilité et la lisibilité des éléments graphiques. En soulignant que les liens signalés uniquement par la couleur peuvent être ignorés par certains utilisateurs, il met en lumière l'importance du contraste visuel et de l'utilisation de plusieurs indicateurs pour garantir une navigation efficace pour tous. Cela correspond parfaitement aux concepts abordés dans la synthèse, notamment l'importance de rendre les informations accessibles et visibles pour tous les utilisateurs. Cependant, il aurait pu inclure un élément supplémentaire sur d'autres aspects de l'identité visuelle pour obtenir un score parfait."}, {"exercise": {"id": "2f426f30fa264f6f94c2b738c0c0a2e0", "question": "Quels textes sont concernés par la mesure de contraste selon les directives ?", "answers": ["Le texte, le texte en image et les sous-titres des vidéos"], "distractors": ["Les icônes et illustrations graphiques", "Le texte dans les arrière-plans d'images", "Les bordures et décorations CSS", "Les zones blanches dans une page web", "Les logos dans les animations", "Les liens hypertextes externes", "Les titres des documents PDF", "Les boutons et menus déroulants", "Les annotations dans les diagrammes"], "feedback": "Les directives de contraste s'appliquent au texte principal ainsi qu'aux textes incrustés dans les images et animations (comme les sous-titres). Ces textes doivent être suffisamment contrastés pour être lisibles, même pour les personnes ayant une déficience visuelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f2b15e9b2aef439686cbd8a9e3eaf4ca", "order": 15.0, "image_url": null, "origin_type": "document_content", "text": "Note : la pratique qui consiste à gérer des images en propriété de fond d'éléments via CSS est formellement déconseillée, même si elle est accompagnée d'un texte caché. Note : la mesure de contraste concerne le texte, le texte en image, le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos. Pour le texte et le texte en image dans les animations, le texte de sous-titrage et le texte incrusté dans les vidéos, la taille de la police doit être mesurée par rapport à la taille d'affichage par défaut (telle qu'affichée). Les textes présents dans les éléments d'une image ou d'une vidéo (par exemple un écriteau, une affiche etc.) ne sont pas concernés.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1ab34767803b452ab46a6755582f7b5e", "next_id": "3767e8e96bdf494f8cd8e6b538967a95", "prev_id": "f3447a85d2f14376bd33f7dc7d7e8923", "associated_block_ids": [], "first_page": 94, "last_page": 96, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des directives de contraste, qui est un aspect fondamental de l'identité visuelle d'un site web. En se concentrant sur les textes concernés par ces mesures, il teste la connaissance des éléments graphiques essentiels pour assurer une bonne lisibilité et accessibilité, ce qui est en ligne avec les concepts abordés dans la référence. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des questions sur d'autres éléments graphiques ou principes de design mentionnés dans la synthèse, comme l'ergonomie ou l'esthétique."}, {"exercise": {"id": "63fc6d6be00f486fbc566c553cd77f02", "statement": "Les sites Web minimalistes font souvent usage de typographies complexes et d'une large variété de styles de caractères.", "veracity": false, "feedback": "Les sites Web minimalistes utilisent généralement une typographie simple et une gamme limitée de styles de caractères pour offrir une expérience épurée. L’objectif est de favoriser la lisibilité et éliminer les distractions inutiles, en cohérence avec le principe de réduction des détails.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de design liés à l'identité visuelle d'un site web, en particulier en ce qui concerne l'utilisation de la typographie dans un contexte minimaliste. La réponse correcte souligne l'importance de la simplicité et de la lisibilité, qui sont des éléments clés mentionnés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant d'autres aspects de l'identité visuelle, comme le contraste ou l'organisation de page, pour une évaluation plus complète."}, {"exercise": {"id": "995e290cda554dceb9314682933f7829", "statement": "L'espace blanc, ou espace négatif, est utilisé pour représenter les parties textuelles du design.", "veracity": false, "feedback": "L'espace blanc, également appelé espace négatif, se réfère au vide autour ou à l'intérieur des éléments de conception, et non aux parties textuelles. Il s'agit d'un élément clé pour améliorer la lisibilité et la hiérarchie visuelle dans un design.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d14a9a7a27034d61bf15447e8760f506", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "On parle dans ces cas là d'atomic design. L'atomic design est une méthode qui consiste à découper en différents composants le design d'une interface. Qu'est-ce que l'espace blanc ? L'espace blanc, ou espace négatif, est un terme de conception que nous utilisons pour désigner le vide autour ou à l'intérieur des éléments de la conception.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2c859fc2cc424d1eb5599ccdc481e731", "next_id": "602e32ac6ddc4e08bf14ae5795a39c53", "prev_id": "2c859fc2cc424d1eb5599ccdc481e731", "associated_block_ids": [], "first_page": 268, "last_page": 275, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'espace blanc, qui est un concept pertinent dans le cadre de l'identité visuelle d'un site web. Bien que l'affirmation porte sur une notion spécifique, elle touche à des principes fondamentaux tels que la lisibilité et la hiérarchie visuelle, qui sont essentiels pour concevoir une identité visuelle efficace. Cependant, l'exercice pourrait être amélioré en intégrant des questions plus directement liées aux éléments graphiques mentionnés dans la synthèse, comme les images ou la typographie."}, {"exercise": {"id": "e6abe4b7c1c049b39f395ba056388e95", "question": "Quelle stratégie est recommandée pour l'architecture de menu ?", "answers": ["Favoriser la largeur plutôt que la profondeur du menu"], "distractors": ["Rendre les menus aussi profonds que possible", "Utiliser une seule icône pour chaque menu", "Limiter le nombre d’options visibles à l’écran", "Toujours placer les options populaires en bas du menu", "Privilégier une navigation en profondeur, de multiple niveaux", "Utiliser au maximum des sous-catégories", "Créer des menus très textuels avec de nombreux détails sur chaque option", "Réduire la largeur du menu à un minimum", "Séparer les menus en plusieurs sections indépendantes"], "feedback": "Il est recommandé de favoriser une largeur plutôt qu'une profondeur importante dans l'architecture des menus pour faciliter la navigation. En proposant plus d'options visibles à l'écran, cela permet à l'utilisateur de trouver plus facilement ce qu'il cherche sans être perdu dans un menu trop profond.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'architecture de menu, qui est un aspect clé de l'organisation de page et de la navigation dans le contexte de l'identité visuelle d'un site web. La question cible directement une stratégie recommandée pour optimiser la navigation, ce qui est en ligne avec les concepts abordés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments supplémentaires liés à d'autres aspects de l'identité visuelle, comme le contraste ou l'esthétique, pour obtenir une évaluation encore plus complète des compétences liées à la conception graphique et visuelle."}, {"exercise": {"id": "916215f011f14f91a35952bc1992d123", "question": "Quel aspect devrait être évité pour ne pas perdre l'utilisateur ?", "answers": ["Brouiller les pistes en ne respectant pas les normes de référence"], "distractors": ["Ignorer l'esthétique et la cohérence visuelle", "Limiter le nombre de CTA sur la page", "Utiliser des icônes reconnaissables et familières", "Placer trop de CTA au-dessus de la ligne de flottaison", "Améliorer les contrastes et la lisibilité", "Choisir des animations simples et intuitives", "Appliquer une intégration stricte à l'ensemble des boutons", "Opter pour la simplification des interactions", "Privilegier des CTA transparents pour plus de clarté"], "feedback": "L'une des recommandations pour ne pas perdre l'utilisateur et garder une interface cohérente est de respecter les normes de référence, notamment en matière de design et d'utiliser des éléments familiers pour le guider. En brouillant les pistes, l'utilisateur risque de se sentir perdu ou confus, ce qui peut avoir un impact négatif sur son expérience et sa navigation sur le site. Il est donc important de rester cohérent et de suivre certaines conventions dans la conception de son interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception qui contribuent à l'identité visuelle d'un site web, en se concentrant sur l'importance de respecter les normes de référence pour éviter de perdre l'utilisateur. Cela est pertinent par rapport à la référence, car elle aborde des concepts tels que la cohérence visuelle et l'ergonomie web. Cependant, bien que la question soit pertinente, elle pourrait être améliorée en incluant des éléments plus spécifiques liés aux aspects graphiques mentionnés dans la synthèse, comme le contraste ou l'organisation de page. Néanmoins, elle reste globalement alignée avec les objectifs d'apprentissage."}, {"exercise": {"id": "5af9805f30b344e6988f400813071094", "statement": "Pour éviter de perdre l'utilisateur, il est essentiel de suivre des normes de clarté et de cohérence dans l'interface.", "veracity": true, "feedback": "Il est nécessaire de respecter des normes de clarté et de cohérence afin de ne pas perturber ou désorienter l'utilisateur. Cela contribue à une meilleure expérience et à une navigation plus fluide dans l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "215d3b541fc24509b91fa9b63f4fd190", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il est important de se démarquer et de soigner l'esthétique de votre interface. Cependant, il faut respecter certaines normes de référence - de manière à ne pas brouiller les pistes et perdre votre utilisateur. La clarté et la cohérence sont de mises. Les CTA les plus efficaces sont généralement clairs, mis en valeur, en couleurs monochromatiques et vives, au-dessus de la ligne de flottaison, avec une animation simple pour attirer l'œil.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "ef388382fd184fa3893abb9841217ed6", "next_id": "109634b56f3f41c4a75e9a1e84d1c122", "prev_id": "ef388382fd184fa3893abb9841217ed6", "associated_block_ids": [], "first_page": 383, "last_page": 384, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la clarté et de la cohérence dans l'interface, qui sont des éléments clés pour définir l'identité visuelle d'un site web. La réponse correcte souligne que ces normes contribuent à une meilleure expérience utilisateur, ce qui est en ligne avec les concepts abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des questions plus spécifiques sur d'autres aspects de l'identité visuelle, comme le contraste visuel ou l'esthétique, pour obtenir un score parfait."}, {"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur dans le design d'une identité visuelle, ce qui est un aspect clé mentionné dans la référence. La réponse correcte souligne que le design doit être centré sur les utilisateurs, ce qui est en ligne avec les concepts d'ergonomie et de navigation abordés dans la synthèse. Cependant, bien que l'expérience utilisateur soit essentielle, l'exercice aurait pu explorer davantage d'autres éléments graphiques ou principes comme le contraste visuel ou la cohérence du design pour obtenir une note parfaite. Les distracteurs sont pertinents et permettent de tester la capacité à distinguer les éléments essentiels du design."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des principes de conception d'interface, en particulier l'importance de la visibilité des fonctions essentielles pour améliorer l'expérience utilisateur. Cela est directement lié à la définition de l'identité visuelle d'un site web, qui inclut la manière dont les éléments graphiques sont agencés pour guider efficacement l'utilisateur. L'explication fournie fait référence à des concepts pertinents comme la loi de Fitts, ce qui montre une bonne maîtrise des notions abordées dans la synthèse. Cependant, bien que pertinent, cet exercice pourrait être encore plus ciblé sur d'autres aspects spécifiques de l'identité visuelle tels que le contraste ou l'esthétique."}, {"exercise": {"id": "2e8282503d8d465cb75918606843cf30", "statement": "Un bouton d'appel à l'action trop grand peut nuire à la hiérarchie visuelle d'une mise en page.", "veracity": true, "feedback": "Un bouton trop grand peut effectivement perturber la composition visuelle et altérer la hiérarchie de la mise en page, ce qui rendrait l'interface utilisateur moins harmonieuse et ergonomique.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9cd2d745fc4b431ebae62fa486bb77bb", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Les boutons de bonne taille ont de fortes chances d'être remarqués et cliqués, mais vous devez néanmoins garder certaines limites. Un bouton d'appel à l'action convaincant est généralement assez gros pour être trouvé rapidement, mais pas trop gros pour ne pas gâcher la composition visuelle et la hiérarchie de la mise en page. Les leaders du marché fournissent souvent des recommandations sur la taille effective des boutons dans leurs directives. Par exemple, Apple indique que les CTA dans l'interface utilisateur mobile doivent faire au moins 44 X 44 pixels, tandis que Microsoft recommande 34 x 26 pixels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c7a24ce8f1c54c5790e6911b05e07611", "next_id": "a298f56efde24880ba9f032e9759b3a7", "prev_id": "0f287698198c422db9ef3c0c321dac5b", "associated_block_ids": [], "first_page": 251, "last_page": 251, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la hiérarchie visuelle dans le design d'un site web, ce qui est un aspect clé de l'identité visuelle. En affirmant que 'Un bouton d'appel à l'action trop grand peut nuire à la hiérarchie visuelle', il aborde directement les concepts de composition et d'ergonomie mentionnés dans la synthèse. L'explication fournie renforce cette idée en soulignant comment un élément graphique mal dimensionné peut affecter l'expérience utilisateur. Cependant, bien que pertinent, cet exercice pourrait être amélioré en incluant des éléments supplémentaires sur d'autres aspects de l'identité visuelle, comme le contraste ou la cohérence du design."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le design, ce qui est un aspect clé de l'identité visuelle d'un site web. La référence mentionne que la conception d'expérience utilisateur intègre divers éléments graphiques et visuels pour créer des interactions significatives. L'affirmation posée dans l'exercice est pertinente car elle souligne que le design doit prendre en compte l'expérience utilisateur pour être efficace, ce qui est en ligne avec les concepts abordés dans la synthèse. Cependant, bien que cela soit pertinent, l'exercice pourrait être amélioré en demandant une application plus concrète des principes discutés dans la synthèse, comme le contraste visuel ou la cohérence du design."}, {"exercise": {"id": "6959a0ee488345c7b82f166b7c72587f", "statement": "Les technologies comme les plages braille et les loupes d'écran peuvent faciliter la lecture des alternatives textuelles.", "veracity": true, "feedback": "Il est mentionné que les technologies d'assistance telles que les plages braille et les loupes d’écran permettent aux utilisateurs d’accéder aux alternatives textuelles. Ces outils aident notamment dans la restitution de texte destiné à ceux ayant des limitations visuelles.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité, un aspect clé de l'identité visuelle d'un site web. En se concentrant sur les technologies d'assistance et leur rôle dans la lecture des alternatives textuelles, il aborde directement le principe fondamental du contraste visuel et de l'ergonomie web mentionnés dans la synthèse. Cependant, bien que pertinent, l'exercice ne couvre pas tous les éléments graphiques ou esthétiques qui constituent une identité visuelle complète, ce qui empêche une note parfaite."}, {"exercise": {"id": "bc4a3de35f2e426aa928b95008ea9f99", "statement": "La zone d'en-tête et celle de navigation principale doivent respecter certaines conditions spécifiques lorsqu'elles sont présentes sur une page web.", "veracity": true, "feedback": "Lorsqu'elles sont présentes sur une page web, la zone d'en-tête, de navigation principale, et autres zones spécifiques comme le contenu principal, le pied de page et le moteur de recherche doivent respecter au moins une condition préétablie. Cela vise à garantir une bonne accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3567704ff8cd4aa5ab54ff79f986bc2b", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Note : l'appréciation d'un nombre très limité de pages devrait être réservée à un site dont l'ensemble des pages sont atteignables depuis la page d'accueil. . Test 12.6.1 : Dans chaque page web où elles sont presentes, la zone d'en-tête, de navigation principale, de contenu principal, de pied de page et de moteur de recherche respectent-elles au moins une de ces conditions :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d959c4185060456ead3c839626017e3e", "next_id": "071df3f2c64d4fa08b65e9b273680145", "prev_id": "8b07ae8f8182408598a96104daf72349", "associated_block_ids": [], "first_page": 73, "last_page": 75, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la zone d'en-tête et de navigation dans le cadre de l'identité visuelle d'un site web, ce qui est un aspect clé de la référence. Il aborde également des notions d'accessibilité, qui sont essentielles pour garantir une expérience utilisateur optimale. Cependant, il pourrait être amélioré en demandant à l'apprenant d'expliquer plus en détail comment ces zones contribuent à l'identité visuelle ou en incluant des éléments graphiques spécifiques mentionnés dans la synthèse. Cela aurait permis une évaluation plus complète des compétences liées à la conception graphique et visuelle."}, {"exercise": {"id": "458dffabe57e43d784bad2274d28e806", "statement": "L'utilisateur doit pouvoir accéder à toutes les fonctionnalités par la touche tabulation ou par un dispositif de pointage.", "veracity": true, "feedback": "Toutes les fonctionnalités doivent être accessibles soit via le clavier (notamment avec la touche de tabulation), soit via un dispositif de pointage, garantissant ainsi l'accessibilité pour différents types d'utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité, qui est un aspect clé de l'identité visuelle d'un site web. En effet, garantir que toutes les fonctionnalités soient accessibles par différents moyens (clavier et dispositif de pointage) est essentiel pour une bonne expérience utilisateur et fait partie des principes fondamentaux abordés dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des éléments plus directement liés à la conception graphique ou à l'esthétique visuelle, ce qui le rendrait encore plus pertinent par rapport à la définition complète de l'identité visuelle."}, {"exercise": {"id": "b3e57401533842d0be619dce4af41dfc", "statement": "La condition de test doit garantir que la restitution est pertinente pour l'accessibilité.", "veracity": true, "feedback": "Effectivement, la restitution doit être évaluée quant à sa pertinence pour une accessibilité correcte, assurant ainsi que l'élément ou le dispositif est compatible avec les standards d'accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9b14916b1e20433fa262778c483ce3bc", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'un critère, un test ou une condition de test demande de vérifier la restitution d'un dispositif, il faut s'assurer que ladite restitution est compatible avec l'accessibilité. Le test consiste à vérifier que la restitution est pertinente pour au moins une des combinaisons de l'environnement de test (ou « base de référence ») utilisé pour déclarer qu'un élément, un dispositif ou une alternative est « compatible avec l'accessibilité ».", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "4faf5a6950e14c579767497329d86e26", "next_id": "c622938cd0c84165938ebd9d27fa9884", "prev_id": "54b4fb1806a34b8a8da92c12bb791669", "associated_block_ids": [], "first_page": 97, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité dans la conception d'une identité visuelle pour un site web, ce qui est un aspect clé mentionné dans la référence. En effet, le texte souligne que l'accessibilité est cruciale pour garantir que tous les utilisateurs, y compris ceux ayant des déficiences visuelles, puissent naviguer efficacement. L'affirmation et son explication mettent en avant cette nécessité d'évaluer la pertinence des éléments graphiques en termes d'accessibilité. Cependant, l'exercice pourrait être amélioré en incluant des questions plus variées sur d'autres aspects de l'identité visuelle, comme le contraste ou l'esthétique, pour couvrir une gamme plus large de concepts abordés dans la synthèse."}, {"exercise": {"id": "e4712a6d8f1847a4b6e28eb2985324b9", "question": "Que faut-il évaluer pour la pertinence du « nom accessible » du bouton?", "answers": ["Le passage de texte référencé par aria - labelledby"], "distractors": ["Le titre du bouton uniquement.", "Uniquement la balise aria-Label.", "Le code source HTML du bouton.", "Les propriétés CSS associées au bouton.", "Le style et l'apparence visuelle du bouton.", "La position du bouton sur la page.", "Le texte alternatif défini pour le bouton.", "Les attributs HTML globaux liés au bouton.", "Le contenu textuel global de la page web."], "feedback": "Pour évaluer la pertinence du « nom accessible » du bouton, il faut prendre en compte le passage de texte référencé par aria-labelledby, qui doit primer sur le titre du bouton. Cela permet de garantir une étiquette pertinente pour les utilisateurs d'outils d'assistance tels que les lecteurs d'écran.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "109826c4006248009b08298ed8ecd2e1", "order": 21.0, "image_url": null, "origin_type": "document_content", "text": "Cet ordre doit être utilisé pour l'évaluation de la pertinence du « nom accessible » du bouton. Par exemple, même dans le cas de la présence d'un tit le et d'un passage de texte référencé par aria- Label ledby sur le même bouton, c'est le passage de texte référencé par aria - labelledby qui doit être évalué.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "017e9855f379424d84d4b749df0647f2", "next_id": "ebd60112bd9c4f00ab14e510a00dd39d", "prev_id": "40edac9b3d134871a56019ae05da60b3", "associated_block_ids": [], "first_page": 89, "last_page": 89, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité dans le design d'éléments graphiques, ce qui est un aspect clé de l'identité visuelle d'un site web. En se concentrant sur le 'nom accessible' du bouton et son lien avec les attributs ARIA, il aborde des concepts importants tels que la lisibilité et l'interaction utilisateur. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à la conception visuelle globale ou à l'esthétique pour obtenir une note parfaite."}, {"exercise": {"id": "c7980d9a056f450988c3b8452c9d224b", "question": "Que signifie un lien signalé uniquement par la couleur dans un contenu web ?", "answers": ["L'absence de tout autre marqueur visuel comme icône ou soulignement"], "distractors": ["Le lien est invisible pour les utilisateurs non voyants", "Il est accompagné d'une bordure et d'un fond coloré", "Les utilisateurs peuvent cliquer sur n'importe quel texte visible", "Il est accessible même sans technologie d'assistance", "Le lien est toujours signifié par une icône spécifique", "Un lien cliquable avec une animation particulière", "Le lien est forcément écrit en gras", "Les accès direct via clavier sans repérage visuel", "Ce type de lien est activé automatiquement"], "feedback": "Un lien signalé uniquement par la couleur est un lien qui n'est accompagné d'aucun autre marqueur visuel, comme une icône ou un soulignement. Cela signifie que le lien peut être difficilement repéré par les utilisateurs non voyants ou malvoyants, qui ne peuvent pas percevoir la couleur du lien. Il est donc important de fournir des alternatives visuelles ou des indicateurs supplémentaires pour ces liens afin qu'ils soient accessibles à tous.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e6cc7c6f6e384096b893b90c91f8560e", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Lorsqu'une image est légendée il est nécessaire d'associer la légende de l'image à l'image par une relation de structure, de telle sorte que les technologies d'assistance puissent traiter l'image et sa légende comme un ensemble unique. Lien qui peut être confondu avec un texte normal lorsqu'il est signalé uniquement par la couleur par certains types d'utilisateurs ne percevant pas ou mal les couleurs. Par exemple, dans ce texte Nouvelle grève à la SNCF, si le mot grève est un lien signalé uniquement par la couleur, sa nature peut être ignorée par les utilisateurs ne percevant pas la couleur et accédant au contenu CSS activé. Note : signalés uniquement par la couleur signifie que le lien n'est accompagné d'aucun marqueur visuel (icône, soulignement, bordure ... ). En conséquence un lien de la même couleur que le texte environnant est concerné par ce critère.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "3055b0d20b34406db8ea7d53e0d1f9c2", "next_id": "9cac9af675a84c84970135dd9b6515b9", "prev_id": "9e345ef07b134e5c9a72ed5a59c0fad3", "associated_block_ids": [], "first_page": 108, "last_page": 109, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'accessibilité des éléments graphiques dans le contexte de l'identité visuelle d'un site web. La question porte sur un aspect crucial du design web, à savoir la signalisation des liens, qui est directement liée à la lisibilité et à l'interaction utilisateur. La réponse correcte souligne l'importance d'utiliser des marqueurs visuels supplémentaires pour garantir que tous les utilisateurs, y compris ceux ayant des déficiences visuelles, puissent naviguer efficacement. Cependant, bien que pertinent, cet exercice pourrait être amélioré en incluant davantage d'éléments liés à d'autres aspects de l'identité visuelle comme le contraste ou la cohérence dans le design."}, {"exercise": {"id": "a0399285e12e4abf9de005904e41f218", "query": "L'intitulé d'un bouton doit décrire <blank> qui résulte de son activation.", "answers": ["l'action"], "distractors": [["le style", "la couleur", "le format", "la taille", "la position", "le texte"]], "feedback": "Le libellé d'un bouton a pour objectif de rendre claire l'action qu'il va déclencher lorsqu'on l'active. Il est important que cette action soit décrite précisément pour l'utilisateur. Les autres options comme le style, la couleur ou la taille ne concernent que des aspects visuels secondaires.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a811102d42cd48418338b288bfeabe4d", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Élément d'un formulaire qui permet d'effectuer une action prédéfinie. Par exemple, le bouton de soumission d'un formulaire permet l'envoi au serveur des informations collectées pour leur traitement. L'intitulé d'un bouton doit décrire l'action qui résulte de son activation (par exemple : « Lancer votre recherche », « Envoyer votre message »). Note importante : lorsque plusieurs de ces techniques sont présentes sur un même bouton, le calcul du « nom accessible », c'est-à-dire ce qui sera restitué, obéit à un ordre strict :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "017e9855f379424d84d4b749df0647f2", "next_id": "2e2afb07ed4f444394fa5e1af308eb26", "prev_id": "f235789cd9444fabbd716560359c5990", "associated_block_ids": [], "first_page": 89, "last_page": 89, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice teste la compréhension d'un aspect clé de l'identité visuelle d'un site web, à savoir l'importance du libellé d'un bouton pour décrire l'action qu'il déclenche. Cela est en lien avec les éléments graphiques et leur rôle dans la communication visuelle et l'interaction utilisateur. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, tels que le contraste visuel ou l'organisation de page. Il se concentre principalement sur un élément spécifique (le texte du bouton) sans aborder d'autres concepts importants liés à l'identité visuelle globale."}, {"exercise": {"id": "7fd94d1cfb6a4172bd075fce05d98d4b", "statement": "Un lien d'évitement permet de sauter une zone dans la page pour faciliter la navigation.", "veracity": true, "feedback": "Les liens d'évitement sont en effet destinés à permettre aux utilisateurs de sauter certaines zones d'une page, ce qui améliore l'expérience de navigation, notamment pour ceux qui utilisent des lecteurs d'écran ou la navigation au clavier.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un concept clé lié à l'identité visuelle d'un site web, en particulier l'accessibilité et la navigation. La question sur les liens d'évitement est pertinente car elle touche à l'ergonomie web et à la manière dont les éléments graphiques et de navigation peuvent améliorer l'expérience utilisateur. Cependant, bien que cela soit un aspect important, l'exercice ne couvre pas directement tous les éléments de l'identité visuelle mentionnés dans la référence, comme le contraste visuel ou la cohérence du design. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "fdbca6cebbd548cb95a8c345ddf38185", "statement": "L'intitulé d'un bouton doit clairement décrire l'action qui sera effectuée après activation.", "veracity": true, "feedback": "L'intitulé du bouton doit effectivement refléter précisément l'action qui sera exécutée lorsque l'utilisateur interagit avec celui-ci. Cela permet une meilleure compréhension et accessibilité pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a811102d42cd48418338b288bfeabe4d", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Élément d'un formulaire qui permet d'effectuer une action prédéfinie. Par exemple, le bouton de soumission d'un formulaire permet l'envoi au serveur des informations collectées pour leur traitement. L'intitulé d'un bouton doit décrire l'action qui résulte de son activation (par exemple : « Lancer votre recherche », « Envoyer votre message »). Note importante : lorsque plusieurs de ces techniques sont présentes sur un même bouton, le calcul du « nom accessible », c'est-à-dire ce qui sera restitué, obéit à un ordre strict :", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "017e9855f379424d84d4b749df0647f2", "next_id": "2e2afb07ed4f444394fa5e1af308eb26", "prev_id": "f235789cd9444fabbd716560359c5990", "associated_block_ids": [], "first_page": 89, "last_page": 89, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'identité visuelle d'un site web, à savoir l'importance de la clarté et de la pertinence des éléments graphiques, comme les boutons. En demandant à l'apprenant de juger la véracité d'une affirmation sur l'intitulé d'un bouton, il teste sa capacité à reconnaître comment un bon design contribue à une expérience utilisateur optimale. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, tels que le contraste visuel ou l'organisation de page. C'est pourquoi il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "e846ef0159d94e02a46b826e22c81e6b", "question": "Pour améliorer la compréhension d'une interface, que faut-il respecter principalement ?", "answers": ["La hiérarchie visuelle et l'ordre de lecture de l'utilisateur"], "distractors": ["Les polices de caractères artistiques et les animations interactives.", "Les couleurs de fond claires avec des éléments graphiques complexes.", "L'intégration de plusieurs menus déroulants imbriqués.", "L'affichage direct de plusieurs options techniques avancées.", "La quantité maximale d'informations sur une seule ligne.", "L'utilisation d'icônes réduites pour chaque section.", "Le positionnement aléatoire des boutons d'action.", "L'ajout de contenu vidéo en arrière-plan.", "La mise en place d'un menu global en bas de page."], "feedback": "Pour améliorer la compréhension d'une interface, il est important de respecter la hiérarchie entre les éléments visuels et de suivre l'ordre de lecture de l'utilisateur. Cela permet une meilleure compréhension de l'action à effectuer et facilite ainsi son utilisation.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de la hiérarchie visuelle et de l'ordre de lecture dans une interface, qui sont des éléments clés pour définir l'identité visuelle d'un site web. Ces concepts sont directement liés à la manière dont les éléments graphiques doivent être organisés pour optimiser l'expérience utilisateur, comme mentionné dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des aspects supplémentaires tels que le contraste visuel ou la simplicité du design, qui sont également cruciaux pour une identité visuelle efficace."}, {"exercise": {"id": "4570d883513647c595941a5d33546fc8", "question": "Pourquoi est-il risqué de réinventer une icône connue par les utilisateurs ?", "answers": ["Cela peut désorienter l'utilisateur et nuire à son expérience"], "distractors": ["Cela permet d'améliorer l'expérience utilisateur immédiatement.", "Cela rend l'interface plus créative et intuitive.", "Cela aide l'utilisateur à mieux comprendre les nouvelles fonctionnalités.", "Cela garantit une meilleure interaction avec la technologie.", "Cela simplifie l'utilisation des options avancées pour les experts.", "Cela permet de se différencier de la concurrence.", "Cela assure une compatibilité optimale avec toutes les interfaces existantes.", "Cela accroît la flexibilité de conception dans les interfaces complexes.", "Cela améliore la lisibilité générale des informations présentées à l'écran."], "feedback": "Les icônes familières sont facilement reconnaissables par les utilisateurs et leur permettent de comprendre rapidement comment utiliser une fonctionnalité sans avoir à apprendre de nouvelles représentations visuelles. Modifier une icône peut donc désorienter l'utilisateur et nuire à son expérience.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance des éléments graphiques, en particulier des icônes, dans l'identité visuelle d'un site web. La question posée aborde directement les risques associés à la réinvention d'icônes connues, ce qui est pertinent pour le concept de lisibilité et d'expérience utilisateur évoqué dans la synthèse. La réponse correcte souligne que cela peut désorienter l'utilisateur, ce qui est en accord avec les principes de conception UX mentionnés. Cependant, l'exercice pourrait être amélioré en incluant des aspects supplémentaires tels que le contraste visuel ou la cohérence dans le design pour une évaluation encore plus complète."}, {"exercise": {"id": "2f9b8c77092542f7b1b9ff425a63a1c1", "statement": "La hiérarchie entre les éléments d'une interface aide à mieux comprendre les actions à réaliser.", "veracity": true, "feedback": "Il est exact que la hiérarchie entre les différents éléments permet une meilleure compréhension des actions à entreprendre. Cette organisation guide l'utilisateur dans son parcours, rendant l'expérience plus fluide et intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de la hiérarchie des éléments d'une interface, qui est un aspect clé de l'identité visuelle d'un site web. La référence souligne l'importance de l'organisation de page pour optimiser la navigation et guider efficacement l'utilisateur. L'affirmation et son explication mettent en avant comment cette hiérarchie contribue à une expérience utilisateur intuitive, ce qui est en ligne avec les concepts abordés dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en intégrant des éléments plus variés liés à d'autres aspects de l'identité visuelle, comme le contraste ou la cohérence du design."}, {"exercise": {"id": "5c99b0872ad447488fc21208ec035890", "statement": "La constance dans l'utilisation d'icônes universelles permet d'améliorer l'intuitivité d'une interface.", "veracity": true, "feedback": "L'emploi d'icônes avec une signification établie, connue des utilisateurs, permet de maintenir une interface intuitive. Cela évite de réinventer sans raison des éléments qui ont déjà fait leurs preuves dans la compréhension utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'identité visuelle, à savoir l'importance de la cohérence et de l'intuitivité dans le design d'interface. L'affirmation sur les icônes universelles est pertinente car elle touche à la manière dont les éléments graphiques contribuent à une expérience utilisateur fluide, un concept central dans la définition de l'identité visuelle d'un site web. Cependant, bien que cela soit en lien avec le sujet, l'exercice pourrait être amélioré en intégrant des questions plus variées qui couvrent également d'autres aspects mentionnés dans la synthèse, comme le contraste visuel ou l'organisation de page."}, {"exercise": {"id": "f7db6816b25d40e7b88284be2d31d0ac", "statement": "Les utilisateurs préfèrent des icônes nouvelles et originales plutôt que celles établies pour mieux comprendre leur fonction.", "veracity": false, "feedback": "Au contraire, il est mentionné que les icônes ayant une signification établie sont déjà connues des utilisateurs et qu'il est risqué d'en créer de nouvelles. Le changement pourrait rendre l'interface moins intuitive et désorienter les utilisateurs, ce qui est à éviter pour ne pas les faire fuir.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension d'un aspect clé de l'identité visuelle, en particulier l'importance des icônes établies pour garantir une interface intuitive. La réponse correcte souligne que les utilisateurs bénéficient de la familiarité avec des icônes connues, ce qui est en accord avec le principe de simplicité et d'ergonomie mentionné dans la synthèse. Cependant, l'exercice pourrait être amélioré en incluant des questions supplémentaires sur d'autres éléments graphiques ou principes de design abordés dans la référence, afin de couvrir plus largement le sujet de l'identité visuelle."}, {"exercise": {"id": "74d6ad304c8c4756803e679f5c81c5ba", "question": "À quoi sert principalement un design system dans une organisation ?", "answers": ["Standardiser tous les éléments graphiques, visuels et de branding"], "distractors": ["Créer du contenu marketing pour les réseaux sociaux", "Superviser le développement global d'une entreprise", "Implémenter un plan de communication interne", "Fournir des solutions de service client automatisées", "Améliorer les performances d'algorithmes de machine learning", "Concevoir des logiciels de gestion d'équipe", "Gérer les relations publiques de la marque", "Réunir les ressources pour la stratégie de vente", "Optimiser les coûts de production des produits"], "feedback": "Un design system est un procédé qui vise à réunir, standardiser et centraliser tous les éléments visuels et graphiques d'un produit. Cela permet de garantir une cohérence et une homogénéité dans la communication et l'expérience utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e61cd49c02d24761bc4a13ec93b48662", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le design system est une bibliothèque de composants appliquée sur plusieurs produits Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cdc14647c35d46049b406c6b6e593b42", "next_id": "8452362bdf3c437297781481ba81665d", "prev_id": "cdc14647c35d46049b406c6b6e593b42", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13700, "doc_label": "Sequence 8_Appliquer un UIKIT sur un wireframe", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension du concept de design system, qui est pertinent pour définir l'identité visuelle d'un site web. En effet, un design system contribue à standardiser les éléments graphiques et visuels, ce qui est essentiel pour créer une identité cohérente. Cependant, l'exercice ne couvre pas directement tous les aspects mentionnés dans la référence, tels que le contraste visuel, l'ergonomie ou l'esthétique. Il aurait pu être amélioré en intégrant des questions sur ces autres concepts clés liés à l'identité visuelle."}, {"exercise": {"id": "0dbdd87a7b9c4075b3ef23380297eec5", "query": "Les sites web adoptant un design minimaliste utilisent souvent <blank> pour créer un effet visuel apaisant et épuré.", "answers": ["des couleurs atténuées"], "distractors": [["des couleurs flashy", "des textures granulaires", "de multiples polices de caractères", "des animations complexes", "des formes géométriques audacieuses", "des images vives et contrastées"]], "feedback": "La bonne réponse est 'des couleurs atténuées', car les sites minimalistes mettent l'accent sur la simplicité, souvent en réduisant l'intensité des couleurs pour renforcer l'effet visuel calme et épuré. Les autres options, comme 'des couleurs flashy' ou 'des images vives et contrastées', contreviennent à cet objectif en ajoutant trop de détails et de dynamisme.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "390d8b2afca74e18a652ff875e8e6139", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Nous verrons de plus en plus de sites qui explorent la simplicité à travers la réduction des détails, demandant d'atteindre l'anonymat. Ces sites Web agissent parfois comme une structure ou une structure filaire conçue, utilisant une typographie minimaliste, une gamme limitée de styles de caractères sur le site, des couleurs atténuées qui s'alignent avec de grandes images ou avec des illustrations amorphes qui remplacent les illustrations UX détaillées. De plus, parfois, un doux défilement d'animation enveloppe le site Web et vous fait flotter dans la sérénité.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "65b060b1c7a14befab12815148c02db7", "next_id": "ac8bce3c284b459190968bb6e4669def", "prev_id": "65b060b1c7a14befab12815148c02db7", "associated_block_ids": [], "first_page": 367, "last_page": 367, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un aspect clé de l'identité visuelle, à savoir l'utilisation des couleurs dans le design minimaliste. Cela est pertinent car la synthèse mentionne que la simplicité dans le design favorise une expérience utilisateur optimale et que le contraste visuel est fondamental pour la lisibilité. Cependant, l'exercice pourrait être amélioré en intégrant des éléments plus directement liés à d'autres concepts abordés dans la référence, comme l'ergonomie ou l'organisation de page, afin de couvrir un éventail plus large des compétences nécessaires pour définir une identité visuelle complète."}, {"exercise": {"id": "9a099c489b864346b9811c59dacad8ce", "question": "Comment améliorer la navigation en renseignant la position de l'utilisateur ?", "answers": ["Utiliser un fil d'Ariane pour indiquer la localisation de l'internaute"], "distractors": ["Créer des raccourcis clavier personnalisés pour chaque page", "Ajouter un message popup à chaque étape", "Utiliser uniquement des icônes pour naviguer", "Insérer un message texte fixe sur chaque page", "Limiter la navigation à un seul niveau de profondeur", "Ajouter des numéros de page en haut de chaque section", "Utiliser une animation de défilement pour chaque changement de page", "Modifier la couleur du fond selon la section", "Intégrer des éléments visuels encombrants pour attirer l'attention"], "feedback": "Utiliser un fil d'Ariane pour indiquer la localisation de l'internaute permet à l'utilisateur de savoir où il se trouve dans la navigation et de revenir facilement en arrière s'il le souhaite. Cela facilite également la compréhension de la structure du site pour l'utilisateur.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension d'un aspect important de l'identité visuelle d'un site web, à savoir l'amélioration de la navigation. La question sur l'utilisation d'un fil d'Ariane pour indiquer la position de l'utilisateur est pertinente car elle touche à l'organisation de la page et à l'ergonomie web, qui sont des éléments clés mentionnés dans la synthèse. Cependant, bien que cela soit un bon exemple d'amélioration de la navigation, l'exercice ne couvre pas directement tous les aspects liés à l'identité visuelle tels que le contraste visuel ou la cohérence du design. Par conséquent, il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "a445f4b4019a4cff837aa3d8e9bba2c5", "statement": "Il n'est pas nécessaire de prendre en compte la personnalité du service lors de la création de CTA.", "veracity": false, "feedback": "Il est explicitement mentionné qu'il faut tenir compte de la personnalité que l'on souhaite transmettre via le produit ou service lorsqu'on décide du format de CTA à utiliser.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "adfd1b1bb75348adb19ed130d411fcb0", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut tout d'abord savoir qu'il existe différents types de CTA et qu'en fonction de l'importance que l'on souhaite donner à l'action, il faut choisir entre ces trois gabarits : Bien sûr il faut prendre en compte le type de service / produit et la personnalité qu'on souhaite transmettre mais c'est une donnée intéressante à garder en tête !", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "55f684c91106495595873b5ac0d2fdb1", "next_id": "f6522177a2774dce8b042a498e560196", "prev_id": "55f684c91106495595873b5ac0d2fdb1", "associated_block_ids": [], "first_page": 252, "last_page": 259, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension de l'importance de l'identité visuelle, en particulier en ce qui concerne les appels à l'action (CTA) et leur alignement avec la personnalité du service. Bien que cela soit pertinent pour le concept d'identité visuelle, l'exercice pourrait être amélioré en se concentrant davantage sur d'autres éléments graphiques mentionnés dans la synthèse, tels que le contraste visuel ou l'organisation de page. Néanmoins, il évalue correctement un aspect clé lié à la conception graphique et à l'expérience utilisateur."}, {"exercise": {"id": "2b71f18669974c0aaeff9e376d51e756", "query": "Un lien d'évitement permet <blank> dans la page afin d'améliorer l'accessibilité pour les utilisateurs.", "answers": ["de sauter une zone"], "distractors": [["d'ouvrir un nouveau site", "de charger une nouvelle section", "de fermer une fenêtre", "de lancer une aide technique", "d'activer un formulaire", "de générer un contenu"]], "feedback": "Un lien d'évitement permet aux utilisateurs, notamment ceux naviguant avec un clavier ou utilisant des aides techniques, de sauter une zone spécifique de la page afin de ne pas avoir à parcourir tout le contenu séquentiellement. Cela contribue à améliorer l'accessibilité en permettant une navigation plus fluide.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4857b7c6264a42c3b08d1796020a0daf", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Liens dont la fonction est de permettre de naviguer à l'intérieur de la page (lien d'évitement, lien d'accès au formulaire de recherche ou au menu ... ). Ces liens peuvent soit permettre d'accéder à une zone de la page (lien d'accès rapide) ou de sauter une zone dans la page (lien d'évitement). Note 1 : Un lien d'évitement ou d'accès rapide fonctionnel est un lien dont l'activation permet de reprendre la lecture et la navigation clavier à partir de la cible du lien lors de l'utilisation des navigateurs et des aides techniques retenus dans l'environnement de test (ou « base de référence ») de l'audit.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "95b3e505b7f04f71a60c1bfff05b7e23", "next_id": "8fa07c5874db44939984d229234d813c", "prev_id": "95b3e505b7f04f71a60c1bfff05b7e23", "associated_block_ids": [], "first_page": 110, "last_page": 110, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice teste la compréhension d'un concept clé lié à l'accessibilité, qui est un aspect important de l'identité visuelle d'un site web. En effet, la capacité à naviguer efficacement sur un site est essentielle pour une bonne expérience utilisateur, ce qui fait partie intégrante de l'identité visuelle. Cependant, bien que pertinent, cet exercice ne couvre pas directement tous les éléments graphiques et visuels mentionnés dans la référence, tels que le design esthétique ou l'organisation de page. Il se concentre principalement sur un aspect spécifique de l'accessibilité sans aborder les autres dimensions de l'identité visuelle."}, {"exercise": {"id": "b661842bdd6d475db6f0661594078159", "statement": "Les étiquettes de champs de formulaire réclamant une même information doivent être uniformes pour éviter toute confusion chez l'utilisateur.", "veracity": true, "feedback": "Il est important que les libellés des champs de formulaire soient formulés de manière cohérente et sans ambiguïté pour que l'utilisateur comprenne qu'il est invité à fournir la même information.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "fb008f0151564ff5993187df2692da2a", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les étiquettes de champs de formulaire présentes dans une même page ou dans un ensemble de pages et réclamant la saisie d'une même information doivent être formulées sans ambiguïté pour que l'utilisateur sache que l'information qu'il doit communiquer est la même. Le langage CSS destiné à la mise en forme des éléments du contenu (exemples : couleur du fond de la page, taille/police/couleur des caractères, positionnement de l'information dans la page web ... ). Les styles CSS peuvent être externes (fichier CSS), embarqués (déclarés dans l'en-tête de la page) ou en ligne (déclarés via l'attribut style d'une balise).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "d45eb7df2c3b436daf6bd8c0432f70f7", "next_id": "d0f408607e244872923937a422d113ab", "prev_id": "d45eb7df2c3b436daf6bd8c0432f70f7", "associated_block_ids": [], "first_page": 100, "last_page": 100, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de la cohérence dans les éléments graphiques, ce qui est un aspect clé de l'identité visuelle d'un site web. La question sur l'uniformité des étiquettes de champs de formulaire touche à la clarté et à la lisibilité, qui sont essentielles pour une bonne expérience utilisateur. Cependant, bien que pertinent, cet exercice ne couvre pas tous les aspects mentionnés dans la référence, comme le contraste visuel ou l'esthétique globale. Il aurait pu être amélioré en intégrant des éléments supplémentaires liés à d'autres concepts clés tels que l'organisation de page ou l'accessibilité."}, {"exercise": {"id": "66ce7b152de44607970d26f764001f4b", "statement": "Améliorer l'accessibilité d'un site web permet d'augmenter son trafic et ses conversions.", "veracity": true, "feedback": "Cette affirmation est correcte. Il est explicitement mentionné que l'amélioration de l'accessibilité web permet de toucher un public plus large, ce qui a pour conséquence potentielle d'augmenter le trafic ainsi que les conversions sur le site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'importance de l'accessibilité dans le contexte de l'identité visuelle d'un site web, ce qui est un aspect clé mentionné dans la référence. L'affirmation souligne que l'amélioration de l'accessibilité peut augmenter le trafic et les conversions, ce qui est pertinent pour une bonne conception UX. Cependant, bien que cela touche à un élément important, l'exercice ne couvre pas directement d'autres aspects cruciaux tels que la cohérence du design, le contraste visuel ou l'organisation de page. Par conséquent, il obtient une note élevée mais pas maximale."}, {"exercise": {"id": "5e73416fc7b4418c8ecc13488cacf5bb", "question": "Quelles valeurs doivent être retransmises par les choix iconographiques faits par une marque?", "answers": ["Les valeurs propres de la marque doivent être retransmises"], "distractors": ["Les goûts personnels du créateur doivent prédominer", "Les tendances passagères du marché sont prioritaires", "Les attentes aléatoires de tout public cible doivent être reflétées", "Les idées fixes de l'équipe marketing doivent guider", "Les préférences des actionnaires sont déterminantes", "Les opinions des influenceurs sont à suivre aveuglément", "Les standards esthétiques internationaux priment toujours", "Les concepts abstraits sans lien avec la marque doivent être inclus", "Les avis des fournisseurs doivent orienter les choix"], "feedback": "Les choix iconographiques d'une marque doivent être fidèles et pertinents pour transmettre ses valeurs propres et les personnifier, afin que les consommateurs puissent se reconnaître dans la marque et s'identifier à ses valeurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "4454bf17c36b4b499a8513bff7825af6", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Le potentiel narratif des images est puissant, il permet à la marque d'instaurer un lien de confiance, de jouer la transparence, de se raconter, et de se montrer. Il faut donc, en amont, s'approprier les valeurs propres à chaque marque afin de les retransmettre et de les personnifier au travers de choix iconographiques fidèles et pertinents.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "27266f7e7f2b4867bc38a6608f4c2ae0", "next_id": "9a7b46fdedf44331ab9b51b4c73b1310", "prev_id": "27266f7e7f2b4867bc38a6608f4c2ae0", "associated_block_ids": [], "first_page": 6, "last_page": 6, "start_time": null, "end_time": null, "doc_id": 13673, "doc_label": "Connect jour 3", "corpus_id": 639, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question des choix iconographiques d'une marque, ce qui est pertinent pour définir l'identité visuelle d'un site web. Cependant, il se concentre principalement sur les valeurs de la marque plutôt que sur les éléments graphiques spécifiques (comme les images, boutons, icônes et typographie) qui constituent l'identité visuelle dans le contexte du design web. Bien que cela soit lié à l'identité visuelle, l'exercice ne couvre pas directement des concepts clés tels que le contraste visuel, l'ergonomie ou la structure de page mentionnés dans la synthèse. Par conséquent, bien qu'il soit pertinent, il ne teste pas entièrement tous les aspects essentiels de la référence."}, {"exercise": {"id": "daff570ba9ce48f8817243015706c164", "query": "Pour une navigation optimale, il est conseillé de prioriser la largeur plutôt que <blank> dans l'architecture d'un menu.", "answers": ["la profondeur"], "distractors": [["l'hauteur", "la simplicité", "la vitesse", "l'élégance", "la cohérence", "la longueur"]], "feedback": "Prioriser la largeur signifie qu'il est préférable d'avoir plus de choix disponibles dès le premier niveau de navigation (largeur) plutôt que plusieurs sous-niveaux de menus qui augmenteraient la complexité et rendraient la navigation plus difficile (profondeur).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un principe de navigation dans le design web, ce qui est pertinent pour définir l'identité visuelle d'un site. Cependant, il se concentre principalement sur l'architecture du menu plutôt que sur les éléments graphiques et visuels mentionnés dans la référence. Bien qu'il aborde un aspect important de l'expérience utilisateur (UX), il ne couvre pas directement des concepts clés comme le contraste visuel, la simplicité du design ou l'esthétique, qui sont essentiels à une identité visuelle forte. Par conséquent, bien que pertinent, cet exercice n'évalue pas pleinement tous les aspects couverts par la référence."}, {"exercise": {"id": "d54493bfc49e475391dfb249fb95159f", "statement": "Il est recommandé d'organiser les menus en profondeur plutôt qu'en largeur.", "veracity": false, "feedback": "La recommandation est de privilégier une architecture de menu large plutôt que profonde. Une organisation trop profonde allonge les parcours de navigation, tandis qu'une structuration large permet d'accéder plus rapidement aux informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "84da291efd5147758e77935e7a7a85c8", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Importance de l'architecture de menu (Préférer la largeur à profondeur) Classement par ordre de popularité Indiquer la localisation de l'internaute (fil d'Ariane) Travailler le libellé des boutons Eviter les menus uniquement composé d'une icone", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9b90153f385f46b99f56b739153fd59a", "next_id": "4763df2e36b54a14990adf64c3adb9eb", "prev_id": "1e563d3e3e6c4df0a1b9e5537cf8ee62", "associated_block_ids": [], "first_page": 22, "last_page": 22, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect de l'organisation de la page, qui est essentiel pour définir l'identité visuelle d'un site web. Il teste la compréhension des principes de navigation et d'ergonomie, ce qui est pertinent par rapport à la référence. Cependant, il ne couvre pas directement d'autres éléments clés tels que les éléments graphiques, le contraste visuel ou l'esthétique. Bien qu'il soit utile pour évaluer une partie de la conception UX, il manque une connexion plus forte avec les autres concepts mentionnés dans la synthèse."}, {"exercise": {"id": "8575c3f03e7d4498b1eba5d752c95f42", "statement": "Les éléments ergonomiques doivent être sélectionnés en fonction de l'étude des usagers.", "veracity": true, "feedback": "La bonne appropriation des éléments ergonomiques repose sur une étude fine des utilisateurs. Il est donc essentiel de se baser sur leurs besoins et attentes pour effectuer des choix pertinents.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "aceb0a20163c47699f60933224aeb73e", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Quel que soit le référentiel Ergonomique, ce qui prime est l'étude de vos usagers et de savoir sélectionner les éléments pertinents. · Un utilisateur ne devrait pas avoir à attendre plus de 2 secondes certaines réponses du système, comme le passage d'une application à une autre, ou le lancement d'un programme. Le choix des 2 secondes est arbitraire, mais il s'agit d'un ordre de grandeur raisonnable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2886c95bc4594768b50f6ada6f77070b", "next_id": "c60603f54a52414584a9d96a1affa5d6", "prev_id": "cc7aaae79f7c405599a54aa1f63f4532", "associated_block_ids": [], "first_page": 9, "last_page": 10, "start_time": null, "end_time": null, "doc_id": 13704, "doc_label": "QUALITE-WEB-_C3", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la notion d'ergonomie, qui est un aspect important de l'identité visuelle d'un site web. Il souligne l'importance de comprendre les utilisateurs pour sélectionner des éléments ergonomiques, ce qui est en lien avec la conception d'expérience utilisateur (UX) mentionnée dans la synthèse. Cependant, l'exercice ne couvre pas directement d'autres éléments clés tels que les aspects graphiques, le contraste visuel ou l'esthétique, ce qui limite sa portée par rapport à la définition complète de l'identité visuelle. Ainsi, bien qu'il soit pertinent, il n'évalue pas tous les concepts essentiels liés à la référence."}, {"exercise": {"id": "2e4690c8ed0e457c984b12c5a4c9dc8a", "question": "Que désignent les micro-espaces blancs dans une conception graphique ?", "answers": ["Les petits espaces/tampons créés autour du contenu pour plus d'aération"], "distractors": ["Les grandes zones vides placées intentionnellement pour guider le lecteur", "Les couleurs claires utilisées pour alléger visuellement une page", "Les lignes invisibles délimitant les paragraphes dans un texte structuré", "Les éléments graphiques utilisés pour attirer l'attention sur le contenu", "Les zones d'ombre ajoutées pour créer un effet de relief", "Les marges de sécurité pour éviter les débordements de texte", "Les espaces réservés pour insérer des images ou des vidéos", "Les interlignes ajustables selon la police choisie pour le texte", "Les bordures entourant chaque section afin de garantir la lisibilité"], "feedback": "Les micro-espaces blancs sont créés autour du contenu pour aérer visuellement la mise en page et éviter un aspect trop chargé. Ils peuvent également être ajustés pour des raisons esthétiques, mais ils sont toujours présents même s'ils ne sont pas voulus.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur les micro-espaces blancs dans une conception graphique, ce qui est un aspect pertinent de l'identité visuelle d'un site web. Bien que cela ne couvre pas tous les éléments clés mentionnés dans la référence, comme le contraste visuel ou l'organisation de page, il aborde un principe important lié à l'esthétique et à la lisibilité. Cependant, l'exercice pourrait être amélioré en intégrant des questions plus directement liées aux concepts fondamentaux de l'identité visuelle tels que la typographie ou le rôle des éléments graphiques dans la navigation. Ainsi, bien qu'il soit pertinent, il ne teste pas entièrement la compréhension des concepts clés de la référence."}, {"exercise": {"id": "f4b28520ee1f4e42b907e9f23a587b75", "query": "Les espaces blancs passifs sont des lacunes qui apparaissent naturellement dans la conception ou la typographie, tandis que les espaces blancs actifs sont ajoutés intentionnellement pour <blank>.", "answers": ["faciliter la lecture"], "distractors": [["améliorer le contraste", "réduire la fatigue oculaire", "remplir les zones vides", "augmenter l'espace visuel", "contrôler l'esthétique", "optimiser la typographie"]], "feedback": "La bonne réponse est 'faciliter la lecture' car les espaces blancs actifs ont pour but explicite de diriger l'attention d'un utilisateur en rendant la page plus facile à parcourir. Ils ne sont pas accidentels mais créés pour améliorer la lisibilité et le flux visuel.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b6e67a0297ea47c9a02c8adf3ca17f23", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Les micro-espaces blancs font référence aux espaces et tampons plus petits construits autour du contenu. Par exemple, un micro espace blanc peut être trouvé entre : Les espaces blancs passifs font référence aux lacunes qui se produisent naturellement dans la conception ou la typographie. Vous pouvez contrôler la taille de ces espaces en matière d'esthétique, mais ils seront là avec ou sans que vous les y placiez. L'espace blanc actif fait référence aux zones vides ajoutées intentionnellement à une page pour faciliter la lecture. L'objectif est de guider les yeux d'un visiteur vers le bas de la page ou à travers un processus jusqu'à ce qu'ils atteignent la conclusion inévitable et se convertissent.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "aaa49e0914d44246a1b9b1d8bf043c85", "next_id": "1f54fda54ddb467c936e65549979fa88", "prev_id": "93ea01615a43487eabd0c5ee30041b4e", "associated_block_ids": [], "first_page": 276, "last_page": 278, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé teste la compréhension des espaces blancs dans le design, ce qui est un aspect pertinent de l'identité visuelle d'un site web. Cependant, il se concentre spécifiquement sur les espaces blancs et leur fonction, sans aborder d'autres éléments clés mentionnés dans la référence, tels que le contraste visuel, l'ergonomie ou la cohérence du design. Bien qu'il soit utile pour évaluer une partie de la conception graphique, il ne couvre pas suffisamment l'ensemble des concepts liés à l'identité visuelle d'un site web pour obtenir une note plus élevée."}, {"exercise": {"id": "f1f4e80cb280417598d14efa8b949f6e", "question": "Quelle est la longueur maximale recommandée pour une alternative textuelle accessible ?", "answers": ["80 caractères au maximum sont fortement recommandés"], "distractors": ["100 caractères au maximum sont fortement recommandés", "120 caractères au maximum sont fortement recommandés", "40 caractères au maximum sont fortement recommandés", "70 caractères au maximum sont fortement recommandés", "90 caractères au maximum sont fortement recommandés", "50 caractères au maximum sont fortement recommandés", "130 caractères au maximum sont fortement recommandés", "110 caractères au maximum sont fortement recommandés", "60 caractères au maximum sont fortement recommandés"], "feedback": "Une longueur maximale de 80 caractères est fortement recommandée pour que les utilisateurs de plages braille ou de loupes d'écran puissent lire l'alternative sans avoir à effectuer plusieurs manipulations. Cela garantit une meilleure accessibilité pour ces utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f0619e97b2694ff39a755d31cd6aae5c", "order": 10.0, "image_url": null, "origin_type": "document_content", "text": "Les conditions de restitution d'une alternative textuelle via des technologies d'assistance (par exemple une loupe d'écran) nécessitent qu'elle soit la plus courte possible. Une longueur maximale de 80 caractères est fortement recommandée ; elle limitera le nombre de manipulations nécessaires pour lire l'alternative par les utilisateurs de plages braille ou de loupes d'écran notamment.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "7a66805119904f018f568f53915fb064", "next_id": "e3f6cb303ab74d15bbbaffa97f7186fd", "prev_id": "7a66805119904f018f568f53915fb064", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur l'accessibilité des contenus visuels, ce qui est un aspect important de l'identité visuelle d'un site web. Bien que la question ne couvre pas directement tous les éléments graphiques mentionnés dans la référence, elle aborde un concept clé lié à l'expérience utilisateur et à la lisibilité, qui sont essentiels pour définir une identité visuelle efficace. Cependant, l'exercice pourrait être amélioré en incluant des questions plus variées sur d'autres aspects de l'identité visuelle, comme le contraste ou la typographie."}, {"exercise": {"id": "61f1c0b8a36c429c8447c37deec46a19", "question": "Comment doit être organisée la relation entre une étiquette et son champ associé ?", "answers": ["Ils doivent être visuellement proches pour éviter toute confusion"], "distractors": ["Ils doivent apparaître sur des lignes différentes séparées", "Ils doivent avoir des couleurs fortement contrastées", "Ils doivent être dans des blocs distincts", "Ils doivent être placés dans le pied de page", "Ils doivent être interactifs et cliquables", "Ils doivent avoir un lien réciproque avec le champ", "Ils doivent être centrés sur la page", "Ils doivent inclure un numéro identifiant commun", "Ils doivent s'afficher uniquement au survol du curseur"], "feedback": "En plaçant visuellement l'étiquette et son champ associé proches l'un de l'autre, il est plus facile pour les utilisateurs de comprendre quelle étiquette correspond à quel champ et évite ainsi toute confusion.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension de l'organisation visuelle des éléments d'un site web, ce qui est pertinent pour définir l'identité visuelle. La question sur la relation entre une étiquette et son champ associé touche à l'ergonomie et à la lisibilité, deux concepts clés mentionnés dans la synthèse. Cependant, l'exercice se concentre spécifiquement sur un aspect très précis (la proximité visuelle) sans aborder d'autres éléments importants comme le contraste ou la cohérence du design. Cela limite sa portée par rapport à l'ensemble des concepts liés à l'identité visuelle d'un site web. Ainsi, bien que pertinent, il ne couvre pas complètement les objectifs d'apprentissage définis dans la référence."}, {"exercise": {"id": "7a9bfae2718c4ec894908d42d69a0337", "question": "Quel est l'objectif principal d'un design system ?", "answers": ["Créer un système standardisé englobant tous les éléments graphiques et visuels"], "distractors": ["Faciliter uniquement la communication entre développeurs sans autres éléments.", "Améliorer la sécurité des données en développement produit.", "Se concentrer sur le développement du backend d'un produit.", "Optimiser exclusivement la performance technique des produits numériques.", "Gérer les bugs et correctifs de manière centralisée.", "Automatiser entièrement le processus de développement logiciel.", "Organiser tous les tests de performance pour un projet donné.", "Encourager l’utilisation des frameworks open-source dans le produit.", "Développer des environnements virtuels pour les phases de tests."], "feedback": "L'objectif principal d'un design system est de regrouper tous les éléments visuels et graphiques, ainsi que les règles, le branding et le ton dans un système standardisé pour faciliter le processus de développement et assurer cohérence et efficacité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "80f2748947d6476e8681cba1c8f7a4cd", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "Un design system est un procédé englobant tous les éléments concernant le point de contact entre les acteurs du développement d'un produit. Un design system a donc pour objectif de réunir tous les éléments graphiques, visuels, liés aux règles, de branding, de ton, etc. dans un seul et même système standardisé.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "41c65a34815249ddbd539e8ce8551790", "next_id": "9f560020e0644e2f89f5793fc2ffcf6a", "prev_id": "41c65a34815249ddbd539e8ce8551790", "associated_block_ids": [], "first_page": 267, "last_page": 267, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde le concept de design system, qui est lié à l'identité visuelle d'un site web en tant qu'ensemble standardisé d'éléments graphiques et visuels. Cependant, bien que pertinent, il ne couvre pas directement tous les aspects clés mentionnés dans la référence, tels que l'importance du contraste visuel, de l'esthétique ou de l'organisation de page. L'exercice pourrait être amélioré en intégrant des questions plus spécifiques sur ces éléments pour mieux évaluer la compréhension globale de l'identité visuelle."}, {"exercise": {"id": "98e4a74f235e4dc1a2c1d0fc6551ae85", "query": "Il est important que l'étiquette et son champ soient visuellement <blank>, afin d'éviter toute confusion sur leur relation.", "answers": ["proches"], "distractors": [["séparés", "indépendants", "dissociés", "distants", "espacés", "invisibles"]], "feedback": "L'étiquette doit être visuellement proche de son champ pour que l'utilisateur puisse facilement comprendre qu'ils sont liés. Si l'étiquette est trop distante ou dissociée de son champ, cela peut entraîner une confusion pour l'utilisateur sur la fonctionnalité associée.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "12c5894300cf460cbe3b8114baa287aa", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "Il faut que l'étiquette et son champ soient visuellement proches de manière à ce que la relation entre les deux ne puisse pas prêter à confusion. Note : lorsqu'une alternative à un procédé ou une fonctionnalité JavaScript est proposée, le moyen d'y accéder doit être fourni par le site lui-même. Il peut s'agir d'un lien ou d'un bouton permettant d'accéder à une page alternative fonctionnant sans JavaScript ou permettant de remplacer le(s) composant(s) par un composant alternatif fonctionnant sans JavaScript par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "72d54844916c4a2c944fa31228985a47", "next_id": "6d26b46248d6443fac48540c0758a491", "prev_id": "72d54844916c4a2c944fa31228985a47", "associated_block_ids": [], "first_page": 85, "last_page": 85, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé teste la compréhension d'un principe de design visuel, à savoir la proximité entre les éléments (étiquette et champ), ce qui est pertinent pour l'identité visuelle d'un site web. Cependant, il ne couvre pas directement d'autres aspects clés mentionnés dans la référence, tels que le contraste visuel, l'esthétique ou l'organisation de page. Bien qu'il soit lié à l'ergonomie et à la lisibilité, il manque une portée plus large sur les divers éléments graphiques qui constituent une identité visuelle complète. Par conséquent, bien qu'il soit pertinent, il n'évalue pas tous les concepts clés de manière exhaustive."}, {"exercise": {"id": "bdaeca7c362e4118ad49fffb1608c86e", "query": "En ne travaillant pas sur l'accessibilité web d'un site, on se prive de <blank> de visiteurs potentiels.", "answers": ["millions"], "distractors": [["centaines", "dizaines", "milliers", "quelques", "très peu", "centimes"]], "feedback": "Se priver de millions de visiteurs potentiels est le bon choix, car entre 15% et 20% de la population souffrent d'un handicap. Cela représente un grand nombre de personnes, bien plus qu'une simple centaine ou dizaine, d'où l'expression 'millions'.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé évalue la compréhension de l'importance de l'accessibilité web, qui est un aspect clé de l'identité visuelle d'un site. En effet, garantir que toutes les informations soient accessibles est essentiel pour attirer et retenir un large éventail d'utilisateurs. Cependant, cet exercice se concentre uniquement sur un aspect spécifique (l'accessibilité) sans aborder d'autres éléments cruciaux tels que le contraste visuel, la simplicité du design ou l'organisation de page. Bien qu'il soit pertinent, il ne couvre pas entièrement la définition globale de l'identité visuelle d'un site web, ce qui justifie une note relativement élevée mais pas maximale."}, {"exercise": {"id": "64682f4463314c6f9a8f00d69e6c2034", "statement": "Il est possible de supprimer l'indication visuelle du focus d'un élément à condition que le style ajouté soit suffisamment visible et contrasté.", "veracity": true, "feedback": "L'indication visuelle du focus peut être ajustée ou remplacée uniquement si un style personnalisé est ajouté et qu'il respecte les critères de visibilité et de contraste suffisants, conformément aux bonnes pratiques d'accessibilité concernant le critère 3.3.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "fd43e9c74e7940dbb6bd4b4f46a4f448", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "La prise de focus est l'état renvoyé par un élément qui reçoit l'attention suite à une action de l'utilisateur. Il y a trois moyens en HTML de donner le focus à un élément : Note 2 : l'indication visuelle du focus du navigateur ne doit pas être pas supprimée ou dégradée sauf si un style du focus défini par l'auteur est visible et suffisamment contrasté au regard du critère 3.3.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c33e45f531924b10938e9149499b7ed4", "next_id": "c990b14433b64c91a14370bdf18ed4b6", "prev_id": "c33e45f531924b10938e9149499b7ed4", "associated_block_ids": [], "first_page": 117, "last_page": 117, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'identité visuelle d'un site web, à savoir l'indication visuelle du focus, qui est liée à la lisibilité et à l'accessibilité des éléments graphiques. Cependant, bien qu'il teste la compréhension des principes de contraste et d'accessibilité, il ne couvre pas directement d'autres éléments clés mentionnés dans la référence, tels que la conception globale de l'identité visuelle ou l'importance de la cohérence dans le design. L'exercice pourrait être amélioré en intégrant des questions sur d'autres aspects essentiels comme l'esthétique ou l'organisation de page."}, {"exercise": {"id": "44a1cb1994f54733b945e6d994952d37", "question": "Quelle méthode garantit l'accessibilité des fonctionnalités par défaut ?", "answers": ["La touche de tabulation doit permettre d'accéder à chaque fonctionnalité"], "distractors": ["Les fonctionnalités doivent être accessibles uniquement par une commande vocale.", "Toutes les fonctionnalités doivent être activées automatiquement sans intervention.", "L'accès aux fonctionnalités ne peut se faire que via la souris.", "Les utilisateurs doivent installer un logiciel tiers pour accéder aux fonctions.", "Seuls les utilisateurs avancés peuvent personnaliser l'accessibilité.", "Il faut activer un mode spécial pour accéder aux fonctionnalités.", "L'accessibilité ne doit pas être priorisée pour les dispositifs mobiles.", "Les fonctionnalités n'ont pas besoin d'être accessibles sans support visuel.", "Un code d'accès est nécessaire pour chaque fonctionnalité."], "feedback": "La touche de tabulation est une méthode largement utilisée pour naviguer rapidement entre les différentes fonctionnalités d'un système informatique. En garantissant l'accès des fonctionnalités par cette touche, on assure une accessibilité intuitive et pratique pour tous les utilisateurs, indépendamment de leur dispositif de pointage ou de leurs capacités physiques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'accessibilité, qui est un aspect important de l'identité visuelle d'un site web. La réponse correcte souligne l'importance de la touche de tabulation pour naviguer entre les fonctionnalités, ce qui est en lien avec le principe d'ergonomie et d'accessibilité mentionné dans la synthèse. Cependant, l'exercice ne teste pas directement des concepts clés tels que la définition ou les éléments graphiques spécifiques qui composent une identité visuelle. Il se concentre plutôt sur un aspect technique de l'accessibilité, ce qui le rend pertinent mais pas entièrement aligné avec l'objectif pédagogique principal."}, {"exercise": {"id": "870f44252b3f466d91e4ffa414b5cdbe", "query": "La hiérarchie des éléments d'une interface guide l'utilisateur dans sa navigation. Il commence par lire le contenu, puis, s'il le juge nécessaire, effectue une action pour laquelle il devra trouver <blank>.", "answers": ["un call to action"], "distractors": [["un formulaire de contact", "une barre de recherche", "un menu déroulant", "une notification", "un footer", "une suggestion d'article"]], "feedback": "Le 'call to action' est une incitation à accomplir une action particulière, par exemple cliquer sur un bouton ou remplir un formulaire. C'est l'élément que l'utilisateur doit trouver après avoir parcouru le contenu, lorsqu'il décide d'interagir avec l'interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "e2bd95ef2b864eaeaf0a7e2fc8ee1adb", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter le sens de lecture : la hiérarchie entre les différents éléments d'une interface permet une meilleure compréhension de l'action. Pensez donc à l'ordre de lecture de votre utilisateur. Il va tout d'abord lire le contenu puis si besoin faire une démarche et c'est à ce moment-là qu'il devra trouver un call to action.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "69d2103b6b9f497784eb244a81443a00", "next_id": "ca1189c7ccfc4033aba56404ac90b656", "prev_id": "5da8312c6cf74d15ab1ebee4e3cb21b9", "associated_block_ids": [], "first_page": 261, "last_page": 261, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension de la hiérarchie des éléments d'une interface, ce qui est pertinent pour définir l'identité visuelle d'un site web. Cependant, il se concentre principalement sur un aspect spécifique (le 'call to action') sans aborder d'autres éléments clés mentionnés dans la référence, tels que le contraste visuel, l'esthétique ou l'organisation de page. Bien qu'il soit utile pour évaluer une partie de la conception UX, il ne couvre pas suffisamment les concepts globaux liés à l'identité visuelle."}, {"exercise": {"id": "3677b97adbdf428c970bddc623fe6c86", "query": "Une icône a souvent une signification bien précise. Inutile donc <blank> au risque de perdre en intuitivité.", "answers": ["de la réinventer"], "distractors": [["du dupliquer", "de l'ignorer", "du simplifier", "du minimiser", "du changer", "du renommer"]], "feedback": "La bonne réponse est 'réinventer' car l'utilisation d'icônes établies permet aux utilisateurs de s'y retrouver facilement. Les réinventer pourrait les dérouter et rendre l'interface moins intuitive.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "56567704561040b5aa7062d5b6655758", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Une icône a le plus souvent une signification établie. Elle est ainsi représentée de la même façon dans toutes les interfaces. Les utilisateurs la connaissent et savent à quoi elle sert. Inutile donc de la réinventer au risque de perdre votre utilisateur et de le faire fuir. :selected:A · Ne cherchez pas à réinventer l'eau chaude au risque de perdre en intuitivité. Certaines conventions établies ont de bonnes raisons d'être.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2448bea35d8d4e0299e816d63087c410", "next_id": "251fe51a6f5f493fa54bd359ab56e436", "prev_id": "2448bea35d8d4e0299e816d63087c410", "associated_block_ids": [], "first_page": 393, "last_page": 395, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice proposé teste la compréhension de l'importance des icônes dans l'identité visuelle d'un site web, ce qui est pertinent par rapport à la référence. Cependant, il se concentre uniquement sur un aspect spécifique (l'utilisation correcte des icônes) sans aborder d'autres éléments clés tels que le contraste visuel, l'esthétique ou l'organisation de page mentionnés dans la synthèse. Bien qu'il soit utile pour évaluer une partie de la conception graphique, il ne couvre pas suffisamment les concepts globaux liés à l'identité visuelle pour obtenir une note plus élevée."}, {"exercise": {"id": "315cfc8b0c0a4c239408287509fd82a3", "statement": "L'ajout d'animations est utilisé uniquement pour rendre un site plus esthétique, sans impact sur l'expérience utilisateur.", "veracity": false, "feedback": "Bien que l'ajout d'animations puisse contribuer à l'esthétique d’un site Web, il ne se limite pas à cela. Les animations jouent également un rôle dans l'expérience utilisateur, en influençant potentiellement les émotions et les perceptions des utilisateurs dans les zones de conflit mentionnées.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "bfbf8441896a41a7850954b9ccdb31b6", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "En dehors de cette école de pensée, nous pouvons considérer les fonctionnalités que nous avions l'habitude de rejeter comme techniques, les bifurcations sur la route, telles que le menu ou les liens internes, le CTA et les extrémités de la route également - comme le pied de page ou 404. Dans ces « zones de conflit », nous pouvons cartographier les sentiments que les utilisateurs pourraient ressentir, tels que le succès ou l'échec, l'intérêt, la confiance ou la suspicion, etc. L'ajout d'animations,", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "fda72c1db86f43299ad6dfd92e3b43a6", "next_id": "e1fb6be712cb4084b479d027f2ab6e53", "prev_id": "fb597d045cb548a99b398c52ffc13f44", "associated_block_ids": [], "first_page": 369, "last_page": 369, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'esthétique et de l'expérience utilisateur, qui sont des éléments clés de l'identité visuelle d'un site web. Cependant, il ne couvre pas directement les concepts fondamentaux tels que le contraste visuel, la simplicité dans le design ou l'organisation de page. Bien qu'il soit pertinent en ce qui concerne l'impact des animations sur l'expérience utilisateur, il aurait pu être plus centré sur les éléments graphiques spécifiques mentionnés dans la synthèse. Cela justifie une note relativement bonne mais pas parfaite."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 32.0, "top_pages": [25, 98], "top_minutes": []}, {"document": {"id": 13609, "label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "authors": [], "title": "Mathilde Vigneron : Designer Produit et Spécialiste en Marketing Mobile", "content": [], "mime_type": "application/pdf", "short_summary": "Mathilde Vigneron est une designer produit spécialisée en UX/UI, axée sur le e-commerce et la formation. Elle dirige des projets de marketing mobile, mettant l'accent sur l'acquisition d'utilisateurs et les modèles économiques pour les applications mobiles.", "long_summary": "- Mathilde Vigneron est une designer produit UX/UI spécialisée dans le e-commerce.\n- Elle est également formatrice dans ce domaine.\n- Actuellement impliquée dans un projet de marketing mobile avec des livrables prévus entre mai et juillet 2024.\n- Le marketing mobile se concentre sur les techniques adaptées aux smartphones pour atteindre les consommateurs en déplacement.\n- Les utilisateurs mobiles consultent leur téléphone en moyenne 150 fois par jour, soulignant l'importance du m-marketing.\n- Les SMS ont un taux de lecture élevé (90% dans les 10 minutes suivant l'envoi).\n- L'optimisation des sites/applications pour mobile est cruciale pour une bonne expérience utilisateur.\n- Le m-marketing a évolué depuis l'envoi de SMS vers des publicités intégrées dans des applications et notifications push ciblées.\n- La géolocalisation permet un ciblage précis, favorisant le marketing de proximité.\n- Mathilde met également l'accent sur la création d'une image de marque forte à travers des campagnes innovantes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/Mm6gwEhAnVik1yPM/documents/9ce3ef3__ynov-connect_mobil-marketing-user-acquisition-and-modeles-economique_b3-commun-marcom.pdf", "external_url": null, "path": null, "corpus_id": 637, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Mathilde Vigneron PRODUCT DESIGNER UX/UI Spécialisé e-commerce et Formatrice\n===\n\n- Qu'est-ce que le m- marketing ?\n===\n\n- Distinction entre marketing mobile et marketing traditionnel\n===\n\n- Les outils du marketing mobile\n===\n\n- Le marketing mobile\n===\n\n- Les avantages du mobile marketing\n===\n\n- Avec toutes les possibilités qu'il offre, le marketing mobile offre de nombreux avantages aux entreprises :\n===\n\n- Les avantages du MARKETING MOBILE\n===\n\n- Insta I Dopamine I ARTE.tv\n===\n\n- Atteignez les bons utilisateurs partout et partout\n===\n\n  - ## Créer une source de revenus durable\n\n  - ## Recibler, réengager, reconvertir et fidéliser\n\n- Qu'est-ce que l'acquisition client au juste ?\n===\n\n  - ## L'acquisition client : définition\n\n  - ## Les leviers de l'acquisition client\n\n  - ## SEO (Search Engine Optimization)\n\n  - ## SEA (Search Engine Advertising)\n\n  - ## L'email marketing\n\n    - ### Les réseaux sociaux\n\n    - ### Le marketing de contenu\n\n    - ### Les avis clients\n\n  - ## Les partenariats\n\n    - ### Les essais gratuits\n\n  - ## Les téléchargements\n\n- Comment utiliser TikTok pour votre marketing\n===\n\n  - ## La publicité in-app :\n\n- Une application Freemium :\n===\n\n- Le sponsoring :\n===\n\n- La version d'essai :\n===\n\n- Serial position effect : début et fin\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Loi de Tesler : conservation de la complexité\n===\n\n  - ## LOI\n\n  - ## ILLUSTRATION\n\n- Effet Von Restroff (ou « isolation effect ») : Différence\n===\n\n  - ## LOI\n\n- Effet Zeigarnik : incompletion\n===\n\n  - ## LOI\n\n- Comment le confinement vous a rendu plus accro aux applis\n===\n\n- 1. Donnez un prénom ou nom à votre persona\n===\n\n- 2. Identifiez-le dans la population\n===\n\n- 3. Donnez-lui une personnalité\n===\n\n- 5. Attribuez lui des objectifs, des valeurs, des craintes\n===\n\n- 6. Personnalisez votre message marketing\n===\n\n- 7. Par quels canaux l'aborder?\n===\n\n- 1. Loi de Fitts : distance et taille\n===\n\n- Finger-friendly :\n===\n\n- Ils ont OSÉ sortir ce site ?\n===\n\n- Gestion de projet et organisation\n===\n\n  - ## Regardez Notion en action :\n\n- Création d'une application mobile\n===\n\n- Nous programmons des vacances au ski :\n===\n\n- Station de sport d'hiver\n===\n\n- Les applis ski\n===\n\n  - ## OnTheSnow - La météo et plus encore (iOS & Android)\n\n  - ## Ski Montagne - Plan des pistes et météo en poche (iOS & Android)\n\n    - ### Tricount - Les bons comptes font les bons amis\n\n  - ## Trip Advisor - Les bonnes adresses\n\n    - ### Alpine Replay - Le tableau de bord du ski (iOS & Android)\n\n  - ## Mammut Safety App - Sécurité & Secours (iOS & Android)\n\n    - ### Défis entre amis (iOS & Android)\n\n    - ### Peakfinder Earth - Un tour d'horizon (iOS & Android)\n\n  - ## Pour s'informer en temps réel\n\n    - ### Pour mesurer ses performances\n\n    - ### Pour augmenter sa sécurité\n\n- Devoir Asynchrone\n===\n\n- 10 Mai\n===\n\n- L'acquisition d'utilisateurs, état des lieux\n===\n\n- Les données sur les téléchargements d'applications\n===\n\n  - ## 10 Most Downloaded Apps in 2020 Worldwide\n\n    - ### Overall - Worldwide\n :selected:\n<figure>\n\n- Les usages des applications mobiles\n===\n\n- Site mobile ou application mobile, que choisir ?\n===\n\n- Les troubles et les écrans chez les enfants\n===\n\n- Des applications réellement éducatives ?\n===\n\n- Soyez vigilants\n===\n\n- Pour un usage responsable\n===\n\n- Enfants et écrans : les effets néfastes d'un usage excessif\n===\n\n- Mobile : un usage toujours plus important, une vitesse de connexion en hausse\n===\n\n- Le taux de connexion à Internet via le mobile en hausse\n===\n\n- Une accélération de la vitesse de connexion sur mobile\n===\n\n- Réseaux sociaux : TikTok poursuit son ascension, les plateformes fortement utilisées pour consulter l'actualité\n===\n\n- SNCF Connect : une réelle CATASTROPHE ?\n===\n\n- Loi de continuité :\n===\n\n- 6. Loi de Parkinson :\n===\n\n- temps\n===\n\n  - ## LOI\n\n  - ## EUR 899,00\n\n- 4 grandes étapes du tri par carte :\n===\n\n  - ## ETAPE 3. Groupement.\n\n- Exercice / Pratique\n===\n\n- Exercice / Pratique\n===\n\n- Le discours\n===\n\n- Les fonctionnalités\n===\n\n- L'AFFORDANCE\n===\n\n- fnac / 16 Novembre 2019\n===\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 14 Février 2015\n===\n\n  - ## SÉLECTIONS FNAC\n\n- / 03 Février 2012\n===\n\n  - ## Engagements\n\n  - ## Services de Noël\n\n  - ## GUIDE CADEAUX\n\n  - ## LIVRES SÉLECTION\n\n- Qu'est ce qu'un produit minimum viable ?\n===\n\n- Le MVP, la clé de l'agilité !\n===\n\n  - ## Airbnb\n\n- Groupon\n===\n\n- 200 milliards de dollars\n===\n\n- En conclusion\n===\n\n- Le responsive / l'Adaptive Design\n===\n\n- Un site non responsive\n===\n\n- Un site responsive\n===\n\n- Desktop\n===\n\n- Responsive\n===\n\n  - ## Les avantages de la mise en page Responsive\n\n  - ## Les inconvénients de la mise en page Responsive\n\n- Qu'est-ce que l'Adaptive Design ?\n===\n\n- Adaptive\n===\n\n- Webmarketing et marketing mobile\n===\n\n- Les limites du mobile first\n===\n\n  - ## Qu'est-ce qu'un site web adaptatif ?\n\n- Quand doit-on parler de « design d'expérience » ?\n===\n\n- A quoi bon faire un chemin tout joli et tout propre, si personne ne l'utilise ?\n===\n\n- Quelle est la différence entre le Zoning, Wireframe, Mockup et Prototype ?\n===\n\n  - ## Qu'est-ce que le Zoning ?\n\n- Quelle est la différence entre le Zoning, Wireframe, ?\n===\n\n- Qu'est-ce qu'un Wireframe ?\n===\n\n- I Wireframe\n===\n\n- MAIS L'EXPERIENCE CLIENT, QU'EST CE QUE C'EST ?\n===\n\n- Pourquoi Amazon est aussi MOCHE ?\n===\n\n  - ## 2 cartes à réaliser au tout début d'un projet :\n\n  - ## 1_ Empathy Map / La carte d'empathie\n\n  - ## Empathie map / Comment ça marche ?\n\n  - ## 1. Que voit le client ?\n\n  - ## 2. Qu'entend le client ?\n\n  - ## 6. Qu'espère le client ?\n\n  - ## 2 - Customer journey : focus sur l'interaction avec un service ou produit précis\n\n- Comment faire mon CUSTOMER JOURNEY MAPPING\n===\n\n- Empathy map\n===\n\n- Notre CARTE D'EMPATHIE À REMPLIR\n===\n\n- Empathy map\n===\n\n- Le Social Proof sur une Page d'Accueil de e- Commerce\n===\n\n- L'effet de Social Proof sur les Pages Produits en e-Commerce\n===\n\n  - ## #3 - Ne recommandez pas vous-même votre produit, indiquez combien de clients le recommandent\n\n  - ## #4 - Présentez votre produit comme le numéro 1 : le mieux noté, le plus vendu, etc.\n\n    - ### #5 - Affichez le nombre de « Likes » à côté de votre produit\n\n    - ### #6 - Recommandez des produits similaires : « Les personnes ayant vu ce produit ont aussi acheté : »\n\n- #7 - Affichez les avis clients juste en dessous de votre produit\n===\n\n  - ## #8 - Utilisez des avis et témoignages d'experts pour promouvoir vos produits\n\n- L'Effet de Social Proof sur les Pages de Catégories en e-Commerce\n===\n\n- L'Effet de Social Proof dans la Barre de Recherche\n===\n\n  - ## L'Effet de Social Proof dans le Processus de Paiement\n\n  - ## Quelques Éléments Plus Précis du Design d'un Site de e-Commerce\n\n- Amazon | Dopamine | Saison 02 | Episode 02 | ARTE\n===\n\n  - ## Un Flow Chart, c'est quoi?\n\n  - ## Il permet de :\n\n- Application mobile\n===\n\n- #1 / Connaître et choisir le bon type de CTA\n===\n\n- #2 / Donner envie de cliquer !\n===\n\n- https://eu.supreme.com/\n===\n\n- https://eu.supreme.com/\n===\n\n  - ## supreme.com/news/\n\n  - ## Supreme\n\n    - ### 30/12/5022 Supreme/Spyde:\n\n- #3 / La taille compte\n===\n\n  - ## #4 / La taille du texte\n\n- Un petit écran pour voir les choses en grand\n===\n\n- #5 / Donner envie avec le bon libellé\n===\n\n- #6 / Le bon placement\n===\n\n- Les tendances DESIGN pour réussir en 2023\n===\n\n- Qu'est-ce qu'un Design System ? La définition\n===\n\n- Comment créer un design system ?\n===\n\n- Design system d'un site - Fondamentaux du web design\n===\n\n  - ## OBSERVING THE UNIVERSE'S INFANCY\n\n  - ## CUOMO'S WAR AGAINST A FEDERAL PROSECUTOR\n\n- Les différents types d'espaces blancs que vous devez connaître\n===\n\n  - ## Espace blanc Micro vs Macro\n\n- Espace blanc passif et espace blanc actif\n===\n\n- Il conduit à des interfaces plus attrayantes\n===\n\n- Il rend les sites Web plus faciles à utiliser\n===\n\n  - ## 11 exemples inspirants d'espaces blancs dans la conception Web\n\n- Polices web vs. polices sécurisées pour le web : quelle différence ?\n===\n\n- Et l'esthétique des polices dans tout ça ?\n===\n\n- Quand utiliser des polices à empattements en design web\n===\n\n- Les meilleures polices web-safe avec empattements\n===\n\n- Garamond\n===\n\n  - ## Garamond\n\n  - ## Apparel\n\n  - ## Helvetica\n\n- Références Typographiques\n===\n\n- La police de caractère Futura\n===\n\n- La police de caractère Trajan\n===\n\n- La police de caractère Trajan\n===\n\n- Comment identifier la police d'un site web ?\n===\n\n- CLUSE\n===\n\n- Whatsapp | Dopamine | Saison 02 | Episode 01 | ARTE\n===\n\n  - ## https://www.youtube.com/watch? V=wMCdIJTp3u4&list=PL8Ax z5vzflwdvoTnARE5FiYI42Sg-fYb\n\n- Qu'est-ce que la psychologie des couleurs ?\n===\n\n- Brand personality traits to colors\n===\n\n- Rouge : énergie, excitation, passion et danger. Utiliser du rouge sur son site web est une excellente manière de pousser ses visiteurs à l'action.\n===\n\n  - ## Comment l'orange est-il utilisé par les entreprises ?\n\n  - ## LES DERNIÈRES PARUTIONS\n\n- Violet : le violet a un côté à la fois tendance et relié au sex.\n===\n\n- Design Scientist\n===\n\n- Utilisez les bonnes palettes de couleurs pour évoquer un sentiment précis\n===\n\n- Les palettes de couleurs qui suscitent l'excitation\n===\n\n- Les palettes de couleurs qui prennent l'audience par les sentiments\n===\n\n- Les palettes de couleurs qui donnent de la crédibilité\n===\n\n- Les palettes de couleurs qui renforcent la confiance\n===\n\n- Les bonnes couleurs pour augmenter votre taux de conversion\n===\n\n- Le bleu pour la finance\n===\n\n- Le rouge pour la vente\n===\n\n  - ## L'Eye Tracking pour rendre les jeux plus naturels\n\n- IKEA eyetracking\n===\n\n  - ## 01 Mode gobelin - maximalisme\n\n- 02 Simplicité et minimalisme\n===\n\n  - ## ZARA\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- 03_Hyper-délices dans un parcours de site Web\n===\n\n- RUIES TUIe iles rulen.\n===\n\n- 03_Le mouvement : la tendance design graphique\n===\n\n- 05_Le scroll à l'horizontal\n===\n\n- 06_Nostalgie en temps de surcharge numérique\n===\n\n  - ## https://hle.io/\n\n- 07 Le mouvement engendre l'émotion\n===\n\n  - ## https://estudiosvictorcordon.pt/\n\n- 08_La parole dans tous vos services\n===\n\n- 09_Le dark mode, le design graphique sombre qui s'installe sur tous vos écrans\n===\n\n- 10_Mises en page typographiques - Vous nous manquez print\n===\n\n- 1. Ne pas faire de la vitesse\n===\n\n- une priorité\n===\n\n- 2. Faire passer la création avant la conversion\n===\n\n- 3. Cacher ses CTAS\n===\n\n- 4. Négliger la navigation\n===\n\n- 5. Oublier le responsive\n===\n\n- 7. Oublier l'analytique\n===\n\n- 8_Compliquer l'interface par l'ajout de fonctionnalités inutiles\n===\n\n- 9. Ne pas prendre en compte le contexte utilisateur\n===\n\n  - ## Exemple\n\n- 10. Se lancer dans le design de l'interface avant d'en avoir défini les objectifs\n===\n\n- 11. Suivre aveuglement les tendances de conception\n===\n\n- 12. Réinventer les conventions\n===\n\n  - ## Exemple\n\n- 13. Privilégier l'apparence plutôt que le fonctionnement\n===\n\n- Conclusion\n===\n\n- Waze | Dopamine | Saison 02 | Episode 06 | ARTE\n===\n\n- Devoir Asynchrone\n===\n", "number_of_pages": 397, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 8.7, "top_pages": [384, 385], "top_minutes": []}, {"document": {"id": 13704, "label": "QUALITE-WEB-_C3", "authors": [], "title": "Ergonomie Web : Principes et Bonnes Pratiques", "content": [], "mime_type": "application/pdf", "short_summary": "L'ergonomie web vise à améliorer l'expérience utilisateur en rendant les interfaces faciles et confortables à utiliser. Des règles comme la loi de Fitts et la règle des 2 secondes sont essentielles pour optimiser l'interaction entre l'utilisateur et le site.", "long_summary": "- L'ergonomie web adapte les interfaces pour une utilisation facile et agréable.\n- Objectif : améliorer la communication entre l'humain et l'interface.\n- Chaque projet est unique, nécessitant une étude approfondie des utilisateurs.\n- Règle des 2 secondes : un utilisateur ne doit pas attendre plus de 2 secondes pour une réponse du système.\n- La ligne « Fold » : les informations importantes doivent être visibles sans faire défiler la page.\n- Règle de Pareto (80/20) : 20% du contenu satisfait 80% des recherches, prioriser ce contenu dans l'architecture.\n- Loi de Miller : limiter le nombre d'options de navigation à 5-9 éléments pour faciliter le traitement de l'information par l'utilisateur.\n- Loi de Fitts : la taille et la distance des cibles cliquables influencent leur accessibilité, augmentant ainsi les conversions sur un site web.\n- Conseils pratiques incluent supprimer les éléments inutiles, optimiser le chargement des pages, créer une hiérarchie claire, et assurer un bon contraste dans les textes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/63cb3c9_qualite-web-_c3.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- Usages : Ergonomie et UX\n===\n\n- L'ergonomie web a pour objectif d'adapter une interface web à ses visiteurs de sorte que son utilisation soit ressentie comme facile, confortable et que ceux-ci aient envie d'y revenir.\n===\n\n- L'ergonomie digitale a pour but l'amélioration de la communication et de l'interaction entre l'humain et une interface.\n===\n\n- La règle des 2 secondes\n===\n\n- Règle de Pareto (80/20)\n===\n\n- Règle de Pareto (80/20)\n===\n\n- La Loi de Miller\n===\n\n- La loi de Fitts\n===\n\n- La loi de Fitts\n===\n\n- Focus : Organisation d'une page\n===\n\n- Activité\n===\n", "number_of_pages": 27, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.8, "top_pages": [19, 20], "top_minutes": []}]}