{"introduction": "Dans le cadre de la création d'un montage sonore ou vidéo, définir l'identité sonore d'un site web est essentiel pour établir une connexion émotionnelle avec les utilisateurs. Cette identité sonore contribue à façonner l'expérience utilisateur (UX) en intégrant des éléments audio qui enrichissent l'interaction et renforcent la mémorabilité du contenu. Les concepts abordés dans cette synthèse explorent les différentes facettes de l'UX, de l'accessibilité et des médias temporels, tous cruciaux pour concevoir une expérience numérique harmonieuse et inclusive.", "synthesis": "La conception d'expérience utilisateur (UX) est au cœur de la définition de l'identité sonore d'un site web. Elle vise à optimiser les interactions entre les utilisateurs et le contenu numérique, en prenant en compte leurs comportements et préférences. En intégrant des éléments sonores adaptés, on peut améliorer non seulement la satisfaction mais aussi l'efficacité des interactions. L'interface utilisateur (UI), qui représente le point de contact visuel et interactif, joue également un rôle clé dans cette dynamique en influençant la perception globale que les utilisateurs ont du site.\n\nL'accessibilité est un autre aspect fondamental lorsque l'on parle d'identité sonore. Les Web Content Accessibility Guidelines (WCAG) fournissent des normes essentielles pour garantir que tous les utilisateurs, y compris ceux ayant des limitations auditives ou visuelles, puissent interagir avec le contenu audio-vidéo. Des outils comme TalkBack permettent aux utilisateurs malvoyants de naviguer efficacement grâce à des retours sonores, tandis que la transcription textuelle accessible assure que même sans son, le message reste compréhensible.\n\nLes mécanismes tels que le contrôle du son sont cruciaux pour permettre aux utilisateurs d'adapter leur expérience selon leurs besoins personnels. La possibilité d'arrêter ou de relancer un son contribue à un confort d'utilisation optimal et renforce ainsi l'engagement envers le contenu proposé. De plus, offrir une version audio seulement permet aux utilisateurs qui ne peuvent pas visualiser les vidéos d'accéder aux informations essentielles.\n\nLa simplicité dans la conception est également primordiale pour créer une interface intuitive où chaque élément a sa place. Cela inclut la mise en avant des fonctionnalités prioritaires qui améliorent directement l'expérience utilisateur tout en évitant toute surcharge cognitive.\n\nEnfin, il est important de considérer comment les attributs WAI-ARIA peuvent enrichir l'accessibilité du contenu multimédia intégré sur un site web. Ces attributs fournissent des informations contextuelles supplémentaires qui facilitent la compréhension par les technologies d'assistance. En somme, définir une identité sonore efficace nécessite une approche holistique qui intègre UX design, accessibilité et interaction multimédia afin de créer une expérience numérique engageante pour tous.", "concepts": [{"concept": {"id": "baebe016-d0cc-4e32-9346-f7e1124193a3", "label": "Conception d'Expérience Utilisateur (UX)", "definition": "La conception d'expérience utilisateur (UX) est une discipline centrée sur l'optimisation des interactions entre les utilisateurs et les produits ou services numériques. Elle vise à améliorer la satisfaction et l'efficacité de l'utilisation en créant des interfaces utilisateur intuitives et attrayantes, tout en tenant compte des comportements, besoins cognitifs et préférences des utilisateurs finaux. Ce processus englobe à la fois l'esthétique et la fonctionnalité, influençant ainsi l'expérience globale par des choix visuels et structurels. Les professionnels tels que les designers UX et UI travaillent à établir des interactions significatives, simplifiant l'interaction utilisateur tout en gérant la complexité sous-jacente du système.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13680, 13609, 13709], "aliases": ["dbb0eb49-384a-4835-8a27-f3df10e75759", "91010b14-36ae-419d-bf38-a846de1275f6", "574e83b8-4354-48fa-850e-93c5120ebc83", "ecf19b49-88ec-4c4c-a1b6-95ffa690e97f", "25934ed3-33c1-4498-8e65-074291667094", "796f5e0a-7a74-4541-adfb-b2193ad73b61", "a23c6da5-a4ab-4891-991e-7b937aa0abdc", "37ee1509-2635-464b-9584-a9b0c9d9c8ad", "c00973e6-b1c9-4905-942b-5be484cb15c3", "d4bcea8d-2203-4129-9886-2b5a3d013def", "10afcc11-a32f-4ff7-b2c9-b91fd8f41279", "bfa65925-0083-4475-bf52-1b49b880a8ef", "172c8581-4218-4949-9879-3623e9c81b76", "84c2a388-034d-4adb-8881-3d024eed3a5c", "54158781-d4d4-4026-a63f-e0e8693a8902", "9f681d3a-0c7c-4485-9bcf-e52381ff9719", "da83989a-f0e2-4e84-b8e1-dbb6cfe0e312"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "'Conception d'Expérience Utilisateur (UX)' est hautement pertinent car elle englobe tous les aspects liés à la création d'une interface attrayante et fonctionnelle qui inclut également des éléments sonores significatifs."}, {"concept": {"id": "8d90b1e8-9214-40c0-8ea2-d694bbdc1f06", "label": "WCAG (Web Content Accessibility Guidelines)", "definition": "Les Web Content Accessibility Guidelines (WCAG) sont des recommandations internationales établies par le W3C pour améliorer l'accessibilité du contenu web aux personnes handicapées. Ces directives, notamment WCAG 2.0 et 2.1, fournissent des normes précises et des critères techniques visant à garantir que les sites web soient utilisables par tous, y compris les personnes ayant des limitations visuelles, auditives ou motrices. Les WCAG abordent divers aspects de l'accessibilité, tels que le texte alternatif, la navigation, la structure du contenu, le contraste et les médias, ainsi que des critères spécifiques comme les étiquettes de formulaire. L'objectif est d'assurer une expérience utilisateur équitable et inclusive sur le web.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13707, 13708, 13710], "aliases": ["dceb0408-1c1d-4ad9-83ba-62aca3073998", "af7e08b6-e6fe-4968-b6ef-2f81b18f8561", "38d2a4c0-32c9-4903-8d36-cc51b3b381d3", "fdfa8bab-970c-4b08-b15b-2f11574e3904", "9351a93a-918a-45a7-8e11-66403b254438", "86e20d40-7304-4a51-9fea-ce16236922ae", "5c7ac2f9-fb21-41f7-be37-9f7efcf2b8f4", "e826fa27-fad7-4032-9d2c-081161b42f2c", "81a04174-f57e-4c09-8bb1-c4723b364d39", "383540f8-1e4c-4a63-9e58-13942911aa00", "d1870c3b-7e0a-4e42-b28a-b26f4ecf89d1", "a9875d19-6de2-4e6b-b142-5727c16e5395", "a5cac6da-9512-4375-a50f-3e676a3cef72", "612d828f-d279-415d-9fb0-660d624b7126", "8dc523d9-7aa3-4e7e-ae02-9a9dd8a7d88e", "58fb5136-3031-4f0c-9e26-14389d70cfb4", "6ddfd490-85a9-464f-bf75-6e1310c2880c", "fe72be57-e5ba-4a3d-921a-70ea338c35e2", "74b9f07f-a45f-406b-a3b4-2ec3ab0a2a7f", "460fdeb0-899f-447f-981b-c5a7f3802dea", "d96bf9d0-518b-4408-89c6-968266580fec", "b6c407f3-b031-4351-9603-c9a46f019d45", "7b2dc7a4-aacf-4e29-a8f1-816429bbd23b", "969b6ad1-c9d0-485d-aa69-60d291b04801", "c7071fe7-69ff-4dd4-9888-8b84c8c45a2f", "17a7a4c1-b49b-4ae9-a3b7-0f64d47d2005", "e662fbd3-546d-4479-88c3-8c885c5b476c", "d2d330e4-b74a-48d8-9b9a-934efe5c0bf1", "21ab5c3a-69d7-4015-ad96-a6a5427ce37f", "40393381-ae7e-4897-8d88-acdf7bb72733", "d3d0be5b-f36e-4359-a741-bde28874143e", "fba7c1ef-1025-47a1-8934-0da7f2f5a11c", "0356959e-b460-4b0d-ba2a-8a5eb27d7284", "69ea8b6b-f00d-4c22-a0fe-efd62940c05e", "d184d33b-2948-4cf6-afcc-7eb9a8e46ce6", "f235bc29-d9aa-4635-b873-96967ce54fdb", "88742b40-ec3b-4f2e-b412-891fc76ed9ad", "f1213999-0c17-4bb1-a929-4803442c4539", "49e0d661-d21f-4e6b-bd0c-cc5afb2190bf", "239c0474-77a0-4274-a604-1a29094d2a06", "045b0545-1eeb-4d15-b1ef-b4232ccefbd6", "c01bafcd-745a-47e9-b2f1-596bfd04b1c6", "58e002ff-ef37-4632-a35e-6d686a50474e"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "Les WCAG sont cruciales pour garantir que tous les utilisateurs, y compris ceux ayant des limitations auditives, puissent accéder au contenu audio-visuel, ce qui est fondamental pour définir une identité sonore inclusive sur un site web."}, {"concept": {"id": "a1be02e7-3ebb-4e47-b321-ff67b13706b9", "label": "<embed>", "definition": "La balise <embed> est une balise HTML utilisée pour intégrer des contenus multimédias externes, tels que des images ou des vidéos, dans une page web. Elle nécessite souvent une description adéquate pour garantir l'accessibilité, car elle peut être utilisée sans alternative textuelle, ce qui pose des défis pour les utilisateurs ayant des besoins d'accessibilité.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["301bc082-9f69-441e-86c6-34d6be648193"], "wikientity": null, "wordnetentity": null}, "score": 9, "justification": "<embed> est crucial pour intégrer des contenus multimédias, y compris audio, dans une page web et joue donc un rôle important dans la définition de l'identité sonore."}, {"concept": {"id": "d4621b87-0170-4bf2-9bec-4e0fb1622a41", "label": "Expérience Utilisateur et Client", "definition": "L'expérience utilisateur (UX) et l'expérience client englobent toutes les émotions, attitudes et réactions d'un utilisateur lors de son interaction avec un produit ou service. L'UX vise à optimiser la satisfaction en améliorant la perception globale influencée par le design, les fonctionnalités, l'interface, l'utilisabilité et le plaisir d'utilisation. L'interface utilisateur (UI), qui constitue le point de contact visuel et interactif entre l'utilisateur et le système, joue un rôle crucial dans la convivialité et l'esthétique du produit numérique. De plus, l'UX mobile se concentre sur la création d'interfaces conviviales pour maximiser l'engagement des utilisateurs sur appareils mobiles. Ensemble, ces concepts visent à réduire les frictions durant le processus d'achat et à influencer la fidélité des utilisateurs dans un environnement numérique.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13700, 13670, 13608, 13609, 13676, 13615, 13689, 13658, 13704, 13705, 13710], "aliases": ["f296b222-d560-4248-96bb-5c800d13de5a", "057eaaf2-669f-463c-9c0c-6a337b8db1ca", "18f1f1a7-bc86-4340-bb2d-9d3ab72bd076", "857363b0-e856-46c3-a9ba-962904a093cc", "3f8829ac-8d6a-4ea6-926e-0d49e35b6bab", "fa800aa7-35b6-4c8d-a07f-eceb2b963631", "cb4781b5-fdae-4904-9e41-080576d25719", "0823bb36-0b0f-4158-8e9d-f4a711d94f80", "e3a45194-3c00-4e71-ae5f-3b9c3a1696db", "45bdffd7-a669-4822-8ee5-47ec0b4bff57", "50e75920-3ee5-4b85-9171-badea0e461df", "2e3fcc57-8dca-4993-b25c-29dd5b2ed960", "2e55a0b5-4131-444a-8acb-f799b08cd4a8", "2dd86415-3de8-40f3-81f8-9f4106b191f7", "4fcf6724-15aa-47f6-80f1-8c5a4274e56e", "74e4b3d2-9845-46e5-b0d7-8e464e94dfd7", "0000f746-4345-4603-9995-61042305a92c", "d82af346-8423-4812-ac32-e015512cae1c", "001194a3-4acc-4874-a17d-653094a2beed", "ae03e329-b60e-47a7-87fc-90e26cad2882", "30a36364-ace2-4d75-b77d-0f8bba576cd5", "00ee15f4-500c-46d0-9a61-6bc980e29394", "26586656-0020-4104-a6c8-5f971e978ee1", "58a7b969-cdf6-43bd-90c5-bb195d05d2ce", "cdfb095e-f6f3-4bea-9447-318d834bf642", "62cc1201-00fb-4f37-85f7-91c919c03242", "73b29564-a625-4928-a4b7-7e788fc167c5", "7a3c2d4c-e307-4d26-99f3-deb78883c043", "fdbbc0fc-19ca-4c2d-b407-6ec8a6ea6844", "78258db4-fbf1-4515-a442-6ce08fa87db6", "1909e864-ea8f-48e9-80c5-ffe2d1aea472", "ee13c9c0-b97a-4199-968c-8579f1aaa011", "a3b51aec-523a-49ed-912d-c7bff8abe071", "e9225a7e-a77f-4a40-b79f-f669dd9c5d90", "7c4e5ce1-473a-485f-9640-802f8919ae88", "7813d1bb-69f5-45e8-ae78-81c2cc41c969", "103d5aea-a072-4dc1-a610-2507f833e896", "c691735f-32a6-4d09-ba35-047f146e4169", "eab9f996-1522-464a-b62b-4ed022baf5fe", "005d3717-29ba-414f-88db-d4ac5b019a1c", "ef9dfe9c-5ae2-4d20-9c51-74267f1ae688"], "wikientity": {"label": "Expérience utilisateur", "definition": "L'expérience utilisateur (EU) (en anglais, user experience, abrégé en \"UX\") est la qualité du vécu de l'utilisateur dans des environnements numériques ou physiques. C'est une notion de plus en plus courante là où l'on utilisait, encore récemment, les notions d'ergonomie des logiciels et d'utilisabilité.", "page_id": "5540073", "wikidata_id": "Q1047808", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'expérience utilisateur et client est cruciale pour définir une identité sonore efficace, car elle englobe les émotions et réactions des utilisateurs face aux éléments sonores d'un site web."}, {"concept": {"id": "b83ad9fb-e58f-4695-866e-0f5df6193a1d", "label": "Consultation de média temporel", "definition": "Interaction avec des contenus multimédias où l'utilisateur peut contrôler la lecture, pause, et activation du son, garantissant une expérience utilisateur optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La consultation de média temporel est très pertinente car elle implique le contrôle du son et contribue à l'expérience utilisateur, ce qui est essentiel lors de la définition de l'identité sonore d'un site web."}, {"concept": {"id": "dd7f034e-b27f-4cf1-9fd4-44d97a868f5d", "label": "Transcription Textuelle Accessible", "definition": "La transcription textuelle accessible est une représentation écrite du contenu audio ou vidéo, permettant une compréhension équivalente de l'information exprimée oralement. Elle est essentielle pour garantir un accès universel aux informations, notamment pour les utilisateurs sourds ou malentendants, en leur permettant de comprendre le média sans son. Cette forme de transcription joue un rôle crucial dans l'accessibilité et la compréhension des médias temporels.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7162bba1-daee-41b2-9c48-91a2622cebf6", "fe137fd9-f557-4c99-a70d-a212c18cfc87", "12744208-3c86-4125-83d5-55c91eecba25"], "wikientity": null, "wordnetentity": null}, "score": 8, "justification": "La transcription textuelle accessible est très pertinente car elle permet une compréhension équivalente du contenu audio, ce qui est essentiel dans le cadre de l'identité sonore et de l'accessibilité des médias."}, {"concept": {"id": "075b744e-efc6-49a8-a497-f94161eb2b72", "label": "TalkBack", "definition": "Lecteur d'écran intégré sur Android permettant aux utilisateurs malvoyants de naviguer sur leurs appareils via des retours sonores.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": {"label": "Google TalkBack", "definition": "Google Talkback était un service d'accessibilité pour Android qui aidait les utilisateurs aveugles et malvoyants à interagir avec leurs appareils. Il utilisait des mots parlés, des vibrations et d’autres commentaires audibles pour permettre à l’utilisateur de savoir ce qui se passait sur l’écran lui permettant ainsi de mieux interagir avec son appareil. Le service était pré-installé sur de nombreux appareils Android.", "page_id": "12676216", "wikidata_id": "Q17990531", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "TalkBack est très pertinent car il concerne directement les retours sonores pour les utilisateurs malvoyants, ce qui fait partie intégrante de l'identité sonore accessible d'un site web."}, {"concept": {"id": "3f7470d7-442d-4922-9f23-70be2de8c8c8", "label": "Accessibilité des contenus visuels", "definition": "L'accessibilité des contenus visuels se réfère à la fourniture de descriptions textuelles pour les images et éléments graphiques, permettant aux utilisateurs de technologies d'assistance, comme les lecteurs d'écran, de comprendre le contenu visuel lorsque celui-ci ne peut pas être affiché. Cela inclut l'utilisation d'attributs alternatifs en HTML qui décrivent ces images, ainsi que la mise à disposition de contenu ou fonctionnalités équivalentes lorsque certaines conditions ne sont pas remplies, garantissant ainsi une accessibilité optimale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["7f9d95fb-80ae-4ce9-b4ad-ed8ff0eab829", "104cae17-0a9a-49b6-9395-a7a4af1f4c39", "963fcb43-959a-46ac-8a0e-df703abd85f0", "88400249-4250-499f-b98d-a5cb498ee7cc", "5b26344a-b71c-4c0f-b03c-af99333bff27"], "wikientity": {"label": "Alternative textuelle", "definition": "L'alternative textuelle est un texte que l'on associe à un contenu graphique comme une image, une zone cliquable dans une image ou un élément de formulaire de type image, dans un site web ou dans un document produit par un logiciel d'une suite bureautique, pour que l'utilisateur qui ne peut visualiser l'image puisse être informé de ce qu'elle représente et signifie. L'alternative textuelle est restituée à la place de l'image quand celle-ci n'est pas consultable.\nL'alternative textuelle, dont l'emploi est obligatoire dans le cadre de l'accessibilité du web, concerne tant les personnes qui utilisent un navigateur textuel ou un lecteur d'écran, que celles qui, par choix ou à cause d'un problème technique, ne peuvent visualiser l'image.", "page_id": "7715605", "wikidata_id": "Q1067764", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 8, "justification": "L'accessibilité des contenus visuels est pertinente car une identité sonore doit également prendre en compte les besoins des utilisateurs ayant des déficiences auditives, bien que cela soit plus indirect."}, {"concept": {"id": "ba87e2a2-9229-4178-afc7-ff2a563c167f", "label": "Contrôle du son", "definition": "Mécanisme permettant à l'utilisateur d'arrêter ou de relancer un son, essentiel pour l'accessibilité et le confort d'utilisation des médias.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Le contrôle du son est pertinent car il touche à l'interaction utilisateur avec les éléments audio d'un site web, ce qui est essentiel pour définir une identité sonore accessible et agréable."}, {"concept": {"id": "00fa6735-f36a-4e35-b320-7cfbb0cfad71", "label": "Version audio seulement", "definition": "Format audio d'une vidéo qui transmet les informations visuelles essentielles, facilitant l'accès à l'information pour les utilisateurs ne pouvant pas visualiser la vidéo.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La version audio seulement est très pertinente car elle permet de transmettre des informations essentielles via le son, contribuant ainsi à établir une identité sonore claire pour ceux qui ne peuvent pas voir le contenu visuel."}, {"concept": {"id": "824ed510-a8b6-49e8-b6a1-03338f5078d0", "label": "Simplicité", "definition": "Simplicité désigne une approche de design qui privilégie la réduction des éléments superflus pour créer des interfaces claires, intuitives et esthétiquement plaisantes. Ce principe vise à rendre les interfaces faciles à comprendre et à utiliser, favorisant ainsi une expérience utilisateur optimale en mettant l'accent sur le minimalisme, la fonctionnalité et la réduction de la courbe d'apprentissage.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13609, 13670], "aliases": ["47f2f051-fc64-4767-a7d9-d8ee1647c790", "ec0ccc55-4f6a-4747-aac4-58f647587fa5"], "wikientity": null, "wordnetentity": {"label": "Simplicité", "definition": "the quality of being simple or uncompounded", "name": "simplicity.n.01", "english_lemmas": [], "french_lemmas": [], "root_hypernyms": [], "topic_domains": [], "region_domains": [], "usage_domains": [], "hypernyms_list": []}}, "score": 7, "justification": "La simplicité dans le design peut influencer positivement l'identité sonore en rendant les éléments audio plus clairs et accessibles aux utilisateurs."}, {"concept": {"id": "5a5e31ab-5348-4c9c-a5d1-e53a2cecf269", "label": "Usagers", "definition": "Individus qui interagissent avec une interface ou un produit, dont les besoins doivent être au centre du processus de conception.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13704], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Usagers' sont centraux dans la conception d'une interface; comprendre leurs besoins peut influencer comment une identité sonore est développée pour améliorer leur expérience."}, {"concept": {"id": "3b4e3edc-01a2-4e45-a97b-d86cbd0b4064", "label": "Fonctionnalités prioritaires", "definition": "Éléments d'une interface jugés essentiels qui doivent être mis en avant pour améliorer l'expérience utilisateur.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13709], "aliases": [], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "Les fonctionnalités prioritaires peuvent inclure des éléments sonores essentiels pour l'expérience utilisateur, ce qui les rend assez pertinentes pour définir une identité sonore."}, {"concept": {"id": "16094e09-b367-4d50-b2f5-72c866d3c871", "label": "Clignotement", "definition": "Le clignotement est un effet visuel où un élément de contenu s'allume et s'éteint rapidement, servant à alerter les utilisateurs, notamment ceux qui sont sourds, en signalant des notifications comme de nouveaux e-mails. Cependant, cette méthode peut poser des problèmes d'accessibilité pour certains utilisateurs, car le clignotement rapide peut être dérangeant ou difficile à percevoir.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708, 13710], "aliases": ["ad03c1a8-3fef-4b13-bf4c-2bfa25acdcee"], "wikientity": {"label": "Clignotement", "definition": "Un clignotement est l'émission d'un signal lumineux de façon périodique et selon une fréquence régulière simple.", "page_id": "3944919", "wikidata_id": "Q2979118", "content": null, "thumbnail": null, "aliases": []}, "wordnetentity": null}, "score": 7, "justification": "'Clignotement' pourrait être utilisé comme effet audio-visuel pour attirer l'attention des utilisateurs, ce qui lui donne une pertinence significative dans le cadre de l'identité sonore."}, {"concept": {"id": "a0b50738-0427-4d73-94d0-bf984abc3602", "label": "Attributs WAI-ARIA", "definition": "Les attributs WAI-ARIA sont des propriétés ajoutées aux éléments HTML pour améliorer leur accessibilité, en fournissant des informations supplémentaires sur l'état ou le comportement d'un élément. Parmi ces attributs, on trouve 'aria-label', qui fournit une étiquette textuelle explicite pour les éléments non textuels, et 'aria-labelledby', qui associe un élément à une ou plusieurs étiquettes visibles pour offrir une description contextuelle plus claire. D'autres attributs comme 'role' (par exemple, role='img') indiquent la nature de l'élément, facilitant ainsi la compréhension et l'interaction avec les technologies d'assistance telles que les lecteurs d'écran. Ensemble, ces attributs contribuent à rendre le contenu web plus accessible et compréhensible pour tous les utilisateurs.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13708], "aliases": ["4f233a3b-30e2-4237-9705-a3753e224585", "7effd084-6722-4cc5-924b-dee5d4ff431c", "f582ac37-ef14-4e5a-85da-318da5131f5a", "1c9d5a55-0f7d-4204-99c9-638b59c632b8", "d0a76c86-fced-4301-abeb-04bfbff66259", "3c192b30-517e-46d1-9a09-6d2558ab0c68", "a02d42bd-8c2b-4c73-a22a-7f014dd35da9", "0c227f65-b0e1-4aa2-9ffd-b5aa2a775f65", "084054fe-44f0-483d-bc1d-9c6587d57c84", "0fa95bc1-e964-4038-a0cb-129bb7ab4640", "25f9671e-8e5b-427a-81d7-13b0dc074c71", "88f57f01-7ecd-47a8-8377-e3e5a76ef949", "927e0840-449c-4217-bfaf-ead2f7809025", "70955ef5-7913-4ed6-aef5-80ba982a0ff8", "dcfa67c8-37c8-42e3-9b82-acdaaed438ef", "967955e3-2bbb-4c31-9f79-349723385447"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "'Attributs WAI-ARIA' améliorent l'accessibilité des éléments HTML, ce qui peut inclure des éléments sonores; leur pertinence dépend du contexte d'utilisation du son sur le site."}, {"concept": {"id": "2a8f9382-3100-45d2-a220-a41f6cbc8ac4", "label": "Perception", "definition": "La perception est la manière dont les utilisateurs interprètent et évaluent leur expérience avec un produit ou service, incluant la facilité d'interaction et de navigation sur un site web. Elle reflète l'ensemble des impressions et jugements que les utilisateurs forment en fonction de leur interaction avec l'interface, influençant ainsi leur satisfaction globale.", "lang": "fr", "ref_concept_id": null, "generative": true, "valid": null, "corpus_id": null, "doc_ids": [13710], "aliases": ["e646b586-5968-4986-ba66-5ff32bebcae4"], "wikientity": null, "wordnetentity": null}, "score": 7, "justification": "La perception joue un rôle clé dans comment les utilisateurs expérimentent l'identité sonore d'un site web, influençant leur satisfaction globale."}], "exercises": [{"exercise": {"id": "a4bf5ac2a00a43fead862ca4ecbd2405", "question": "Que doit prendre en compte le design pour être efficace dans ce contexte ?", "answers": ["L'expérience utilisateur"], "distractors": ["La création visuelle", "Les outils de design", "La performance du serveur", "La réactivité des écrans", "Le nombre d'utilisateurs", "La compatibilité mobile", "L'esthétique pure", "La taille des polices", "La gestion des cookies"], "feedback": "Dans ce contexte, il est essentiel de prendre en compte l'expérience utilisateur pour créer un design efficace. Cela signifie que le design doit être adapté aux besoins et aux attentes des utilisateurs pour leur offrir une expérience agréable et satisfaisante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de l'expérience utilisateur (UX) dans le contexte de la définition de l'identité sonore d'un site web. La question posée est pertinente car elle se concentre sur un aspect clé mentionné dans la synthèse, à savoir que le design doit optimiser les interactions entre les utilisateurs et le contenu numérique. Cependant, bien que la réponse correcte soit en lien avec l'UX, l'exercice pourrait être amélioré en intégrant des éléments spécifiques liés à l'identité sonore ou à l'accessibilité, qui sont également cruciaux selon la synthèse. Cela justifie une note élevée mais pas parfaite."}, {"exercise": {"id": "6015c7d5473a4aa6a073f4730908e579", "question": "Quand est-il nécessaire de fournir une alternative textuelle à une fonctionnalité sonore ?", "answers": ["Si la fonctionnalité sonore nécessite une explication pour certains utilisateurs"], "distractors": ["Toujours, même lorsqu'il n'y a pas de son associé à une fonctionnalité.", "Seulement si l'utilisateur utilise un écran tactile.", "Lorsque le son est activé automatiquement à chaque démarrage.", "Uniquement si la fonctionnalité sonore est très complexe à comprendre.", "Si la fonctionnalité audiophonique emploie des basses fréquences.", "Quand la fonctionnalité sonore fait partie d'une application mobile spécifique.", "Dès que l'utilisateur essaie de désactiver le son.", "Si la fonctionnalité inclut une vidéo sans sous-titres.", "Lorsqu'une condition temporelle est associée à la fonctionnalité son."], "feedback": "L'alternative textuelle est nécessaire lorsque la fonctionnalité sonore n'est pas suffisamment compréhensible pour certains utilisateurs, par exemple les personnes sourdes ou malentendantes. Cela peut être dû à la complexité du son, à l'absence d'informations visuelles associées, ou à tout autre élément rendant difficile la compréhension de la fonctionnalité pour ces utilisateurs. Fournir une alternative textuelle permet de garantir une accessibilité équivalente pour tous les utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension de l'importance de fournir des alternatives textuelles pour les fonctionnalités sonores, ce qui est directement lié à l'accessibilité, un aspect fondamental de la définition de l'identité sonore d'un site web. La question cible spécifiquement le besoin d'alternatives pour les utilisateurs ayant des limitations auditives, ce qui est en ligne avec les normes WCAG mentionnées dans la synthèse. Cependant, bien que pertinent, l'exercice pourrait être amélioré en incluant des éléments plus variés sur l'identité sonore et son intégration dans une expérience utilisateur globale. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "deab729352214406ac6c8c35c97411bb", "statement": "Le critère 7.1 permet d'assurer la compatibilité avec les technologies d'assistance en utilisant uniquement WAI-ARIA.", "veracity": false, "feedback": "Le critère 7.1 vise à garantir la compatibilité avec les technologies d'assistance, mais ne repose pas uniquement sur WAI-ARIA. Il fait aussi référence aux WCAG (Web Content Accessibility Guidelines) pour définir cette compatibilité. WAI-ARIA est une des solutions utilisées, mais pas la seule composante.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1a680aa224f54de983968257909443c2", "order": 18.0, "image_url": null, "origin_type": "document_content", "text": ". Le nom, le rôle, la valeur, le paramétrage et les changements d'états sont accessibles aux technologies d'assistance via une API d'accessibilité. Le critère 7.1 implémente la notion de « compatible avec les technologies d'assistance » tel que définie par les WCAG, ainsi que le recours à WAI-ARIA pour rendre un composant ou une fonctionnalité accessible. Le bon usage de WAI-ARIA est vérifié via les tests 7.1.1, 7.1.2, 7.1.3.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf92b5f2e30c4b72a9939e35bc21a854", "next_id": "d7efe816cb244a4884acccc33faa83a4", "prev_id": "c229b6e3dc5741aeb67f2b0851550af3", "associated_block_ids": [], "first_page": 47, "last_page": 48, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des normes d'accessibilité, en particulier le critère 7.1 qui est pertinent pour définir l'identité sonore d'un site web. Bien que l'exercice ne traite pas directement de l'identité sonore elle-même, il aborde un aspect clé de l'accessibilité qui est essentiel pour garantir une expérience utilisateur optimale. La mention des WCAG et de WAI-ARIA dans le contexte de la compatibilité avec les technologies d'assistance montre une bonne compréhension des éléments nécessaires à une conception inclusive. Cependant, il aurait été encore plus pertinent si l'exercice avait inclus des éléments spécifiques sur la manière dont ces normes influencent directement l'identité sonore."}, {"exercise": {"id": "d0cf91f720784ce79e18efb74e058a78", "statement": "Les contenus audio et vidéo publiés après le 23 septembre 2020 doivent répondre aux exigences d'accessibilité.", "veracity": true, "feedback": "Les contenus audio et vidéo, y compris ceux ayant des composants interactifs, publiés après le 23 septembre 2020 sont soumis aux exigences en matière d'accessibilité. Ceux publiés avant cette date peuvent être exemptés dans certains cas.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "b169105936c64ea5a46f3a4859ec37f9", "order": 12.0, "image_url": null, "origin_type": "document_content", "text": "2. Les contenus audio et vidéo préenregistrés, y compris ceux comprenant des composants interactifs, publiés avant le 23 septembre 2020 ; 5. Les contenus de tiers qui ne sont ni financés ni développés par l'organisme concerné et qui ne sont pas sous son contrôle ; a) Soit de l'incompatibilité des exigences en matière d'accessibilité avec la préservation de la pièce concernée ou l'authenticité de la reproduction notamment en termes de contraste ;", "short_summary": null, "long_summary": null, "title": null, "html_tag": "li", "children_ids": [], "parent_id": "ee367cc07b7f494cbdde1ee0e24336f4", "next_id": "be93f82627334ecd846946f1446fba26", "prev_id": "ef3ca7b7978c41c0aa9cb985a1c1a5b9", "associated_block_ids": [], "first_page": 6, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des exigences d'accessibilité liées aux contenus audio et vidéo, ce qui est un aspect fondamental de l'identité sonore d'un site web. La référence mentionne explicitement l'importance de l'accessibilité et des normes telles que les WCAG pour garantir que tous les utilisateurs puissent interagir avec le contenu audio-vidéo. L'affirmation testée dans l'exercice est pertinente car elle touche directement à ces exigences, bien qu'elle ne couvre pas tous les aspects de la définition de l'identité sonore. Cependant, elle reste très liée au sujet principal, justifiant ainsi une note élevée."}, {"exercise": {"id": "3506bc0fa73340f583a57133ef4e98ff", "question": "Quelle solution WCAG juge acceptable pour faciliter l'accès des vidéos aux personnes aveugles ?", "answers": ["Offrir une version sonore en alternative à la vidéo"], "distractors": ["Ajouter des sous-titres à la vidéo", "Simplifier uniquement le contenu visuel de la vidéo", "Proposer des effets sonores supplémentaires", "Transcrire toutes les conversations en temps réel", "Utiliser la description vocale dans un deuxième fichier vidéo", "Convertir la vidéo en images séquentielles", "Créer des animations avec bruitages ajoutés", "Créer un doublage audio avec un narrateur", "Remplacer totalement la vidéo par un texte explicatif"], "feedback": "La version sonore en alternative permet aux personnes aveugles d'accéder aux informations audio de la vidéo. Les autres propositions ne sont pas aussi efficaces que la transcription textuelle qui assure un accès universel à toutes les informations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d7a5b4bd76ef4e1ea6681ca21cac0834", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Une version « audio seulement » est une version sonore, sous la forme d'un simple fichier au format MP3 par exemple, utilisée comme alternative à une vidéo seulement (vidéo sans information sonore). Les seuls utilisateurs impactés par l'accessibilité étant les personnes aveugles, qui ne peuvent pas voir la vidéo, WCAG considère comme acceptable de proposer en alternative une version sonore. Généralement il est plus simple de produire une version sonore qu'une version textuelle lorsque la vidéo est très descriptive (la transcription textuelle nécessitant souvent un travail rédactionnel important). Il est rappelé, néanmoins, que seule la transcription textuelle assure un accès universel aux informations diffusées par la vidéo, dans le cas où un utilisateur ne serait pas en capacité de lancer la vidéo par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "911c7f9e9410478494ef0d3b3fa9ad62", "next_id": "4cec0185030d446d9395eb59623a4ece", "prev_id": "09180f02f56a4efd9e2bc339b428d1fc", "associated_block_ids": [], "first_page": 124, "last_page": 124, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice évalue la compréhension des solutions d'accessibilité pour les personnes aveugles en lien avec l'identité sonore d'un site web, ce qui est un aspect clé de la référence. La question cible spécifiquement les normes WCAG et leur application dans le contexte de l'accès aux vidéos, ce qui est pertinent par rapport à la synthèse fournie. Cependant, bien que la réponse correcte soit pertinente, elle ne couvre pas entièrement tous les aspects de l'identité sonore mentionnés dans la référence, comme l'importance de l'expérience utilisateur globale ou des éléments sonores adaptés. Cela justifie une note légèrement inférieure à 10."}, {"exercise": {"id": "bd33333d206847669c1b3ea4a0d415ad", "query": "Selon les recommandations pour l'accessibilité, une version <blank> est jugée acceptable comme alternative à une vidéo sans information sonore.", "answers": ["sonore"], "distractors": [["graphiquement simplifiée", "interactive", "sous-titrée", "textuelle améliorée", "animée", "en langue des signes"]], "feedback": "Une version sonore est considérée adéquate pour les utilisateurs ayant une déficience visuelle, car elle permet de transmettre les informations en l'absence d'éléments visuels. Les autres options ne constituent pas une alternative efficace à une vidéo sans son pour atteindre cet objectif.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "d7a5b4bd76ef4e1ea6681ca21cac0834", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Une version « audio seulement » est une version sonore, sous la forme d'un simple fichier au format MP3 par exemple, utilisée comme alternative à une vidéo seulement (vidéo sans information sonore). Les seuls utilisateurs impactés par l'accessibilité étant les personnes aveugles, qui ne peuvent pas voir la vidéo, WCAG considère comme acceptable de proposer en alternative une version sonore. Généralement il est plus simple de produire une version sonore qu'une version textuelle lorsque la vidéo est très descriptive (la transcription textuelle nécessitant souvent un travail rédactionnel important). Il est rappelé, néanmoins, que seule la transcription textuelle assure un accès universel aux informations diffusées par la vidéo, dans le cas où un utilisateur ne serait pas en capacité de lancer la vidéo par exemple.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "911c7f9e9410478494ef0d3b3fa9ad62", "next_id": "4cec0185030d446d9395eb59623a4ece", "prev_id": "09180f02f56a4efd9e2bc339b428d1fc", "associated_block_ids": [], "first_page": 124, "last_page": 124, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 8, "justification": "L'exercice proposé évalue la compréhension des recommandations d'accessibilité en lien avec l'identité sonore d'un site web, ce qui est un aspect clé de la référence. En demandant aux apprenants de compléter le texte à trou avec le terme 'sonore', l'exercice teste leur connaissance sur les alternatives acceptables pour les utilisateurs ayant des limitations auditives ou visuelles. Cependant, il pourrait être amélioré en intégrant davantage d'éléments liés à l'expérience utilisateur (UX) et à la conception sonore dans son ensemble, plutôt que de se concentrer uniquement sur une alternative spécifique. Cela dit, il reste pertinent et bien aligné avec les objectifs d'apprentissage."}, {"exercise": {"id": "c7bfc2ca1b974d1681e04e56abcb83d3", "statement": "Les fonctions les plus importantes d'une interface doivent être représentées de manière plus visible pour prioriser leur usage.", "veracity": true, "feedback": "Pour offrir une meilleure expérience à l'utilisateur, les fonctionnalités prioritaires doivent être conçues de manière à attirer l'attention, notamment en augmentant leur taille ou en les rapprochant, ce qui est en cohérence avec les principes de la loi de Fitts.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "3573715488034959b33de4a92fcd9dca", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": "La loi de Fitts permet d'évaluer mathématiquement le temps de pointage nécessaire pour un utilisateur. Cette durée varie selon la taille de l'élément à pointer et selon sa distance. L'emplacement et la taille indiquent la priorité attribuée à chaque fonctionnalité d'une interface : les fonctions les plus importantes devront donc être représentées de manière plus impactantes pour l'utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "9c8748f88f454e74b6ad75f1eb5d7e62", "next_id": "36cc65565321412d89edd695d99fdef7", "prev_id": "84b73c7a6cfe45b8acd1b20a04159615", "associated_block_ids": [], "first_page": 11, "last_page": 11, "start_time": null, "end_time": null, "doc_id": 13709, "doc_label": "ERGONOMIE - Lois de uX WSB", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des principes de conception d'interface utilisateur (UI) en lien avec l'expérience utilisateur (UX), ce qui est pertinent pour définir l'identité sonore d'un site web. En effet, une interface bien conçue contribue à une meilleure interaction avec les éléments sonores et multimédias. Cependant, l'exercice ne traite pas directement de l'identité sonore ou des aspects spécifiques liés à l'intégration sonore dans le design, ce qui limite sa pertinence. Il aurait été plus efficace s'il avait inclus des éléments relatifs à la gestion du son ou à l'accessibilité audio, qui sont également cruciaux dans le contexte donné."}, {"exercise": {"id": "237d060ac8a04e529f583f5e1347fc67", "statement": "Le terme 'design' dans ce contexte signifie principalement 'création visuelle'.", "veracity": false, "feedback": "Le terme 'design' ici fait référence davantage à la 'conception', c'est-à-dire à la manière dont les éléments sont pensés et organisés pour l'expérience utilisateur, plutôt qu'à la simple création d'éléments visuels comme des formes ou des illustrations.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension du terme 'design' dans le contexte de l'identité sonore d'un site web, ce qui est pertinent par rapport à la référence. Il souligne que le design ne se limite pas à la création visuelle, mais englobe également des aspects liés à l'expérience utilisateur (UX) et à l'organisation des éléments sonores. Cependant, l'exercice pourrait être amélioré en intégrant des questions plus directement liées aux concepts spécifiques de l'identité sonore ou de l'accessibilité mentionnés dans la synthèse, afin d'évaluer plus largement la maîtrise des compétences clés."}, {"exercise": {"id": "44a1cb1994f54733b945e6d994952d37", "question": "Quelle méthode garantit l'accessibilité des fonctionnalités par défaut ?", "answers": ["La touche de tabulation doit permettre d'accéder à chaque fonctionnalité"], "distractors": ["Les fonctionnalités doivent être accessibles uniquement par une commande vocale.", "Toutes les fonctionnalités doivent être activées automatiquement sans intervention.", "L'accès aux fonctionnalités ne peut se faire que via la souris.", "Les utilisateurs doivent installer un logiciel tiers pour accéder aux fonctions.", "Seuls les utilisateurs avancés peuvent personnaliser l'accessibilité.", "Il faut activer un mode spécial pour accéder aux fonctionnalités.", "L'accessibilité ne doit pas être priorisée pour les dispositifs mobiles.", "Les fonctionnalités n'ont pas besoin d'être accessibles sans support visuel.", "Un code d'accès est nécessaire pour chaque fonctionnalité."], "feedback": "La touche de tabulation est une méthode largement utilisée pour naviguer rapidement entre les différentes fonctionnalités d'un système informatique. En garantissant l'accès des fonctionnalités par cette touche, on assure une accessibilité intuitive et pratique pour tous les utilisateurs, indépendamment de leur dispositif de pointage ou de leurs capacités physiques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des principes d'accessibilité, qui est un aspect fondamental de la définition de l'identité sonore d'un site web. La question sur la méthode garantissant l'accessibilité des fonctionnalités par défaut est pertinente car elle touche à l'importance de rendre les éléments interactifs accessibles à tous les utilisateurs, y compris ceux ayant des limitations. Cependant, bien que cela soit en lien avec le sujet, l'exercice ne teste pas directement la capacité à définir ou concevoir une identité sonore spécifique pour un site web. Il aurait pu être amélioré en intégrant des éléments plus directement liés à l'identité sonore ou aux interactions sonores dans le contexte UX/UI."}, {"exercise": {"id": "25fceaccd6604787b236e3b8ee677194", "statement": "Les tests de compatibilité avec l'accessibilité sont réalisés uniquement sur les navigateurs.", "veracity": false, "feedback": "Les tests de compatibilité avec l'accessibilité sont effectués en utilisant une combinaison de plusieurs facteurs : la technologie d'assistance, le système d'exploitation et le navigateur. Ce n'est donc pas limité aux seuls navigateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "babebf0e5f764a16b8bfe86e55f54be3", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Zone contenant les principaux contenus de la page, là où se trouvent les informations et fonctionnalités de fond (donc en dehors des menus, de la recherche ou des zones secondaires de publicités, actualités connexes ... ). Les tests effectués selon ces combinaisons (technologie d'assistance, système d'exploitation, navigateur) permettent de déclarer qu'un dispositif HTML / WAI-ARIA est compatible avec l'accessibilité tel que défini par WCAG. Les combinaisons ont été établies à partir de la liste des technologies d'assistance dont l'usage est suffisamment répandu, ou, dans certains cas lorsqu'elle est fournie de manière native et constitue le moyen privilégié d'accès à l'information et aux fonctionnalités.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "next_id": "5969ad50d6c645599081e11fc2ed299d", "prev_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "associated_block_ids": [], "first_page": 125, "last_page": 126, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des principes d'accessibilité, qui est un aspect fondamental de la définition de l'identité sonore d'un site web. En effet, l'accessibilité est mentionnée dans la synthèse comme étant essentielle pour garantir que tous les utilisateurs puissent interagir avec le contenu audio-vidéo. Cependant, l'exercice se concentre principalement sur un aspect technique (les tests de compatibilité) plutôt que sur la manière dont ces tests s'intègrent dans une approche globale de conception UX et d'identité sonore. Bien qu'il soit pertinent, il pourrait être amélioré en incluant des éléments plus directement liés à l'identité sonore elle-même."}, {"exercise": {"id": "458dffabe57e43d784bad2274d28e806", "statement": "L'utilisateur doit pouvoir accéder à toutes les fonctionnalités par la touche tabulation ou par un dispositif de pointage.", "veracity": true, "feedback": "Toutes les fonctionnalités doivent être accessibles soit via le clavier (notamment avec la touche de tabulation), soit via un dispositif de pointage, garantissant ainsi l'accessibilité pour différents types d'utilisateurs.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension de l'accessibilité, qui est un aspect fondamental dans la définition de l'identité sonore d'un site web. En effet, il souligne l'importance d'assurer que toutes les fonctionnalités soient accessibles à tous les utilisateurs, ce qui est en ligne avec les normes WCAG mentionnées dans la synthèse. Cependant, bien que pertinent, cet exercice ne couvre pas directement le concept d'identité sonore lui-même ni son intégration dans l'expérience utilisateur ou l'interface utilisateur. Il aurait été plus efficace s'il avait inclus des éléments spécifiques relatifs à la conception sonore ou à son impact sur l'expérience utilisateur."}, {"exercise": {"id": "09e590cf9ee14919a90129f274ef7f25", "statement": "Un dispositif HTML / WAI-ARIA est accessible tant qu'il fonctionne en partie sur quelques combinaisons possibles.", "veracity": false, "feedback": "Pour qu'un dispositif HTML / WAI-ARIA soit considéré comme compatible avec l'accessibilité, il doit être pleinement fonctionnel sur au moins une des combinaisons possibles, à la fois en termes de restitution et de fonctionnalités. Fonctionner partiellement n'est pas suffisant selon les critères d'accessibilité.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "50384ab878cc46aaa9770e4787713ef1", "order": 3.0, "image_url": null, "origin_type": "document_content", "text": "Lorsque le site ou l'application est destiné à un public dont l'équipement est maîtrisé, les tests devront se faire sur un environnement de test adapté au contexte de l'environnement maîtrisé. Pour qu'un dispositif HTML / WAI-ARIA ou son alternative soit considéré comme compatible avec l'accessibilité, il faut qu'il soit pleinement fonctionnel, en termes de restitution et de fonctionnalités, sur au moins une des combinaisons suivantes.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "08c039f815324ddbbb4e4862fc8a567c", "next_id": "cc0ff2c3f0344003a5cc7179dda8ddee", "prev_id": "c0977b1d6d5340d5a8fd2e76376c64b8", "associated_block_ids": [], "first_page": 126, "last_page": 126, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des normes d'accessibilité, en particulier celles liées aux dispositifs HTML/WAI-ARIA, qui sont mentionnées dans la synthèse. Bien que l'exercice ne teste pas directement la définition de l'identité sonore d'un site web, il aborde un aspect crucial de l'expérience utilisateur (UX) et de l'accessibilité, qui sont des éléments clés pour créer une identité sonore efficace. Cependant, il aurait été plus pertinent de poser une question directement liée à l'intégration sonore ou à son impact sur l'UX pour obtenir un score plus élevé."}, {"exercise": {"id": "1ba4425f80644e4d849adddc32277d74", "statement": "Le média temporel doit impérativement être accompagné de sous-titres synchronisés pour qu'un contenu soit accessible.", "veracity": false, "feedback": "Un média temporel n'a pas obligatoirement besoin de sous-titres synchronisés si des alternatives comme une transcription textuelle ou une audiodescription sont fournies. Le but est d'assurer que le contenu soit compréhensible par tous, mais il existe plusieurs moyens pour y parvenir, dont les sous-titres ne sont qu'une option parmi d'autres.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "50e8317399074680989db76837f477f0", "order": 20.0, "image_url": null, "origin_type": "document_content", "text": "· Le média temporel est lui-même une alternative à un contenu de la page (une vidéo en langue des signes ou la vocalisation d'un texte, par exemple) ; · Le média temporel fait partie d'un test qui deviendrait inutile si la transcription textuelle, les sous-titres synchronisés ou l'audiodescription étaient communiqués ; · Pour les services de l'État, les collectivités territoriales et leurs établissements : si le média temporel a été publié entre le 23 septembre 2019 et le 23 septembre 2020 sur un site internet, intranet ou extranet créé depuis le 23 septembre 2018, il est exempté de l'obligation d'accessibilité ;", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "20c625cf818d4f95b9da1107913afa57", "next_id": "995995fbf456448da0187dad9dc03420", "prev_id": "9d8567ef1ece4fa89303fdd3497cfc81", "associated_block_ids": [], "first_page": 36, "last_page": 36, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice aborde un aspect clé de l'accessibilité dans le contexte de l'identité sonore d'un site web, en se concentrant sur les médias temporels et les alternatives aux sous-titres. Cela est pertinent car la synthèse souligne l'importance de rendre le contenu accessible à tous, y compris ceux ayant des limitations auditives ou visuelles. Cependant, bien que l'exercice teste la compréhension des alternatives aux sous-titres, il ne couvre pas directement la définition de l'identité sonore ni son intégration dans une expérience utilisateur globale. Par conséquent, il est pertinent mais pas entièrement centré sur le concept principal de la référence."}, {"exercise": {"id": "e4712a6d8f1847a4b6e28eb2985324b9", "question": "Que faut-il évaluer pour la pertinence du « nom accessible » du bouton?", "answers": ["Le passage de texte référencé par aria - labelledby"], "distractors": ["Le titre du bouton uniquement.", "Uniquement la balise aria-Label.", "Le code source HTML du bouton.", "Les propriétés CSS associées au bouton.", "Le style et l'apparence visuelle du bouton.", "La position du bouton sur la page.", "Le texte alternatif défini pour le bouton.", "Les attributs HTML globaux liés au bouton.", "Le contenu textuel global de la page web."], "feedback": "Pour évaluer la pertinence du « nom accessible » du bouton, il faut prendre en compte le passage de texte référencé par aria-labelledby, qui doit primer sur le titre du bouton. Cela permet de garantir une étiquette pertinente pour les utilisateurs d'outils d'assistance tels que les lecteurs d'écran.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "109826c4006248009b08298ed8ecd2e1", "order": 21.0, "image_url": null, "origin_type": "document_content", "text": "Cet ordre doit être utilisé pour l'évaluation de la pertinence du « nom accessible » du bouton. Par exemple, même dans le cas de la présence d'un tit le et d'un passage de texte référencé par aria- Label ledby sur le même bouton, c'est le passage de texte référencé par aria - labelledby qui doit être évalué.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "017e9855f379424d84d4b749df0647f2", "next_id": "ebd60112bd9c4f00ab14e510a00dd39d", "prev_id": "40edac9b3d134871a56019ae05da60b3", "associated_block_ids": [], "first_page": 89, "last_page": 89, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 7, "justification": "L'exercice évalue la compréhension des attributs d'accessibilité, en particulier l'utilisation de 'aria-labelledby' pour définir le nom accessible d'un bouton. Cela est pertinent dans le contexte de l'identité sonore d'un site web, car une bonne accessibilité est essentielle pour garantir que tous les utilisateurs, y compris ceux utilisant des technologies d'assistance, puissent interagir efficacement avec le contenu audio-vidéo. Cependant, l'exercice pourrait être amélioré en intégrant davantage d'éléments liés à la conception de l'identité sonore et à son impact sur l'expérience utilisateur globale, ce qui lui empêche d'obtenir un score plus élevé."}, {"exercise": {"id": "c76032a02e6a4f45976fee77342cf113", "statement": "Le design doit inclure l'expérience utilisateur pour être efficace.", "veracity": true, "feedback": "Dans le domaine du design d'expérience, il est souligné que le design n'a de sens que s'il intègre l'expérience utilisateur dans sa conception. Ne pas considérer cet aspect rendrait la conception inefficace.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c43e1064b5a24a2f84898ee7a8d94333", "order": 7.0, "image_url": null, "origin_type": "document_content", "text": "Ces différents appareils ont des largeurs fixes et connues qui sont utilisées pour définir les largeurs spécifiques auxquelles s'adaptera le site. Le design doit provoquer l'expérience, la bonne expérience utilisateur. Il faut comprendre que dans ce contexte, le design ne défini pas seulement prendre le pinceau sur Photoshop et faire un carré. Ici, le terme « design » est plus synonyme de « conception » et non plus de « création visuelle ». Dans le domaine du design d'expérience, le design, seul, n'est rien s'il ne prend pas en compte l'expérience utilisateur.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "1552d49a801041d986600085dc94a831", "next_id": "be4d0550522445c0b98dc638e88ad06b", "prev_id": "fe3b737ab67f41d192d8c4356ff1c7f7", "associated_block_ids": [], "first_page": 199, "last_page": 201, "start_time": null, "end_time": null, "doc_id": 13609, "doc_label": "_YNOV CONNECT_Mobil Marketing, user acquisition & modèles économique_B3 –Commun Marcom", "corpus_id": 637, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect clé de la référence, à savoir l'importance de l'expérience utilisateur (UX) dans le design. Cependant, il ne teste pas directement la compréhension des éléments spécifiques liés à l'identité sonore d'un site web, comme les éléments sonores adaptés ou les normes d'accessibilité. Bien qu'il soit pertinent dans le contexte général du design et de l'UX, il manque une connexion directe avec les concepts spécifiques mentionnés dans la synthèse concernant l'identité sonore et son impact sur l'interaction utilisateur. Une note de 6 reflète cette pertinence partielle."}, {"exercise": {"id": "1419f7539bfc4cddab1dec25b459552b", "statement": "Les Règles pour l'accessibilité des contenus Web (WCAG) 2.0 visent à rendre les contenus Web accessibles aux personnes en situation de handicap.", "veracity": true, "feedback": "C'est exact. Les WCAG 2.0 ont pour but de définir des méthodes pour rendre les contenus Web plus accessibles aux personnes ayant divers types de handicaps.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c70b8f193fbe4b059d4f4438eebfc40c", "order": 4.0, "image_url": null, "origin_type": "document_content", "text": "Opquast (Open Quality Standards) a pour objectif d'améliorer la qualité des services en ligne grâce des check-lists (226 bonnes pratiques) sous licence ouverte (Creative Commons BY-SA) et des outils validés et utilisés par une large communauté de professionnels du web. Les Règles pour l'accessibilité des contenus Web (WCAG) 2.0 définissent la façon de rendre les contenus Web plus accessibles aux personnes en situation de handicap", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "e84573ff412c46ae9983afed596faca0", "next_id": "0ffc552290bd48fcaf2a1f0ab168f84c", "prev_id": "d5f2445ab17f4033bfdb9e027e3a6609", "associated_block_ids": [], "first_page": 51, "last_page": 52, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la connaissance des WCAG 2.0, qui est un aspect important de l'accessibilité dans la définition de l'identité sonore d'un site web. Cependant, il ne teste pas directement la compréhension des concepts clés liés à l'identité sonore elle-même, comme l'intégration des éléments sonores ou leur impact sur l'expérience utilisateur. Bien que pertinent pour le contexte d'accessibilité, il manque une connexion directe avec les autres éléments essentiels mentionnés dans la référence."}, {"exercise": {"id": "2ff72267ec8041dcbde6e12c2edb44cc", "statement": "Les dispositifs HTML/WAI-ARIA doivent respecter les normes d'accessibilité définies par WCAG.", "veracity": true, "feedback": "Les dispositifs HTML/WAI-ARIA, afin d'assurer une meilleure accessibilité pour les utilisateurs, doivent bien respecter les directives du WCAG (Web Content Accessibility Guidelines), qui fournissent des standards d'accessibilité pour le web.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "babebf0e5f764a16b8bfe86e55f54be3", "order": 5.0, "image_url": null, "origin_type": "document_content", "text": "Zone contenant les principaux contenus de la page, là où se trouvent les informations et fonctionnalités de fond (donc en dehors des menus, de la recherche ou des zones secondaires de publicités, actualités connexes ... ). Les tests effectués selon ces combinaisons (technologie d'assistance, système d'exploitation, navigateur) permettent de déclarer qu'un dispositif HTML / WAI-ARIA est compatible avec l'accessibilité tel que défini par WCAG. Les combinaisons ont été établies à partir de la liste des technologies d'assistance dont l'usage est suffisamment répandu, ou, dans certains cas lorsqu'elle est fournie de manière native et constitue le moyen privilégié d'accès à l'information et aux fonctionnalités.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "next_id": "5969ad50d6c645599081e11fc2ed299d", "prev_id": "6993b499a7e14216a9a0b8fcc1e6fb78", "associated_block_ids": [], "first_page": 125, "last_page": 126, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des normes d'accessibilité, qui est un aspect fondamental de la définition de l'identité sonore d'un site web. Cependant, il se concentre principalement sur les dispositifs HTML/WAI-ARIA et leur conformité aux WCAG, sans aborder directement l'identité sonore ou son impact sur l'expérience utilisateur. Bien qu'il soit pertinent dans le contexte plus large de l'accessibilité, il ne teste pas spécifiquement les concepts clés liés à la création d'une identité sonore efficace pour un site web."}, {"exercise": {"id": "3bd3b0916e0042d8bb5fbfb2302b323d", "statement": "Un événement déclenché uniquement sur la prise de focus permet de satisfaire le critère de contrôle du contenu en mouvement ou clignotant.", "veracity": false, "feedback": "L'événement déclenché uniquement sur la prise de focus ne permet pas de valider le critère car l'utilisateur doit pouvoir interagir avec le reste de la page sans dépendre de l'état de focus d'un élément pour contrôler le mouvement ou le clignotement du contenu.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "9631bb6a88994278893e8f530e0e4fbe", "order": 6.0, "image_url": null, "origin_type": "document_content", "text": "Note 2 : la méthode de contrôle du contenu en mouvement ou clignotant doit permettre à l'utilisateur d'interagir avec le reste de la page. En conséquence, l'arrêt ou la mise en pause via un événement déclenché uniquement sur la prise de focus ne permet pas de valider le critère. Note 3 : Dans certains cas, le mouvement fait partie intégrante du composant et il n'est pas possible d'en donner le contrôle à l'utilisateur, par exemple une barre de progression dont la fonction est d'indiquer par un mouvement la progression d'un évènement comme un téléchargement. Dans ce cas le critère est Non Applicable.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "88850052c4aa4836a5814abede872408", "prev_id": "fc20bab85f644c6b9ea6662aea9e5fdd", "associated_block_ids": [], "first_page": 96, "last_page": 96, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'accessibilité, qui est mentionné dans la synthèse, notamment en ce qui concerne le contrôle du contenu audio-vidéo. Cependant, il ne teste pas directement la compréhension de l'identité sonore d'un site web ni son intégration dans l'expérience utilisateur. L'affirmation porte sur un détail technique lié à l'interaction avec des éléments de la page plutôt qu'à la définition ou à la création d'une identité sonore. Bien que pertinent pour le sujet de l'accessibilité, cet exercice pourrait être amélioré en se concentrant davantage sur les concepts clés liés à l'identité sonore et à son impact sur l'expérience utilisateur."}, {"exercise": {"id": "4396af018b6d4961ab80c30686353afb", "statement": "Les tests 7.1.1, 7.1.2, et 7.1.3 sont utilisés pour vérifier le bon usage de WAI-ARIA.", "veracity": true, "feedback": "Ces tests, mentionnés dans le critère 7.1, sont spécifiquement conçus pour s'assurer que l'utilisation de WAI-ARIA se fait correctement afin d'améliorer l'accessibilité des composants ou fonctionnalités.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "1a680aa224f54de983968257909443c2", "order": 18.0, "image_url": null, "origin_type": "document_content", "text": ". Le nom, le rôle, la valeur, le paramétrage et les changements d'états sont accessibles aux technologies d'assistance via une API d'accessibilité. Le critère 7.1 implémente la notion de « compatible avec les technologies d'assistance » tel que définie par les WCAG, ainsi que le recours à WAI-ARIA pour rendre un composant ou une fonctionnalité accessible. Le bon usage de WAI-ARIA est vérifié via les tests 7.1.1, 7.1.2, 7.1.3.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "bf92b5f2e30c4b72a9939e35bc21a854", "next_id": "d7efe816cb244a4884acccc33faa83a4", "prev_id": "c229b6e3dc5741aeb67f2b0851550af3", "associated_block_ids": [], "first_page": 47, "last_page": 48, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la connaissance des tests WAI-ARIA, qui sont effectivement liés à l'accessibilité, un aspect fondamental de l'identité sonore d'un site web. Cependant, il ne couvre pas directement la définition de l'identité sonore elle-même ni son intégration dans le design UX ou UI. Bien que pertinent pour le sujet de l'accessibilité, cet exercice ne teste pas suffisamment les concepts clés relatifs à la création d'une identité sonore efficace et à son impact sur l'expérience utilisateur globale."}, {"exercise": {"id": "97024cd133a447e3a0958df90bae8beb", "statement": "Les normes internationales d'accessibilité numérique exigent que les contenus web répondent uniquement aux critères de succès de niveau simple A (A) des WCAG 2.1.", "veracity": false, "feedback": "Les normes internationales en matière d'accessibilité numérique exigent que les contenus web répondent aux critères de succès des niveaux simple A (A) et double A (AA) des WCAG 2.1, et non seulement au niveau simple A (A).", "difficulty": "unknown", "concepts": [], "sources": [{"id": "2c3c3aa286694ef49c1694da6568fce2", "order": 9.0, "image_url": null, "origin_type": "document_content", "text": "Pour les personnes mentionnées au 4° du I de l'article 47 qui font le choix de se référer aux normes internationales en matière d'accessibilité numérique, leurs contenus et services web doivent en conséquence satisfaire aux critères de succès des Règles pour l'accessibilité des contenus Web (WCAG) 2.1 de niveau simple A (A) et double A (AA).", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "af33fef0fe3b4477ba123292fd7efbbe", "next_id": "341f2d8f9108461da3b90b38375817da", "prev_id": "fd7e750ee1164c8bb45d42f99bc1ac2f", "associated_block_ids": [], "first_page": 7, "last_page": 7, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'identité sonore d'un site web, à savoir l'accessibilité, en se référant aux normes WCAG. Cependant, il ne teste pas directement la compréhension des concepts clés liés à la définition de l'identité sonore ou à son intégration dans une expérience utilisateur optimisée. Bien qu'il soit pertinent pour le contexte d'accessibilité, il manque d'une connexion plus directe avec les éléments sonores et leur impact sur l'expérience utilisateur. Une évaluation plus ciblée sur la conception sonore elle-même aurait été plus appropriée."}, {"exercise": {"id": "96de6341e9db41a78edad0d40b97ea6e", "question": "Quel est l'un des avantages à améliorer l'accessibilité d'un site web ?", "answers": ["Augmenter le trafic et les conversions du site"], "distractors": ["Réduire le coût de maintenance du site web", "Améliorer seulement l'expérience des utilisateurs experts", "Aider à réduire la consommation d'énergie des serveurs", "Optimiser uniquement le temps de chargement des pages", "Rendre invisible tout contenu non pertinent sur le site", "Permettre uniquement un meilleur classement SEO", "Simplifier la mise en conformité légale avec l'UE", "Convertir automatiquement le texte en images pour plus de clarté", "Introduire une section de FAQ dynamique sans intervention humaine"], "feedback": "En augmentant l'accessibilité de votre site web, vous pouvez attirer plus de visiteurs et augmenter les chances de conversion. Cela peut également améliorer l'expérience globale des utilisateurs et conduire à une meilleure réputation pour le site.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "f01a6f77ea7544e7bbf3433c675fb43f", "order": 0.0, "image_url": null, "origin_type": "document_content", "text": "VPTCS est un modèle conceptuel. Il est une représentation simplifiée et partielle de la réalité. Il peut être utilisé pour comprendre, organiser, mesurer et prédire. Améliorer l'accessibilité de votre site web vous permettra de toucher un public plus large, d'augmenter le trafic et les conversions sur votre site. Il faut toujours être conscient qu'entre 15% et 20% de la population souffrent d'un handicap, d'une forme ou d'une autre : handicap visuel, auditif, moteur ... Ne pas travailler sur l'accessibilité web de son site, c'est se priver de millions de visiteurs potentiels.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "c6b09b51521f4a2ca1875160528ca4d9", "next_id": "4c3fedc6aa2645618db9b4a504423dda", "prev_id": null, "associated_block_ids": [], "first_page": 25, "last_page": 43, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'identité sonore d'un site web, à savoir l'accessibilité, qui est mentionnée dans la synthèse. Cependant, la question se concentre principalement sur les avantages économiques (augmentation du trafic et des conversions) plutôt que sur les éléments spécifiques liés à l'identité sonore ou à l'expérience utilisateur. Bien qu'il soit pertinent de discuter de l'accessibilité dans le contexte de la conception UX, l'exercice ne teste pas directement la compréhension des concepts clés relatifs à l'identité sonore elle-même. Une meilleure évaluation aurait pu inclure des questions plus ciblées sur comment les éléments sonores peuvent améliorer l'accessibilité ou influencer l'expérience utilisateur."}, {"exercise": {"id": "44b926d2b3d3403bbde2d6bf4f227f36", "statement": "Toute fonctionnalité d'un média temporel doit toujours inclure une option d'activation ou de désactivation du son.", "veracity": false, "feedback": "Il n'est pas obligatoire d'inclure une option d'activation ou de désactivation du son s'il n'y a pas de son dans le média temporel. Cependant, si une telle fonctionnalité est présente, elle doit être compréhensible pour tous les utilisateurs, y compris ceux ayant besoin d'une alternative textuelle.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "8146b02a58c946caa252627614c67aff", "order": 17.0, "image_url": null, "origin_type": "document_content", "text": "· Chaque fonctionnalité doit être accessible par le clavier, via la touche de tabulation, et par tout dispositif de pointage au moins. Note : s'il n'y a pas de son à un média temporel, il n'est pas utile de mettre une fonctionnalité d'activation / désactivation du son. Si cette fonctionnalité est cependant présente et qu'elle nécessite une alternative textuelle pour être comprise par certains utilisateurs, il faut alors lui en donner une puisque l'utilisateur est susceptible d'y accéder et de vouloir l'activer.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "421c13ac8d3d4685bf654bada4f15ee7", "next_id": "5924b474b8af448b833048238dea8a11", "prev_id": "0ba254bb72f44ed780bb4293912e8c28", "associated_block_ids": [], "first_page": 96, "last_page": 97, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde un aspect important de l'identité sonore d'un site web, en se concentrant sur la nécessité d'inclure des options de contrôle du son pour les utilisateurs. Cela fait écho à la notion d'accessibilité mentionnée dans la synthèse, qui souligne l'importance de permettre aux utilisateurs d'adapter leur expérience. Cependant, l'affirmation et son explication ne couvrent pas entièrement les autres dimensions essentielles de l'identité sonore, comme l'intégration des éléments sonores adaptés ou le rôle de l'UX design. Par conséquent, bien que pertinent, cet exercice n'évalue pas tous les aspects clés de la référence."}, {"exercise": {"id": "7af5237a7a3843488b590b37b4f9161f", "statement": "Une personne malentendante doit recevoir des informations uniquement visuelles pour être avertie de l'arrivée d'un nouvel email sur Mac OS X.", "veracity": false, "feedback": "Il est faux de dire que les personnes malentendantes sont limitées à des informations uniquement visuelles. En réalité, elles disposent de l'option de demander à ce que leur écran clignote lorsqu'un nouvel email arrive, fournissant ainsi une aide visuelle spécifique dans les paramètres du système.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "c04f7fd09a104eb4bfdcd04755d39c9c", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Agrandissement : Une personne malvoyante utilisera un programme d'agrandissement (Cela signifie une perte de vue d'ensemble). Possibilité de changement de couleur d'affichage pour augmenter le contraste ou agrandir le pointeur de la souris et éventuellement l'afficher dans une couleur différente. Clignotement : Les ordinateurs donnent parfois des informations auditives comme un signal sonore lorsqu'il y a une nouvel e-mail. Une personne sourde ou malentendante peut, dans les préférences du système Mac OS X, demander que l'écran clignote lorsqu'un nouvel email arrive.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "2f326cab717442eaa4882e12c2df55d7", "next_id": "10bf5573e4ba41e389df2dc545444829", "prev_id": "2f326cab717442eaa4882e12c2df55d7", "associated_block_ids": [], "first_page": 45, "last_page": 45, "start_time": null, "end_time": null, "doc_id": 13710, "doc_label": "QUALITE-WEB-_C1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice aborde la question de l'accessibilité, qui est un aspect fondamental dans la définition de l'identité sonore d'un site web. Il met en lumière les options disponibles pour les personnes malentendantes, ce qui est pertinent par rapport à la synthèse fournie. Cependant, l'exercice se concentre principalement sur une fonctionnalité spécifique d'un système d'exploitation (Mac OS X) plutôt que sur des concepts plus larges liés à l'identité sonore et à l'expérience utilisateur dans le contexte du design sonore d'un site web. Ainsi, bien qu'il soit pertinent, il ne couvre pas entièrement les objectifs d'apprentissage liés à la conception de l'identité sonore."}, {"exercise": {"id": "902475e3bf1e4ad2b1d78bd924a67552", "question": "Que faire si un rôle WAI-ARIA n'est pas bien supporté ?", "answers": ["Utiliser une alternative avec un comportement similaire"], "distractors": ["Retirer le rôle sans remplacement", "Ignorer l'accessibilité", "Éviter d'utiliser WAI-ARIA", "Remplacer par CSS personnalisé", "Ajouter du contenu visuel supplémentaire", "Appliquer un style visuel distinct", "Désactiver le rôle dans certains cas", "Réduire le nombre de rôles", "Réduire la complexité du design"], "feedback": "Si un rôle WAI-ARIA n'est pas bien supporté, il est important d'utiliser une alternative avec un comportement similaire afin de maintenir l'accessibilité du contenu pour tous les utilisateurs. Cela peut être fait en remplaçant le rôle ou la propriété problématique par un autre équivalent qui offrira un résultat similaire. Ignorer l'accessibilité ou retirer le rôle sans remplacement peuvent causer des problèmes pour les utilisateurs ayant des besoins spécifiques.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "02ba2df188fc4e9ca3655e8098361f88", "order": 13.0, "image_url": null, "origin_type": "document_content", "text": "· Respecter la structure générale : par exemple un ensemble de panneaux (rôle WAI-ARIA tabpanel) d'un système d'onglets est forcément lié à un ensemble d'onglets (rôle WAI- ARIA tablist) ; · Utiliser en remplacement d'un rôle ou d'une propriété WAI-ARIA mal supporté, un rôle ou une propriété WAI-ARIA équivalent, offrant un comportement et une restitution similaire. Note 2 : Le fait d'enrichir un motif de conception de rôles ou propriétés WAI-ARIA supplémentaires dont la compatibilité avec l'accessibilité est contrôlée par le test de restitution sur l'environnement de test (ou « base de référence ») ne constitue pas une adaptation d'un motif de conception. Par exemple l'ajout de l'attribut WAI-ARIA aria-hidden sur les panneaux (rôle WAI- ARIA tabpanel) d'un système d'onglets ne définit pas un motif de conception adapté.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "cf453d124c394f81b9ef5327dbe3bf69", "next_id": "9eb81c53dbc845938313481531378a56", "prev_id": "c7458833f6b3427bade0a6eb03237cc5", "associated_block_ids": [], "first_page": 115, "last_page": 116, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice évalue la compréhension des rôles WAI-ARIA et leur importance pour l'accessibilité, ce qui est pertinent dans le contexte de la définition de l'identité sonore d'un site web. Cependant, il ne teste pas directement les concepts clés liés à l'identité sonore ou à la conception UX mentionnés dans la référence. Bien que l'accessibilité soit un aspect fondamental, l'exercice pourrait être amélioré en intégrant des questions plus spécifiques sur comment les éléments sonores peuvent être adaptés pour répondre aux besoins des utilisateurs, plutôt que de se concentrer uniquement sur les rôles WAI-ARIA."}, {"exercise": {"id": "a18931b80bd24eeabfd44ab30e2abc15", "question": "Que permet l'attribut WAI-ARIA aria-label ledby ?", "answers": ["Associer un texte alternatif et une description détaillée"], "distractors": ["Associer deux sections de texte différentes", "Séparer les parties importantes d'un contenu", "Définir le rôle d'un élément visuel", "Associer plusieurs labels à un élément", "Gérer la hiérarchie des éléments interactifs", "Marquer les éléments interactifs d'une page", "Configurer l'ordre de navigation des éléments", "Cacher certains éléments aux lecteurs d'écran", "Associer plusieurs scripts à une fonctionnalité"], "feedback": "L'attribut WAI-ARIA aria-label ledby permet d'associer à un élément une alternative textuelle, qui sera utilisée par les lecteurs d'écran par exemple, et une description détaillée, qui fournit plus d'informations sur le rôle ou la fonction de l'élément pour les utilisateurs non-voyants.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur l'attribut WAI-ARIA, qui est pertinent dans le contexte de l'accessibilité et de l'identité sonore d'un site web. Bien que la question ne traite pas directement de la définition de l'identité sonore, elle aborde un aspect crucial pour garantir que tous les utilisateurs, y compris ceux ayant des limitations auditives ou visuelles, puissent interagir avec le contenu audio-vidéo. Cependant, l'exercice pourrait être amélioré en se concentrant davantage sur les éléments sonores spécifiques ou leur impact sur l'expérience utilisateur plutôt que sur un attribut technique isolé. Cela explique pourquoi il obtient une note relativement bonne mais pas parfaite."}, {"exercise": {"id": "43ed5db4b45b4c63965cd7cf6749ea3c", "statement": "L'attribut WAI-ARIA aria-label contient à la fois l'alternative textuelle et une référence à une description détaillée adjacente.", "veracity": false, "feedback": "L'attribut WAI-ARIA aria-label ne contient que l'alternative textuelle. La référence à une description détaillée est mentionnée séparément, mais ne fait pas partie de l'attribut aria-label lui-même.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "a300112f71e243ea829b4c6432c53c3b", "order": 2.0, "image_url": null, "origin_type": "document_content", "text": "Il existe une gestion de cas particuliers lorsque l'image est utilisée comme CAPTCHA ou comme image-test. Dans cette situation, où il n'est pas possible de donner une alternative pertinente sans détruire l'objet du CAPTCHA ou du test, le critère est non applicable. . Il existe un attribut WAI-ARIA aria - label contenant l'alternative textuelle et une référence à une description détaillée adjacente.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "844b6efb54994089bdb6b357124a8b5b", "prev_id": "fd8c235e705641db938b570bf54dd3f0", "associated_block_ids": [], "first_page": 24, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice teste la compréhension d'un aspect technique lié à l'accessibilité, qui est un élément clé de la définition de l'identité sonore d'un site web. Bien que l'attribut WAI-ARIA soit pertinent pour garantir que le contenu audio-vidéo soit accessible, l'exercice ne couvre pas directement les concepts plus larges de conception UX ou d'intégration sonore dans le contexte du montage son ou vidéo. Il se concentre sur un détail spécifique plutôt que sur une évaluation globale des compétences nécessaires pour définir une identité sonore efficace. Cela limite sa pertinence par rapport à l'ensemble des objectifs d'apprentissage liés à la référence."}, {"exercise": {"id": "bf47f33226de4cdab9e487370d70123e", "statement": "L'attribut WAI-ARIA aria-labelledby permet d'associer un passage de texte alternatif et un autre passage pour une description détaillée.", "veracity": true, "feedback": "L'attribut 'aria-labelledby' est effectivement utilisé pour lier des passages de texte, où l'un sert d'alternative textuelle (comme une étiquette) et l'autre fournit une description plus détaillée. Cela aide à améliorer l'accessibilité pour les utilisateurs de technologies d'assistance en leur offrant plus d'informations contextuelles sur les éléments d'une interface.", "difficulty": "unknown", "concepts": [], "sources": [{"id": "acb94715b6e24f36b45a27ca5df93e2a", "order": 1.0, "image_url": null, "origin_type": "document_content", "text": ". Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria- label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée. . Il existe un attribut WAI-ARIA aria - label ledby associant un passage de texte faisant office d'alternative textuelle et un autre faisant office de description détaillée.", "short_summary": null, "long_summary": null, "title": null, "html_tag": "p", "children_ids": [], "parent_id": "17f45a4d1d9a4a8d9fe9739f4acf9660", "next_id": "d4fcf3d2aaf941ca865fedbd9ff8e77e", "prev_id": "b376614e755f4df2804cbb436ee9b3c4", "associated_block_ids": [], "first_page": 27, "last_page": 27, "start_time": null, "end_time": null, "doc_id": 13708, "doc_label": "RGAA - Référentiel v4.1", "corpus_id": 638, "corpus_label": null, "publication_date": null, "categories": [], "score": 1.0}], "lang": "fr"}, "score": 6, "justification": "L'exercice porte sur l'attribut WAI-ARIA 'aria-labelledby', qui est pertinent pour le sujet de l'accessibilité dans la définition de l'identité sonore d'un site web. Bien que cet aspect soit important, l'exercice ne couvre pas directement les concepts clés liés à la conception de l'identité sonore ou à l'expérience utilisateur (UX) en général. Il se concentre plutôt sur un détail technique spécifique sans aborder comment cela s'intègre dans une approche holistique de l'identité sonore et de l'interaction multimédia. Par conséquent, bien qu'il soit pertinent, il ne teste pas pleinement la compréhension des éléments centraux du sujet."}], "sources": [{"document": {"id": 13708, "label": "RGAA - Référentiel v4.1", "authors": [], "title": "Accessibilité Numérique : Référentiel Général d'Amélioration", "content": [], "mime_type": "application/pdf", "short_summary": "Le RGAA 4.1 définit les normes d'accessibilité numérique en France, visant à garantir l'accès aux services en ligne pour les personnes handicapées. Il inclut des critères de conformité et des méthodes de vérification.", "long_summary": "- Mise à jour du RGAA basée sur la version 4.0 de septembre 2019.\n- Norme de référence pour la conformité : EN 301 549 V2.1.2 (2018).\n- Définition de l'accessibilité numérique et son importance pour les personnes handicapées.\n- Critères d'accessibilité : perceptibles, utilisables, compréhensibles, robustes.\n- Exemptions possibles pour charge disproportionnée et certains contenus.\n- Évaluation de la conformité par auto-évaluation ou tiers sur un échantillon représentatif.\n- Déclaration d'accessibilité obligatoire avec engagement des organismes concernés.\n- Résultats des tests indiquant le taux de conformité aux critères RGAA.\n- Retour d'information et contact pour signaler des défauts d'accessibilité.\n- Intégration de l'accessibilité dans la stratégie numérique des organismes.", "url": "https://static.stellia.ai/g4lkF0qJjoFNYauO/qHLM6NcYOeFxC2Nv/documents/8af3ae7_rgaa-referentiel-v4.1.pdf", "external_url": null, "path": null, "corpus_id": 638, "publication_date": null, "created_at": null, "synthesis": {}, "structure": "- # Notes de révision\n\n  - ## Table des matières\n\n- # 2.\n\n- # 1\n\n  - ## Règles de mise en œuvre des obligations en matière d'accessibilité numérique\n\n    - ### 1.1 Notion d'accessibilité numérique\n\n    - ### 1.2 Rappel du champ d'application\n\n      - #### 1.2.1 Contenus concernés\n\n      - #### 1.2.2 Contenus exemptés\n\n    - ### 1.3 Norme de référence et niveau de conformité\n\n    - ### 1.4 Dérogation pour charge disproportionnée\n\n    - ### 1.5 Évaluation de la conformité à la norme de référence\n\n      - #### 1.5.1 Cadre général\n\n      - #### 1.5.2 Échantillon\n\n      - #### 1.5.3 Environnement de test (ou « base de référence »)\n\n        - ##### 1.5.4 Test des pages\n\n      - #### 1.5.5 Taux de conformité à la norme\n\n  - ## 1.6 Déclaration d'accessibilité\n\n    - ### 1.6.1 Contenu de la déclaration d'accessibilité\n\n- # DÉCLARATION D'ACCESSIBILITÉ\n\n- # ÉTAT DE CONFORMITÉ\n\n- # RÉSULTATS DES TESTS\n\n- # CONTENUS NON ACCESSIBLES\n\n- # RETOUR D'INFORMATION ET CONTACT\n\n- # VOIES DE RECOURS\n\n  - ## 1.6.2 Validité de la déclaration d'accessibilité\n\n  - ## 1.6.3 Publication de la déclaration d'accessibilité\n\n  - ## 1.6.4 Réponse aux usagers\n\n  - ## 1.7 Schéma pluriannuel de mise en accessibilité\n\n    - ### 1.7.1 Contenu du schéma\n\n    - ### 1.7.2 Publication du schéma\n\n      - #### 1.8 Mentions et pages obligatoires\n\n        - ##### 1.8.1 Mention obligatoire sur la page d'accueil\n\n        - ##### 1.8.2 Page accessibilité et liens obligatoires\n\n- 2 Méthode technique de vérification de la conformité à la norme de référence\n===\n\n  - ## 2.1 Introduction\n\n  - ## 2.2 Critères de contrôle du RGAA\n\n    - ### 2.2.1 1. Images\n\n  - ## · Test 1.3.7 : Pour chaque image bitmap (balise <canvas>) porteuse d'information, ayant une alternative textuelle ou un contenu alternatif, cette alternative est-elle pertinente (hors cas particuliers) ?\n\n    - ### Note technique\n\n      - #### Note technique\n\n        - ##### 2.2.2 2. Cadres\n\n  - ## Critère 2.2 Pour chaque cadre ayant un titre de cadre, ce titre de cadre est-il pertinent ?\n\n    - ### 2.2.3 3. Couleurs\n\n  - ## Cas particuliers\n\n    - ### 2.2.4 4. Multimédia\n\n  - ## Cas particuliers\n\n    - ### 2.2.6 6. Liens\n\n      - #### Note technique\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.7 7. Scripts\n\n          - ###### 2.2.8 8. Éléments Obligatoires\n\n            - ####### 2.2.9 9. Structuration de l'information\n\n              - ######## 2.2.10 10. Présentation de l'information\n\n        - ##### Cas particuliers\n\n          - ###### 2.2.11 11. Formulaires\n\n  - ## Références\n\n    - ### Cas particuliers\n\n    - ### Cas particuliers\n\n      - #### 2.2.13 13. Consultation\n\n        - ##### Cas particuliers\n\n          - ###### Accolés (étiquette et champ accolés)\n\n            - ####### Alternative (à script)\n\n  - ## Alternative à une image SVG\n\n    - ### Alternative courte et concise\n\n  - ## Alternative textuelle (image)\n\n    - ### Audiodescription synchronisée (média temporel)\n\n      - #### 2.3.2 B\n\n        - ##### Menu et barre de navigation\n\n      - #### 2.3.3 C\n\n  - ## CAPTCHA\n\n  - ## Champs de même nature\n\n  - ## Champ de saisie de formulaire\n\n  - ## Changement brusque de luminosité ou effet de flash\n\n  - ## Changement de contexte\n\n    - ### Changement de langue\n\n      - #### Code de langue\n\n  - ## Compréhensible (ordre de lecture)\n\n  - ## Contenu alternatif\n\n  - ## Contenu caché\n\n  - ## Contenu visible\n\n  - ## Contexte du lien\n\n  - ## Contraste\n\n    - ### Contrôle (contenu en mouvement ou clignotant)\n\n  - ## Contrôle de saisie (formulaire)\n\n    - ### 2.3.5 E\n\n      - #### Ensemble de pages\n\n        - ##### En-tête de colonne ou de ligne\n\n  - ## Environnement maîtrisé\n\n    - ### Étiquette de champ de formulaire\n\n      - #### Étiquettes cohérentes\n\n        - ##### 2.3.6 F\n\n  - ## Formulaire\n\n    - ### 2.3.7 G\n\n  - ## Gestes complexes et gestes simples\n\n    - ### 2.3.8 I\n\n  - ## Image objet\n\n  - ## Image porteuse d'information\n\n  - ## Image réactive\n\n    - ### Image-test\n\n  - ## Image texte\n\n  - ## Image texte objet\n\n    - ### Indication de champ obligatoire\n\n      - #### Indication du type de données et/ou de format\n\n        - ##### Information (donnée par la couleur)\n\n          - ###### Intitulé (ou nom accessible) de lien\n\n  - ## Lien image :\n\n  - ## Intitulé visible\n\n    - ### Items de même nature d'une liste de choix\n\n      - #### 2.3.9 L\n\n  - ## Landmarks\n\n    - ### Langue par défaut\n\n    - ### Le nom, le rôle, la valeur, le paramétrage et les changements d'états\n\n      - #### Légende\n\n  - ## Légende d'image\n\n    - ### Lien ou bouton adjacent\n\n  - ## Lien composite\n\n    - ### Lien dont la nature n'est pas évidente\n\n  - ## Lien image\n\n  - ## Lien texte\n\n    - ### Liens d'évitement ou d'accès rapide\n\n  - ## Lien SVG\n\n  - ## Listes\n\n    - ### Liste des valeurs possibles pour l'attribut autocomplete\n\n      - #### 2.3.10 M\n\n        - ##### Mécanisme de remplacement\n\n  - ## Mécanisme qui permet d'afficher un rapport de contraste conforme\n\n    - ### Média non temporel\n\n  - ## Média temporel (type son, vidéo et synchronisé)\n\n    - ### Message de statut\n\n    - ### Motif de conception\n\n      - #### 2.3.11 O\n\n        - ##### Ordre de tabulation\n\n      - #### 2.3.12 P\n\n    - ### Passage de texte lié par aria- labelledby ou aria-describedby\n\n      - #### Présentation de l'information\n\n        - ##### Pressé ou posé\n\n          - ###### Prise de focus\n\n      - #### Procédé de rafraîchissement\n\n      - #### Propriété CSS déterminant une couleur\n\n        - ##### 2.3.13 R\n\n          - ###### Raccourci clavier\n\n  - ## Redirection\n\n  - ## Règles d'écriture\n\n  - ## Relâché ou relevé\n\n  - ## Résumé (de tableau)\n\n    - ### 2.3.14 S\n\n  - ## Sens de lecture\n\n  - ## Site web : ensemble de toutes les pages web\n\n    - ### Sous-titres synchronisés (objet multimédia)\n\n  - ## Structure du document\n\n  - ## Système de navigation\n\n    - ### 2.3.15 T\n\n      - #### Tableau de données\n\n  - ## Tableau de données ayant un titre\n\n    - ### Tableau de données complexe\n\n      - #### Titre de cadre\n\n    - ### Transcription textuelle (média temporel)\n\n  - ## Type de document\n\n    - ### Type et format de données\n\n      - #### 2.3.16 U\n\n    - ### Version accessible (pour un document en téléchargement)\n\n  - ## Zone cliquable\n\n  - ## Zone d'en-tête\n\n  - ## Zone de contenu principal\n\n    - ### Zone de pied de page\n\n  - ## Zone non cliquable\n\n    - ### 2.4 Environnement de test (ou « base de référence ») pour la restitution des contenus web par les technologies d'assistance\n\n      - #### 2.4.1 Environnement de test Ordinateur (desktop)\n\n      - #### 2.4.2 Environnement de test Terminal mobile\n\n      - #### 2.4.3 Autres environnements\n\n      - #### 2.4.4 Environnement maîtrisé\n\n    - ### 2.5 Références documentaires\n\n      - #### 2.5.1 Documents de référence\n\n      - #### 2.5.2 Autres documents\n\n    - ### 2.6 Licence\n", "number_of_pages": 128, "duration": null, "thumbnail_url": null, "reference_doc_id": null, "associated_doc_ids": [], "status": {"phases": [{"phase": "upload", "status": "pending", "error_message": null}, {"phase": "parsing", "status": "completed", "error_message": null}, {"phase": "concept-generation", "status": "pending", "error_message": null}, {"phase": "qa-generation", "status": "pending", "error_message": null}, {"phase": "exercise-generation", "status": "pending", "error_message": null}]}}, "score": 7.8, "top_pages": [125, 22], "top_minutes": []}]}